[{"index": 0, "review": "I'll take one star down for the cleanliness of the place, the dining area and the windows. \nThe sandwiches are pretty good and fresh. Stuff is nice and the place is not crowded. \nToo bad it looks like a neglected place from the outside, took us two years to try this place. Passing it every day and never had the urge to eat here. \nPLEASE CLEAN THE PLACE!!!", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 1, "review": "I come here all the time and get the fullest best sandwiches, this time was disappointed to open and my wrap and picked up the sandwich, to find out it broke apart and lettuce spilt all over me. Mustard got all over my hand and the first half I picked up just fell apart and lettuce came out everywhere.Usually my wraps are packed with tons of meat and ingredients, this wrap had 3 slices of salami and 1 slice of ham; was all lettuce. I'm disappointed at whoever thought this was a satisfactory portionate wrap for a customer.", "name": "TOGO'S Sandwiches", "rating": 2}, {"index": 2, "review": "Keeping my ratings but I just wanted to add a few more things. I have officially chosen Togo's over Subway. \n\nTurkey and avocado is my go-to, simple yet satisfying. Today, I wanted to get in the hype trying their pastrami sandwich and YES! It's so good! The meat was thinly sliced and has that peppery taste to it. Every bite was so worth it. \n\nNever had a bad experience at this location.", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 3, "review": "I ended up with the triple dip, added bacon, lettuce and onion! The employee who made my new invented quad dip created a piece of art! Check out the pic of this beauty! It tastes even better then it looked! I didn't catch his name but he was working around 1pm and was at the end of the counter near the soda machine, good work my dude!", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 4, "review": "Friendly workers and great sandwich! I like the daily deal in particular since it also comes with a free drink.", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 5, "review": "If your not open don't put the sign on you just lost a customer... wasted my time parking because of the open sign", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 6, "review": "I live about a good mile or 2 away and wanted to pick up dinner and get around to walking my dogs at the same time. I called ahead and Yvonne graciously offered to bring my food outside to me so I wouldn't have to drag my big boys inside/ tie them to a post. Yvonne and Yvette (sp?) were so accommodating, professional, and nice over the phone and in person. I felt personally cared for in the middle of their dinner rush and sing high praises about their customer service. Togo's is perfect for a quick grab, but gourmet sandwich. Thank you to the staff the other night for being so awesome!", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 7, "review": "Two day ago I go to ToGo 's I like service good food sandwiches quick service by one second drink free baby seeds and price", "name": "TOGO'S Sandwiches", "rating": 3}, {"index": 8, "review": "I was in the area and decided to grab some lunch on the way home. When I got there, I was the ONLY CUSTOMER in there. I asked for a combo, roasted beef and an Asian chicken salad. When I got home, I looked into my bag and I couldn't find any salad dressing in my bag. So I drove myself back to togos, did I mention I live 20mins away. When I arrived I dumped out everything from the togo bag and showed them I had no salad dressing. They gave me the salad dressing and they tried to offer me some free drink, but I didn't want it. I just want to enjoy my salad with salad dressing. Once I got home and enjoyed my salad, I went on to the main course, the roast beef. Once I opened the wrapper, I saw that it was only 1 piece of meat in there! WTF! I just wanted to enjoy a nice lunch on the way home, instead I got a headache and unsatisfied stomach!! Never again!", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 9, "review": "Togo's is my favorite chain sandwich by far.  I don't go here very often, but I'm always satisfied.  The food is well portioned, fresh and tasty.  The people are friendly and helpful.\n\nI usually order wraps, but today I changed it up and tried their new Cuban Sandwich.  This was a mistake I personally take responsibility for because I had the wrong expectations.  Great Cuban sandwiches are made by real Cubanos in places like Havana or the Little Havana neighborhood in Miami.  A special sandwich press is critical to get these right.  I know this.  I know better, however I saw Cuban Sandwich on the menu and said to myself, \"I LOVE those, I'm gonna get that.\"  I didn't like this sandwich at first, but once I realigned my expectations it was okay.  It's a Togo's sub with Cuban Sandwich ingredients on it: pulled pork, ham, cheese, mustard, pickles, sort of smashed.  If that's what you want it will be good.  The pressing was where it really failed and the ingredients were fast-foodish, not foodie-foodish.  I knew where I was, I rolled the dice, not great but as a Togo's sandwich good for sure.  My fault for ordering it, but I'm an optimist, I like to believe things can surprise me in a good way so I sometimes take risks.  Character flaw?  Nah, you win some, you learn some.\n\nOverall I like Togo's a lot.  This location is a gem, the people are great.  I'll be back.", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 10, "review": "I've only been to this Togo's two-three times due to them being in the same shopping center at Mr. T's (my barber).  Whenever I go to Mr. T's on a Friday or Saturday afternoon, the wait time can be up to two hours.  With two hours of time to kill, I usually begin by grabbing some food.  \n\nSome facts:\n\n* For the most part, the employees whom I've dealt with have been friendly and cordial.\n* Compared to other Togo's locations I've been to before, this particular one has a lot of seating.\n* They're very quick at getting your sandwich ready.  They will usually have one employee who will make your sandwich and another who will take your payment.\n\nOverall, I've got no major complaints.  When you take into account that the shopping center that this Togo's is in is located right next to Santa Clara High School, you should definitely expect this place to be packed with students and faculty during peak lunch hours on weekdays.  \n\n4 stars", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 11, "review": "Every time I come here, togos offer the check in special with a free drink.  Fast easy service.\n\nGet the new boom boom pastrami.  Bomb.com", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 12, "review": "Wait time is very long even when there's only 1-2 customers. One person making the sandwich and the rest eating or walking back and forth from the back to front. No one greeted me and or even said, I'll be right with you. It was as though I was invisible to them.  The guy making the sandwich didn't even bother to spread the condiments in my sandwich.  Just used the bottle and squeezed some in and that was it.  Probably the worst tasting togos I've ever had from all the other locations nearby that I have been to.  Dry and no flavor.  Will never return to this location again.", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 13, "review": "Disgusting vegetarian sandwich. Hummus was old and stale, and the vegetables were soggy. I had a bite and threw the rest of it. \n\nIf you're a vegetarian, don't ever have the veggie sandwich.", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 14, "review": "i eat here all the time and really like it.  however, please bring back the southwestern green chile chicken soup!  i love that stuff and my life is not as good without it....", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 15, "review": "I come here quite often. I get the same damn thing... Like every time I go in there. They have a new employee a short Hispanic dude... And for one I just got a really weird Feeling of him. Plicae always order my sandwich the veggie with Pepper jack cheese I wait for them to complete that when they ask anything else before they close it I tell them that I would like hummus and jalapeño on it. \n\nFor one the sky didn't get at first I wanted hummus and jalapeño on the damn sandwich. \nWhen I normally order they just put it on The thing. This guy started to actually argue with me. I mean phone aggression argument. \nHe kept asking me how many scoops saying it was a dollar per scoop. Like I said usually when I go in there they just make it I never tell how many scoops. And I never end up with a $20 sandwich. \n\nOne other guy I assumed was the manager Who I have seen multiple times in the store, didn't even stop in. And he seen them make it multiple times. \n\nMy main concern here was the customer service standards. I work in customer service and the place we actually had to smile but you might be the most pitstop person in the world. This guy had no customer service skills and for lack of a better phrase... He was a jerk. \nSo this place TOTALLY lost a customer.", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 16, "review": "Wow just had lunch with my husband, very disappointed... First off our server was just blah, maybe cause his shift ended right after he helped us.. Every single table was dirty and there was only one other person dining in.. the music they had on was just Static, the TV was flickering along with the static ugh... we ate half our sandwiches and left... all four workers were just standing around talking... I guess the only good Togo's in the area this good is on Lafayette/Franklin!!!! What a shame young kids should not be left to run a busyness into the ground! We won't be back!!!", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 17, "review": "Recently I came in to grab a quick bite after my sons JV football game. There was this Mexican man who look really black/dark with glasses on helping me out. He came off to me being super rude. Was talking smack about me in Spanish with his co workers making it seem like I did not understand him. He should be FIRED for the way he was treating me. He didn't even wash his hands when he was making my sandwich.\n\nDO NOT COME HERE AT ALL!", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 18, "review": "Tony you give this establishment a bad name. I asked to use the restroom before placing my order and you refused because you said I'm not a customer. Then I said fine and will purchase something and then you refused to take my order. You later responded that \"you guys come in to use our bathroom and then I have to clean it up\" well then you shouldn't have signed up for that position! You sound racist and will be reporting you to corporate headquarters!", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 19, "review": "We have enjoyed Togo's since we were in High School ourselves, but we try to make sure we cook most of our meal. Of course there are those days that we do not want to cook, because we have been out all day and doing some family activity, and we encountered one of these day.\n\nWe arrived and were greeted by very two friendly employees and they asked if we know what we wanted. The good thing I get the very same item (#9, large, on onion roll), so I ordered and asked for extra red onions, my wife order and our meal was done before we were done arguing who was going back to the car to see which kids is in trouble.\n\nWe were out of Togo's with our food within eight minutes, and trust us the quality of our meal was very good and tasty.", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 20, "review": "Been coming here for many years. Today messed up my order and manager named Tony was extremely rude and argued with me, when he finally gave me my money back, he shorted me AND threw it at me. Other customers who saw it were as shocked as I was. Nice Tony, just lost a local regular", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 21, "review": "The sandwich was fine.  The staff were inept, and rude.\nI have been in the foodservice industry since I was 16.\nThe way I was treated, and under the guise of \"We're busy\" didn't cut it.  A cashier, three sandwich makers and only 2 other people in line...  Busy?  Really?\nYou need another career and lessons on how to speak to a customer", "name": "TOGO'S Sandwiches", "rating": 2}, {"index": 22, "review": "Great, I love the sandwiches here.\n\nReally close to the high school and right next to a 7 Eleven so sometimes there's a lot of teen traffic in the area.\n\nMy favorite time to visit is on weekends if there's too much to do and I don't have time to make lunch.\n\nGreat daily specials, too!\n\nClean dining and sandwich prep area. Friendly staff. Never had a problem here.", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 23, "review": "Very friendly employees!\n\nThe only issue is with parking.  It seems that on Fridays and Sundays there is some kind of event at a restaurant in this shopping center.  Parking is horrendous.  It would be nice if the owner could put up a couple of reserved signs for some spots just for Togos customers...", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 24, "review": "This restaurant is full of incompetent employees who can't get your order correct DONT GO HERE! There is better sandwiches at subway. There menus has been changed to remove almost all the old favorites and is now a bunch of crap sandwiches. I have been going to togos since the first one opened  on the San Jose state campus in the 70s I no longer will patronize togos. And when I complained to the manager he didn't even offer to make it right.", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 25, "review": "I've been coming here for close to a decade.\n\nWell-staffed location, and when they get busy, the line moves along at a good pace. Sometimes, there is no line at all.\n\nFriendly and courteous employees. We've never had anyone skimp on ingredients so far. \nWe usually each get a Farmer's Market Salad and split a large Turkey & Avocado. I eat my half of the sandwich without the bread.\n\nEvery now and then, instead of a sandwich, we'll each get a Viva Veggie Wrap (a  toasted spinach wrap with onions, lettuce, hummus, feta cheese, roasted peppers, and balsamic dressing) - I don't eat the spinach wrap, because I have to cut down on wheat comsumption. \n\nThe food is fresh and there is plenty of it. \n\nThey've always had the sourdough available (I've been to other locations that were constantly out of it).\n\nThe tables are wiped down frequently.\n\nSometimes the small bins that hold the trash (there are no regular trash cans available to customers) get very full and almost spill over.\n\nClean bathrooms, and the parking is shared with 7-Eleven.\n\nLocated on Benton and Kiely.", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 26, "review": "No more #25 = No more Togos\nUsed to eat here at least once a week until they discontinue a sandwich I have been eating since I was a kid! Thanks Togos!\n\nJust out of curiosity, why was it removed from the menu?", "name": "TOGO'S Sandwiches", "rating": 2}, {"index": 27, "review": "Check-in and get a FREE medium soda !  On my way home this is our go to Togo's I will stop by to get our dinner sandwiches.... Parking is always a easy time.  Never see a  line in the store... Never a crowd.... \n\nI usually get the Hot Pastrami large !  One of my all time favorite.  And as I check- in on my trusty yelp app... Wooo Hooo I get a FREE Medium soda.  !!", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 28, "review": "I love this Togo's.  The staff is ALWAYS friendly and absolutely hilarious!!!  One sandwich maker always \"pops\" the bag up high up in the air and catches it before he puts the sandwich in.  Like a circus act!!!  Their sandwiches are always delicious.  Yes, they are right down the street from Santa Clara High School, where I work, so expect a line at peak times.", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 29, "review": "Every time I eat Togos, I am nostalgically happy about every past time I've gone to a Togos and eaten a Cheese and Avocado sandwich, a happy amount of mayo and mustard, swiss and provolone, lettuce, pickles, salt and pepper. and now they have sourdough bread! Awesome.\n\nThis location is optimal because you can get your sandwich first, then get a Slurpee at the 7/11 a few doors down. (One of the few 7/11s that sells Apple Heads).\n\nI love their peanut butter cookies, but if I do get a combo from Togos, I usually get salt and vinegar chips to go with my sandwich. I don't even like those chips that much, but my mom always ordered them when I was little, so I think of it as a mandatory part of the Togos experience. \n\nSometimes there are a lot of high school students, because of the high school next door. It's not so bad as long as you know you might get stuck behind some mopey too-cool-for-you lunch rush.", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 30, "review": "This is a really nice Togo's. A lot of the other Togo's are a bit dirty and run-down but this one is very clean and comfortable.\n\nThe food is great too. I finally had a Pastrami sandwich here... and I have to say, it was amazing. Salty heaven.", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 31, "review": "This sandwich joint is awesome! It's on my way back from work so I'm a regular here. I've tried almost all of the sandwiches and they all are a pretty big portion. Nothing is overly greasy or unbearable and it's pretty fairly priced food. Can't complain and this place gets the job done when you're craving a good old sandwich.\n\nThe staff here is also always friendly and they give me a great conversation while I'm waiting for my food. Would definitely recommend this place to my friends!", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 32, "review": "Service was EXTREMELY slow.  We were there with another family, and they had finished eating their sandwiches before ours were even finished being made!  The staff was clearly interested in other things besides customer service.  Two staff members actually went next door to buy ice cream while the line was backed up, then came back into the store and ate them in the break room.  I won't be going back.", "name": "TOGO'S Sandwiches", "rating": 2}, {"index": 33, "review": "Togo's has been my all time favorite sandwich spot since I can remember. I've been to many across the Bay Area, but never have I had such a rotten experience. \n\nI came in half an hour before closing time, and the three staff members working looked at me like I was some kind of evil. They had already put everything away and nobody spoke to me for a minute or two. Finally, the older of the three asked what I would like. I ordered an Asian Chicken Salad, and she flustered about trying to find all the ingredients that the other two had already thrown out or put away for the day. The older employee asked over and over again for where the wantons were, and neither of the other two responded. They all halfheartedly looked in boxes laying around on the floor, until she finally just handed it to me and asked for me to pay. I said \"So...no wantons?\" the woman looked around at the other girls again who continued to look in boxes, still asking me to pay. \"Are there wantons\" I asked. I couldn't get anyone to make eye contact with me, as if I weren't standing there. I directed my question to every one of them who in response looked around confusedly and ignored me completely. \n\nThey did not directly tell me there were no wantons, they did not apologize for not informing me of this before hand, did not offer me anything else, did not even acknowledge there was a problem. I paid and left, never to return (even though I just moved in to a house less than half a mile away). I'll drive the extra distance just to get some competent service, and employees who don't treat me like dirt. \n\nThe ONLY reason this review is 2 stars instead of 1 star is because I still enjoyed the flavor of the salad, wantons or no.", "name": "TOGO'S Sandwiches", "rating": 2}, {"index": 34, "review": "I've been going to this Togo's for over three years now and have not once been disappointed.\n\nI come in here multiple times a week after school with a group of friends, so the guys here at lunchtime pretty much know our orders (right down to how I want mayo instead of oil on my Italian sandwiches). They are always friendly and talkative, and even ask where we've been if we haven't stopped in for a few days. We usually sit in the back corner and talk for a while before leaving, and they never try to push us out the door (they even gave us a free sandwich once when one woman didn't have enough money to pay for it!).\n\nWe've been consistent customers here for a few months, so the GM gives us 10% off as well as free fountain drinks as soon as we walk through the door. Not to mention there's a guy here that can make a perfectly neat sandwich, wrapped and bagged, in 45 seconds flat. They'll even ring you up at the same time, so if I were in a hurry, I could be in and out of here in a single minute.\n\nLong story short, the guys working here at lunchtime on weekdays are the coolest, and the sandwiches are pretty good (ohhh, the pastrami... *drool*). Tip them a couple bucks. They deserve it.", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 35, "review": "Been going here for 15years! Check-In and get a free 20oz fountain drink with your 6\" or larger sandwich purchase. I recommend the #9 Hot Pastrami.", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 36, "review": "I've been to this Togo's hundreds of times (literally), but now I think I'm going to stick with the Stevens Creek location.\n\nI came last night with my parents and the people working there were OBNOXIOUS.  The guy making my sandwich had to ask numerous times what toppings I wanted.  Perhaps if he wasn't singing along to Viva La Vida, he would have heard me the first time?  Then as we were eating, we could hear them squealing at each other and singing along with the radio.  Seriously?  Keep it down, yo.\n\nI unwrap my sandwich to find it's basically a breadwich.  Two paltry pieces of turkey, two measly slices of bacon, and just a few veggies aaaaand that's it.  My dad's salad looked like it was made with iceberg lettuce remnants.  Appetizing?  I didn't think so either.\n\nSkip the juvenile delinquents loitering outside, skip the incredibly annoying sandwich artists (or whatever they're called at Togo's) and go to a different location.  Or better yet - support a local mom & pop restaurant.  They'll make a sandwich that tastes infinitely better at a fraction of the price and they'll serve it with a smile, more than I can say for Togos.", "name": "TOGO'S Sandwiches", "rating": 2}, {"index": 37, "review": "I lived in Santa Clara until 10/31/10, and used to get sandwiches here. At the time, the main concern was that the worst element from the local school likes to gather at their front door, smoke, and generally tell the world how B-A-D they are, and the owners do NOTHING...absolutely NOTHING...to discourage it.\n\nThese future residents of Elmwood like to gather in packs at the front door, block the entrance for customers, and in doing so, prove...beyond the shadow of a doubt...that they are BAD to the BONE, baby.\n\nNow, regarding the sandwiches themselves, when the future parolees of America aren't swarming around...\n\n...everyone knows Togo's has daily specials. When I lived in Santa Clara, I came to THIS Togo's on Monday's for the Meatball Sandwich special.\n\nNow that I live in San Jose, I have two Togo's that I go to...one on Camden, one in the Pruneyard in Campbell...and I go to BOTH on MONDAYS for the MEATBALL SPECIAL.\n\nSo a week ago, I go into the Benton Togo's on a Monday, and order the Meatball sandwich, and it's like $6.50, and I ask \"Isn't this the special?\" And I was told \"Every Togo's has a different special, and ours is pastrami.\"\n\nSo between the lack of Meatball Mondays and the ever-present presence of the dregs of humanity clinging to the front door and the manager who could care less as long as he/she sells sammiches, here is my advice.\n\nFIND A DIFFERENT TOGO'S.\n\nThey are literally everywhere, and there is NO REASON for you to spend your money here.\n\nUnless you're a gang member from the local school.\n\nThen you can show the world how BAD you are by smoking two inches from the front door, which you're blocking.\n\nMy only regret with this review is that I can't give \"0\" stars, but if you're reading it, that's what it is...a \"0 star\" review.", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 38, "review": "Maybe Togo's in general just isn't as good as it was 10 years ago. I used to love the chain but this place is just all right. Sandwiches are OK, but seemed like mostly bread which didn't used to be the case with Togos. Wouldn't avoid this place if I was hungry but wouldn't necessarily come on purpose. Still better than Subway, but, meh. Restaurant feels a bit dingy / depressing.", "name": "TOGO'S Sandwiches", "rating": 3}, {"index": 39, "review": "I've never been more mad at a sandwich maker. I'm not a huge fan of TOGO's but last time I had it by SJSU, it was possibly one of the best sandwiches I've ever had in my life. \nSo based on my good experience, I came by this place by benton. Five words: KILLED my whole TOGO's experience. Litereally, it's going to take a lot for me to go back to togo's now. \n\nI ordered a pastrami, with everything. The pastrami was dried out, and the guy who made it attempted to flirt with me while making the sandwich, which wouldn't be a crime if my sandwich came out good. It was horrible. I asked for everything and I got only lettuce and mustard for most of the sandwich. Toward the end a slice of tomato was hiding in the corner and no onions.  I ate this sandwich in bitter resentment. It was overall a TERRIBLE sandwich and togo's experience.\n\nBottom line: Go to a different TOGO's! and be serious about getting a good sandwich next time you order.", "name": "TOGO'S Sandwiches", "rating": 2}, {"index": 40, "review": "I will always choose this togos over the one by my house. The salads are super fresh and yummy! I don't eat the sandwiches here, but I come at least once a week for an Asian salad or Cesar. The customer service is AMAZING! The staff remembers me because I'm always in here and the manager even gave me a complimentary drink once for being a loyal customer! Love this place!", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 41, "review": "Went here for lunch today. Walked in to a sign that read Regular Roast Beef Dip $6.25. Ordered my sandwich and when they rang me up $8.25. I told the cashier it was $6.25. The lady making my sandwich said the sign was old and its $8.25 now. They didn't give it to me for the price I was mislead to believe it was. I pointed out the sign, which they knew was old but left there to mislead all of their customers! They took it down, but too late. This is one customer they obviously do not care about, will not go back to this sandwich shop again. Plus the sandwich didn't have much flavor and was burnt. Lots of new sandwich places to try.", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 42, "review": "The service I received here was great and I have no doubts now that this is a clean establishment. My sandwich was for the most part tasted satisfactory. But I had two issues for which I was bummed out... \n\n1. When I walked in, I was immediately and awkwardly greeted by 4 people staring at me as if I walked into someone's private residence unannounced. They were all fiercely cleaning and it smelled VERY much like a dirty mop and a not so great smell of a chemical...So much so that I actually asked if they were open (it was 3pm).\n\n2. I guess it's my bad for not knowing?... but I didn't know that when you say you want \"American\" cheese, it's not the SAME \"American\" as when you say it at Subway. Isn't there any crossover for a standard of cheese names or something? Oh, well. I guess it's my fault for not paying attention but the chemicals were making me want to run for the door as fast as I could.", "name": "TOGO'S Sandwiches", "rating": 3}, {"index": 43, "review": "Not sure I'll come back to this location. It had been awhile since I've been here and ordered the avocado and cucumber sandwich with no mayo or mustard. Later that day my stomach was upset.  Wondering if it was the avocado..........\n\nI'll stick to Hungry Hound for veggie sandwiches.", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 44, "review": "I didn't know they make such an excellent quality sandwiches at this Togo's location and so close to my home. The bread is # 1 very important... everything is so fresh and delicious.\nI tried the sour dough bread with Chicken Salad and Cheese \"Mama Mia\" \nThis is going to be my new place to really enjoy a Quality Sandwich.\nPlus the people there are very nice.\nThank you TOGO'S", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 45, "review": "Just had Togo's Saturday Special: $5 gets you a #3 Turkey and Cheese Sandwich plus chips and a drink or $3.99 for just the sandwich!\n\nCrazy Combo Daily Schedule:\nMonday - Local Favorite\nTuesday - #29 Chicken Salad\nWednesday - #16 Italian\nThursday - Local Favorite\nFriday - #20 Albacore Tuna\nSaturday - #3 Turkey and Cheese\nSunday - #24 Turkey & Avocado", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 46, "review": "I love the quality, the price-points are fine, and the location is convenient. The people who work here are friendly. But when they get the order wrong 75%-80% of the time, I really can only give this particular location 2 stars. \n\nIn the past, it's been a lot better, but for the last few months (as of this writing), most of my orders are wrong & I order for my whole family at *least* once a week....\n\nUPDATE (10/12/11): After my review (which was written right after another wrong order), I posted on the company page on Facebook about my experience. I got an immediate reply with an email address to explain fully what my unresolved issues were. A few days later I got a note saying they were going to share some feedback with the store, and they were sending me a gift card. I can't give the store more stars yet, until I see the orders are correct more of the time, since that is what my complaint was about. But I *am* willing to give the store another try because of the excellent & responsive customer service!", "name": "TOGO'S Sandwiches", "rating": 2}, {"index": 47, "review": "Like any other togo's the sandwiches are pretty good.\n\nUnlike most other togo's ive been to before, this one is kinda dirty. The floors are almost always sticky and there are usually teenagers from santa clara high school loitering around the front being annoying.\n\nThere are other togo's nearby, if you don't want to be bothered by kids, avoid this one!", "name": "TOGO'S Sandwiches", "rating": 3}, {"index": 48, "review": "The food at Togo's is great at any other location except this one. My order is correct less than half the time I come here. Today, I ordered avocado on my sandwich. They told me it would cost $1 extra, which I didn't mind, so they charged me. I got home to eat my sandwich and there was no avocado on it. Last time I came to this location, the lady making my sandwich asked me if I wanted a large sandwich, and I told her three times, \"No, regular.\" Well, she rang me up and it was a large sandwich. I didn't want the food to go to waste, so I just paid for it and left. The time before that, my dad ordered a sandwich, got home, and there was no meat on his pastrami sandwich. He went back and they added the meat, but it was an inconvenience for him to go back and they didn't compensate him. I'm done being duped by the incompetent employees at this location. I will instead go to the one on Lafayette. It's a bit further from my house, but at least I know they can get my order correct. I'd also like to add that the scratchiti at the food counter was unappealing.", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 49, "review": "I LOVE this Togo's! Of course it's conveniently located right near my work but they are so fast at this location. Just as quickly as I can order and pull out my wallet, they are already done making my sandwich AND the quality is always there. The manager at lunch is pretty funny, too--always nice to get some comic relief on my lunch hour.", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 50, "review": "Love Togo's!!  I've been coming to this specific location since at least 1989 - never disappointed.  Left home and traveled the world and I still think about Togo's - it's litereally the first stop I make whenever I'm back in town.  My family is now hooked as well and that comes with the highest recommendations.\n\nHave never been disappointed by the service - have noticed in the last few trips that the workers are older, where in my young years they always seemed to be employing high school/college students - maybe they still do and I came late in the evening, but have never received attitude or bad service.  \n\nRecently ordered the classic BBQ beef brisket, and two other sandwiches for the family, I can't remember what my wife ordered, my mind was consumed by that beef brisket.  I always think I'm going to order something else, but it never fails, bbq beef is the old stand-by, love it!!", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 51, "review": "This is the closest Togo's to my place. Every time I come they are always very nice and haven't messed up an order yet (which is saying a lot). My husband and I always get pastrami. I don't think I've ever order any other type of sandwich here. One time I had to wait for ever and a day for my order to finish (I guess the pastrami wasn't ready). The lady gave me a free drink for waiting, I cant say no to free! If you don't come during the 2-330pm rush when the high schoolers get out of school, the wait isn't so bad.", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 52, "review": "I like Togo's sandwiches. They're large and taste good. I usually get the pastrami sandwich (I forget what number it is). They make the sandwich there right in front of you so, there should be no mess ups as far as what you want on your order. The price isn't too bad either for the size of sandwich you are getting.\n\nThis specific one is by the high school, so there could be plenty of students walking by or eating there. Most of the staff probably comes from the high school too.\n\nParking's not a problem, they have plenty of spaces.", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 53, "review": "Great togo's. It's right by my work. Most the people there are very nice. If you go to this togos make sure veronica (I believe that's her name) makes your sandwiches. She is very nice and really good with customers. Ive order over 5 sandwiches with ridiculously complicated specifications for each sandwich and she has never messed up a single one! I have nothing bad to say of the other employees but she has helped me the most and she is so nice and helpful every time!  Also The manager there (i think he is) is a very nice guy. He will make sure that you're satisfied with your experience there. This place is great. I'm not gonna babble about the food because it's a chain an either you like the place or you don't. But this one is my favorite because the management and the employees make sure you have a great experience and that you're satisfied with your food.", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 54, "review": "I got a #30 Turkey & Bacon Club today, 9\" large for $6.79.  Was a really good sandwich, I'll probably be getting that more often, but there were some good & bad things to share, about this Togo's:\n\nGood:\n   * Service was good, my sandwich maker was articulate (in making the sand) and the lady taking the cash was enthusiastic and smiling (oh how rare~) everyvbody was moving fast trying to keep the line moving.\n   * Sandwich ingredients were fresh and tasty, turkey which I usually don't like, or maybe thought i didn't like, i liked~\n\nBad:\n   * Location, location, location.  This surroundings of this location suck.\n   * Sits directly next to a shady laundromat, and an old 7-11 and a busy VTA bustop, perhaps the worst combination for quality of neighbors and peace of mind while exiting your car.\n   * 2 girls, SC High school students cutting class, sitting on the ground next to the entrance, asking for money.  Always lots of kids \"hanging out\" in the parking lot.\n\nSubway doesn't have this particular sandwhich, but you can order a Turkey with Bacon, w/Bacon as a side for $6.99.  Taste-wise, they're comprable but Subway is 12\", 3 more inches, but seems like its mostly bread than meat.  Togo's kinda shreds the turkey meat (breast?) its not pressed, while Subway's is the sliced sandwich meat style, I kinda like the Togo's meat, on the Subway bun... i'm just being stupid.", "name": "TOGO'S Sandwiches", "rating": 3}, {"index": 55, "review": "Went to this togos today... Told the lady my first sandwich, (turkey and cheese). She proceeded to just start making it without asking me one question.. Hello I am the one who is going to eat it, right? I look over the counter and she has already put on a ton of mayo without asking, and a ton of provolone cheese.... Uh, excuse me but had u asked I want cheddar. Told her I wanted cheddar. (she mumbled oh I put provolone). Duh, I see that, had u bothered to ask u wouldn't need to redo anything.  Next sandwich, told her to scoop the bread out of the middle, she says \"ok\". Then proceeds to NOT scoop and once again put mayo all over to which I said \" I only want mustard\" but she wouldn't know that cause she didn't ask. She did nothing to remove the mayo she put on without asking.  She never once asked me how I wanted my sandwiches made. Got home and my boyfriend opens up his sandwich that was the turkey and cheddar... WOW she LEFT the provolone cheese on it. Normally I wouldn't complain about something as simple as a sandwich, but really? Its a sandwich, ask If they want mayo mustard and then ask what god damn produce its not rocket science.", "name": "TOGO'S Sandwiches", "rating": 1}, {"index": 56, "review": "This place can be \"hot & cold\". One time I can get a \"great\" sandwich. The next time another server makes a poor sandwich. Sometimes the bread is dry.", "name": "TOGO'S Sandwiches", "rating": 3}, {"index": 57, "review": "been to this togo's a bunch over the years.  its ok.  i have trouble putting my finger on why but it just doesnt have the mmmmmmm factor quiznos and subway does but the food tastes good as usual so we keep going back.  the service has always been nice even casually chatty.\n\nsince the cnn talk about food safety i decided to look them up in the santa clara county department of environmental health facility inspection reports.  they had 4 minor violations over 2 years.  thats more than the local subway and way less than the local quiznos.  compared to all the reports ive read lately that is ok, so just gonna notch them down to 3 stars.\n\nhttp://sccinspections.org/onlineinsp/prreport.php?pid=PR0303033&fid=FA0211972", "name": "TOGO'S Sandwiches", "rating": 3}, {"index": 58, "review": "went there to pick up 3 sandwiches for me , my boss and his dad, came back one was wrong, she apologized and took care of it right away in a very professional way. great customer service", "name": "TOGO'S Sandwiches", "rating": 5}, {"index": 59, "review": "I frequent this location regularly, like at least once or twice a week, and have been for a few months now. I always order the same thing and see the same people working. I would consider myself a \"regular.\" I guess they don't feel the same because they fail to recognize me, remember my name, or remember my order. I work at a restaurant and customer service is super important to me. If they noticed those of us who keep their business up and running more than I would be more inclined to go and fill their tip jars. Now I am turned off and would rather just make my own sandwich. Now that I don't eat meat I probably won't be returning.", "name": "TOGO'S Sandwiches", "rating": 3}, {"index": 60, "review": "It's all about these four things:\n\nBBQ on white with Lettuce, Onions, Tomatoes\n#9 (Hot Pastrami)\nAsian Chicken Salad\nPotato Salad\n\nOh...Bring BACK the Orange Whip!!!", "name": "TOGO'S Sandwiches", "rating": 4}, {"index": 61, "review": "I love this place and will always go here when I'm back in town. I used to go to high school right down the road till I moved to Hawaii. I always order the pastrami sandwich and it' never fails to make my taste buds happy. Over here I have to settle for subway and it's just not the same. Togo's will always be my favorite sandwich spot.", "name": "TOGO'S Sandwiches", "rating": 4}]