[{"index": 0, "review": "Amazingly great service! Aurelio was very helpful and has great customer service! Carolina was quick on delivery and very helpful as well. The food was fresh and very delicious!", "name": "Arby's", "rating": 5}, {"index": 1, "review": "Been going to this location for over 20yrs now. Food is good but recent customer service been poor, especially by this older Hispanic woman who seems to work weekday evenings. She doesn't greet the customers, doesn't thank the customer and doesn't smile at all. I've seen her on several occasions reading a book while at the register. Is how you train your employees Arby's?!", "name": "Arby's", "rating": 1}, {"index": 2, "review": "Hmm. Horrible customer service for starters. Then the other worker was cutting her nails and dusted her hands off into the fries. Yikes!!! Needless to say we left our food at the counter and thankfully the other worker refunded our money. We were grossed out.", "name": "Arby's", "rating": 1}, {"index": 3, "review": "After leaving my favorite Fri-date spot (Barnes & Noble) with my boyfriend, he had a hankering for a night snack. Good job, Arby's Marketing Team, because something about those recent commercials got us gravitating toward Arby's as it was down the same street. So, I've never been to Arby's prior to today. There isn't one located in my side of San Jose nor is it the first fast food restaurant that pops into my mind. But whatever, can't knock it 'til you try it!\n\nWe pull up into the Arby's parking lot, and my first impression was that the establishment was a bit run down and dated. The street lamps in the back of the parking lot weren't working, so it just made the place feel unwelcoming. I walk in, and I was taken aback by the awesome menu. BRISKET! WHAT? A fast food restaurant that makes french dips and reubens?! I feel so deprived. Even the apple fritter desserts looked really good. Dare I say even looked more appetizing than a McDonald's apple pie? Too bad I wasn't hungry enough to indulge, so I opted to share a curly fry with the BF and swoop bites of his roast beef slider. \n\nCurly fries were solid, and the roast beef slider was not bad! The bun on the slider reminded me of a Hawaiian sweet roll, and the sandwich didn't skimp on the provolone. While the meat itself didn't have much flavor, the horseradish mayo was what I needed to make the sandwich satisfying for me. Arby's house sauce was alright. It basically was a ketchup vinegar mix. \n\nFinal note, I thought it was cool that the meat isn't already sitting out pre-sliced. You can actually watch the food servers cut the meat with a meat slicer.", "name": "Arby's", "rating": 3}, {"index": 4, "review": "There was a miscommunication about my order today which left me one sandwich short but thankfully not charged for it. No big deal, quick fix and I can just order an extra and pay for it.\n\nBut honestly, talking negatively about your customers in front of them in Spanish on the assumption they don't speak it is extremely unprofessional. Tossing the bag with the extra sandwich on the counter was a nice touch too, lady. I hope the dude and lady who helped me today come to realize that yes, some of us Asians do in fact speak Spanish and it shouldn't be such a hassle for you to ring up one extra item when you don't even have a line.", "name": "Arby's", "rating": 1}, {"index": 5, "review": "Not really worth it. I spend about $13 bucks for a deep friend turkey sandwich combo, jalapeño poppers for my side. And a cookie. I dont feel satisfied after eating it all. They also messed up my order. They gave me the wrong sandwich. The lady in the back needs to do a better job. I worked at arbys before i know how it is... All in all food was mediocre and service was not great.", "name": "Arby's", "rating": 2}, {"index": 6, "review": "Service was pretty bad they got my order wrong twice. The food itself was decent/good. The sides we're okay.  the sanwhich was pretty good tho. Understaffed but maybe if they got more competent workers I'd come back.", "name": "Arby's", "rating": 2}, {"index": 7, "review": "They got rid of all the fish they used to make so the chicken and the fish are not made in the same oil now so..", "name": "Arby's", "rating": 3}, {"index": 8, "review": "The last  inspection they passed with a low score in the low 60s\nRodent feces and dead roaches in the dry area\nAlso filth every where\nThe store should be closed !!   \n\n\nYou can check out any resturant for inspections wheather they pass or fails terribly like this Arby's did !!\nDownload this app\nSCCDINEOUT \n\nI would never recommend anyone entertaining this Arby's  unless you don't care about perhaps about eating contaminated food !! !", "name": "Arby's", "rating": 2}, {"index": 9, "review": "I tried the Meat Mountain sandwich and was very disappointed. Sure, it's a lot of meat for $10, but all the meat was served cold and there was no sauce on the sandwich (aside from the sauce packets available). Waste of money IMHO. Curly fries are good though, and the staff is nice.", "name": "Arby's", "rating": 2}, {"index": 10, "review": "This Arby's is fantastic because of the staff! Julia is so pleasant and gives the utmost best customer service. The staff is so polite and they cook the food perfect and there is never a long wait.", "name": "Arby's", "rating": 5}, {"index": 11, "review": "The fiancé and I were taking a drive out and decide to stop by this local Arby's. Right off the main road, not hard at all to get to. Here is enough parking for about 15-20 patrons at a time. The first half of parking is as you enter and the other half is around the building.\n\nRight as you pull up, you see the entrance...and further down the white brick wall is the woman's restroom. No restrooms inside this restaurant. Speaking about the restrooms, they are wonderfully clean and fresh! Unfortunately no mirror available to check your to see if you have leftover ketchup still on your face!\n\nAs you enter the eatery, you approach to your left the trash cans and condiment section and immediately to your right is the counter. We were kindly greeted once we approached the counter. Good thing here, more ppl starting coming in and staff workers did not hesitate to open up a second register. Ordering was fast and hassle free. At this location, order is ONLY done inside, no drive-thru. Sorry to disappoint.\n\nThe restaurant itself has a homey feel. Not too big, but not too small either. A good vibe with an open view of the main street. My only grunt is that it felt stuffy...no A/C. One customer asked if it could be turned on, but he was ignored...hmm, and I wanted to give the customer service an A+. I guess an A will have to suffice.\n\nThanks Arby's for filling my lady and myself up with your tastey brisket and turkey sandwich!", "name": "Arby's", "rating": 4}, {"index": 12, "review": "Had a tough time with the cashier the other night. Kept asking for things that are on the menu, but she'd have to turn around and look at the menu herself. Then she'd repeat it back to me but it was wrong... several times. Had to repeat an order for a family of four several times. Then when we received our food, there were no fries in the kids' meal. Tried ordering something for a friend on the way out, but the lady was too busy leaning and looking at her phone. When she finally came over, I said what I wanted, and she repeated it to me wrong again; I'd had it and just left. The food was only average; certainly not worth putting up with this.", "name": "Arby's", "rating": 1}, {"index": 13, "review": "Always great service, close by my work so I eat here alot! The turkey gyro's are the best! Service is always nice, same as the other Arby's on Snell which is by my house.", "name": "Arby's", "rating": 5}, {"index": 14, "review": "Do NOT come here if you are looking to use your coupons. Apparently the discounts offered by valid, unexpired, corporate issued Arby's coupons don't apply here and that everything is $2 more than what's print on the coupon. This is the 2nd time I've had this ridiculous BS issue here. Such a waste of time and energy.", "name": "Arby's", "rating": 1}, {"index": 15, "review": "I've been looking forward to trying Arby's brisket sandwich for awhile.  Originally i was thinking of hitting up the Sunnyvale location (since its closer to my pad), but after reading the reviews i decided to try the SJ (stevens creek) location and good thing I did.  This location was clean and the service was quick.  What more can you ask for!!  Also, the brisket sandwich was sooooooo good!!!  Just to set the right expectation with the barbecue fanatics, this is fast food, so it won't really compare to a full on BBQ restaurant, but they come really close!", "name": "Arby's", "rating": 5}, {"index": 16, "review": "When it comes to fast food, I'm not sure Arby's can be beat. \n\nThe beauty is in the simplicity. Moist beef, sliced paper thin, and put on a bun. Oh Yeah, and the Crack they put into the Arby's sauce and Horsey Sauce. I swear, and actually been caught by a shrugged shouldered employee, pocketing and bagging pounds of these delightful packets of deliciousness. This shit goes great on everything in your refrigerator. Trust me. \n\nThe fried goods are just that. Fried Goods, not Fried Greats. Typical curly fries, and old school potato cakes are ok, but dip them in those sauces and they become greasy greatness. \n\nThe prices are kinda steep for fast food, but the sauce is free. So it all evens out at the end  \n\nAnd the beef is actually good to. Sliced to order and served quite quickly. \n\nI'm glad they got rid of those stupid touch order screens which never sped anything up. Standing behind old people who still don't even own tv's with remotes try to figure out those screens could get frustrating, and I like old people. \n\nNever go wrong at any location.", "name": "Arby's", "rating": 4}, {"index": 17, "review": "From the moment i walked into the place the blonde hispanic lady employee was on her phone the ENTIRE time i ate my meal to the time i left, she then kept showing the cashier stuff on her phone while customers were waiting to order, the lady should have at least gone to the back while on her phone but i dont see why management would allow the use of being on your phone at all while working more so when customers are waiting to order the owners need to be more aware if what goes on when they are not there very disappointed as they are getting paid to serve us not be on the phone", "name": "Arby's", "rating": 1}, {"index": 18, "review": "This Arby's when you order a medium combo gives you a medium sandwich, medium fries but SMALL drink...rip-off!!!!  If you want a medium drink with a medium combo you have to pay extra.", "name": "Arby's", "rating": 1}, {"index": 19, "review": "Did I ever tell you about the time this crazy Korean used car sales man, who had just gotten into a car accident, proposed to me while I was sucking on a Jamocha milkshake and munching on a roast beef and cheddar sandwich here? He obviously had a severe concussion. \n\nClean - Fast - Friendly - Minus one star for having no drive thru\n\nI should have said \"Yes\"...", "name": "Arby's", "rating": 4}, {"index": 20, "review": "The best sliced meat. Get \"double meat\". Drink lots of water.\n\nHorsey sauce is delicious. They just updated to classier trays. \n\nCleanliness is good. \n\nService was purposeful and gentle. \n\nBathroom is out back. \n\nMeat mountain at $10 is a good value. Curly fries are crisp. \n\nGrab the table by the window to watch the occasional customer jaywalk across 7 lanes of traffic to come for Arby's.", "name": "Arby's", "rating": 5}, {"index": 21, "review": "The place is typical for fast food. It's decent for what you pay. I love the curly fries. I also like the fact that the owner of the franchise is sweet and genuinely is happy to see the patrons. It sets the place apart. It's an Arby's. It's fast food not a Michelin star rated restaurant. Yes, it needs a bit of refreshing but it's always immaculate. I would feel comfortable eating off their floors.\n\nOf course, when you have idiots leaving 1 star ratings like the following, it won't. get. better : \"I'll never eat Arby's again....I loved there food to.\" If you can't spell it, don't review it. Your stupidity is needlessly driving people away. Oh, and if you're complaining about fast food being \"overpriced\", take your low rent ass back to the ghetto and the dollar menu.", "name": "Arby's", "rating": 5}, {"index": 22, "review": "This is the 'Arby's' we frequent in San Jose.\nThe sandwichs here  seem on par with all other Arby's in the area.\nBut im not writing the 5 star review to praise there decent roast beef sandwichs. \n\ni am writing this because one the workers/managers Aurelio is very cordial and polite.\nwe have been coming here for around 2 years. and Aurelio is always very kind to us. \n\nThanks Aurelio! :) \n\n-Cory (Roast beef cheddar guy)", "name": "Arby's", "rating": 5}, {"index": 23, "review": "Just don't do it.\n\nOverpriced and poor quality.  Place also had a bit of an old - unremodeled and grimy feeling.  Kind of like an old fast food in the middle of a bad part of SF near Market Street... by a porno shop.\n\nDon't ask how I know.  I got stuck at one of these places once.\n\nWas probably just fine and modern back in the early 80s.", "name": "Arby's", "rating": 1}, {"index": 24, "review": "I hate how the Arby's inside of Great Mall closed so this one is now the closest one to my house. Still kinda far away, but I'm always in this area for work and hanging out.\n\nThe guy at the counter was very nice, free refills for drinks, food tastes good, seats are clean... it's pretty good here. Their french dip is still always my favorite, but recently they had a new limited time brisket burger. It tastes so good, I wish it weren't limited and will stay forever. My favorite seats are always the one next to the window facing the streets. It's exciting to watch crazy people driving, honking at each other, and jaywalking on Stevens Creek.\n\nI see no problem with this Arby's besides their restroom being outdoors and nasty. But I guess we can go find a restroom somewhere else...", "name": "Arby's", "rating": 4}, {"index": 25, "review": "Absolutely the best Arby's I have ever been to! Super moist roast beef, fresh fries, friendly staff! I came at a non- peak time and still had the best!!", "name": "Arby's", "rating": 5}, {"index": 26, "review": "Awesome food, awesome service, and we like the seating that is well separated, so you get quiet time with your group.", "name": "Arby's", "rating": 5}, {"index": 27, "review": "Bad service. Very pricey with less quantity. I only go here cuz its near my workplace.", "name": "Arby's", "rating": 2}, {"index": 28, "review": "Good management, clean, and good food. If you like the food of an Arby's, that's about all you can ask. Only nitpick is that the sign is low, so it's easy to miss.", "name": "Arby's", "rating": 5}, {"index": 29, "review": "I don't have much craving and desire for dining at fast food place. But with Santana Row's choices of decorative food places, gives one legitimate reason to leave the upscale shopping complex for lunch. \n\nThis Arby's is located right across the street from the two lively shopping complexs (Valley Fair and Santana Row). Being located on busy Stevens Creek Blvd., this not a not a bad location. And for a fast-food restaurant, they have cute and comforatble vinyl seats. You don't see seats like that at many places no more.\n\nThe restaurant was introducing the Chicken Cordon Bleu sandwich. I'm not sure if this sandwich is a brand new Arby's sandwich, but it is sure new to a guy who infrequently dine at Arby's. My sandwich has a Fried chicken breast, slice of ham and cheese and mayo in a \"soggy\" bun. I got the sandwich as combo package with curly fries and a 16oz Pepsi for $6.99+ tax.  The bun was too soggy and chicken breast was a bit too arid. But on a positive note, the curly fries tasted well with the spicy Arby's sauce.  \nhttp://www.yelp.com/biz_photos/pwSeLdQ8xEYPnBNZcvMyVA?select=zEG34v9zTxq4Ydxu5prV4w\nMy lunch was cheap, but wasn't too pleasing, but it sure beats dining at any of the restaurants from any of the two malls.", "name": "Arby's", "rating": 2}, {"index": 30, "review": "I don't usually write about common garden variation chain fast food places but this place bothers me! There's just no way it's owned by the same person(s) who own the one on Camden as they a) charge more for everything!, b) do not deviate without charging you for every little thing! Soggy lemons in melted ice water for your tea! Just kind of annoys me yet I go once every two months purely out of geographical convenience!", "name": "Arby's", "rating": 2}, {"index": 31, "review": "My  girl friend and I stopped by this  Arby's  for the first time and the cashier looked like she was totally pissed off , the other blonde Hispanic cashier had just as bad of a surly attitude also . There wasn't as much brisket as you would expect for sandwich costing over 8$ . But with the attitude of the workers  , it was what I was expecting . That's the first and last time we will go there .", "name": "Arby's", "rating": 1}, {"index": 32, "review": "I have come to this particular Arby's every year, for the past 20+ years or so.  As a young'un, my family used to go here right after we saw a movie at the Century theatres.  Instead of having our orders taken by an employee, they used to have these blue touch screen order screens that would face out to the customers. You could select and customize what you wanted on those touch screens, and as a kid, I thought that was always half the fun!\n\nWhile those screens are gone, the decor hasn't changed much here.  This particular place is a bit far from me now, but when I'm in the area, I still frequent the place for their Regular Roast Beef sandwiches and small Curly Fries.  (Watch your sodium though!) Totally recommend adding the Horsey sauce into the sandwich.  They have bigger sizes of the Roast Beef sandwich- mid and max (used to be called the Medium, Large, and Giant).", "name": "Arby's", "rating": 4}, {"index": 33, "review": "Oh my!  I love the roast beef sandwiches here and for that matter at other stores too. \nI have never had a bad experience here.  Very helpful staff and the sandwiches are superb.  Yummmm.  I always go for the potato cakes and not the fries. They have a sandwich called the MAX.  And the MAX has plenty of beef if your real hungry.  The sauce is tasty and I love their unusual flavor shakes.", "name": "Arby's", "rating": 4}, {"index": 34, "review": "LOVE the Arby-Q sandwich and the roast beef.  They actually cut the meat right in front of you.  And the portion is just right.  The special BBQ sauce is so delicious.  \nNice friendly staff and fast service.  I love coming here for lunch.", "name": "Arby's", "rating": 4}, {"index": 35, "review": "I eat here last week. Ordered a French dip. Went to take a bite. I realized the bread was partially green. Sooooo gross. Bread was moldy.  I'll never eat Arby's again. I loved there food to:(", "name": "Arby's", "rating": 1}, {"index": 36, "review": "Have dined here 4 or 5 times. I always get a roast beef sandwich or two and potato cakes. Consistently very good with fast friendly service.  Only down side is it's a bit pricey at $3.99 for a regular roast beef but I don't know where else you'll get a better one at a better price.", "name": "Arby's", "rating": 4}, {"index": 37, "review": "My daughter just professed her love for Arby's roast beef.\n\nNicest staff, offered to hold off making the one sandwich I was taking home while we ate in the restaurant, so the to-go would be hot. \nThick milkshakes.\nHorsey sauce. I LOVE HORSEY SAUCE.\n\nClean, restaurant with severely outdated color scheme.. but really did you go to Arby's for a white tablecloth experience?", "name": "Arby's", "rating": 4}, {"index": 38, "review": "I have to say there are three reasons why I am a fan:\n\n1. Cleanliness of restaurant\n2. Friendliness of staff - they personalize your receipt with your name and do it with an honest & genuine smile\n3. Honestly: The retro decor inside of the retaurant. What?! It's fun! Who doesn't like kitchy wooden accents. All it's missing is some stellar wood paneling on the walls and we are in business! \n\nOther key tips: \n-You can order hot cheese dip for $0.50 more! Great to dip your curly fries into!\n-You can essentially take certain sandwich items and swap the bread bun for a healthier whole wheat tortilla.\n\nOverall the experience was loverly and I would definitely come back!", "name": "Arby's", "rating": 4}, {"index": 39, "review": "The foods ok, although I don't like horse radish. My dad used to love their roast beef sandwiches with Arby's sauce. This is an older location and you can tell. The staff are a bit lack luster and slow. It is a good alternative to hamburgers.", "name": "Arby's", "rating": 3}, {"index": 40, "review": "I just have to acknowledge this Arby's because we drop in often and it's a good place with good people. The interior is dated, but it's been around a long, long time, and it's always clean when we're there. Food is good, portions are okay for the price, orders are accurate... milkshakes are the best! Coupons in your mailbox make for good deals.", "name": "Arby's", "rating": 4}, {"index": 41, "review": "I don't have the budget to dine out as frequently as I would like, so my twice a month outing needs to be above average. Sorry, this was below average - average. I can't afford the combo prices, so I tried the \"$1 and up menu' Note: price on the menu I saw were $1.69-$1.99. What happened to the $1 and up... tried the Jr. RB. Bun was the small break apart type you buy as an 8 pack for 99 cents at the grocery store. I understand the 2.5 ounces of meat, the sandwich was priced at $1.99. Got small curly fries $1.99, way overpriced, but pretty good. Small Jamocha shake was almost as good as I remember from the 1970's Overall: $6.38 for a few bite sandwich, a small fries and a small shake. Too bad the rent and overhead costs force them to charge this much for a snack. I won't be able to return, I just don't have the income anymore to \"dispose\" of on a lackluster snack. Boo..", "name": "Arby's", "rating": 2}, {"index": 42, "review": "This may have been the last time I eat at this or any Arby's.  I'm not that happy with their food selection.  I decided this as I was eating my food.", "name": "Arby's", "rating": 2}, {"index": 43, "review": "Damn! No more Kings Hawaiian! Bummer. That tranny is a trip too.", "name": "Arby's", "rating": 3}, {"index": 44, "review": "I'm trying to review all the fast food restaurants that serve Diet Dr. Pepper.  Enter Arby's, I'm not a huge fan, but they give you curly fries without an up-charge like Jack in the Box.  Don't like the onion bun, but a sesame substitution always works.  I think all the chicken sandwiches come standard with honey mustard, disappointing, but easily fixed.  The shakes are descent as well.  Diet Dr. Pepper on tap equals feelings of joy in me.", "name": "Arby's", "rating": 3}, {"index": 45, "review": "Very fast service, food is always consistent, worker is usually friendly. Dining area is old and a little dirty at times, but other than that I love coming here when theres coupons for arbys in the mail.", "name": "Arby's", "rating": 4}, {"index": 46, "review": "Came because my brother refused to go anywhere else. Ew, I didn't want to order ANYTHING on the menu but finally settled for the grilled chicken salad. Totally not worth $5, just some iceberg lettuce and chicken, not even filling. I don't know why anyone would get a roast beef sandwich either, it's just meat and buns, and not good meat either. I do not see the appeal of this place. Never again.", "name": "Arby's", "rating": 1}, {"index": 47, "review": "I had probably the simplest order you can think of. I wanted a #14, with just the turkey, bacon, and cheese. When I use the word \"just,\" that means I don't want anything other than what I stated. I get my to-go order, and have to wait around because they forgot me cup. I was stopping on the way home from somewhere, and didn't actually open my bag until I got into my house. What's in my bag? The fries, and a #14 with EVERYTHING ON IT. If I lived close to Arby's, I would have just gone back, but I live in Sunnyvale. I attempted to salvage the things that I actually wanted on my sandwich from all the crap I didn't. The girl that took my order had even repeated it back to me, AND personally told the people that were actually making the food. If I'm paying $8.54 for a meal, I expect to get what I asked for.\n\nArby's on Stevens Creek in San Jose, YOU SUCK! I'm definitely NEVER coming back here. EVER.", "name": "Arby's", "rating": 1}, {"index": 48, "review": "I rarely eat fast food, maybe once every several months...if even that.  Today I gave in to Arby's.  BIG MISTAKE.\n\nI saw somewhere that they brought back the Roast Chicken Club sandwich.  So when my friend suggested Arby's, I said ok.  That sandwich was the only reason why I went to Arby's back in the day.  It's almost the same sandwich they had in the past with a few changes.  \n\nI never get it with bacon so that wasn't on it but they did add some weird spicy sauce to it & it was NASTY, the cheese was gross too.  They were out of potato cakes so the person who picked up lunch for me got me their curly fries...YUCK.  I'm not a fan of curly fries but I was so hungry that I ate them along with the sandwich.  My stomach isn't very happy with me now.\n\nNo more fast food for AWHILE & definitely no more Roast Chicken Club or curly fries from this place...I feel sickie :-( .", "name": "Arby's", "rating": 2}, {"index": 49, "review": "I like Arbys their food to me is good.\n\nThis place seems like any other Arbys franchise you'll find. Nothing spectacular. I do feel they are a bit over priced.", "name": "Arby's", "rating": 4}, {"index": 50, "review": "sketchy inside and overpriced. a roast beef sandwich with NOTHING isn't worth the $2. it was empty and quiet when my bf and I came in. the cashier lady was nice, but the food and price isn't worth it. restrooms outside by the entrance too. using outside restrooms are asking for a raping.", "name": "Arby's", "rating": 1}, {"index": 51, "review": "Meh. Booth seats are not comfortable. Food was alright, but I've made better roast beef sandwiches at home, for less. I don't know who thought of serving jalapeno poppers with a sweet berry sauce (which has no berries on the ingredient list), but that's just not a good flavor combination.", "name": "Arby's", "rating": 2}, {"index": 52, "review": "I feel like that scene in Demolition man when Stallone goes down to the alternate city and he gets served a rat burger, and he says \"This is rat? not bad\"  Not that I'm implying Arby's roast beef is rat, but it surely isn't roasted, nor is it beef.  \n\n With that being said, the bread is gooey good, and the beef has that japanese umami taste that kind hits the spot.  I'm not sure why. The cheese is interesting in a nacho cheese at the ballpark sort of way. \n\nThe Loaded Baked Potato bites are saturated with oil, heavy, but somewhat tasty.\n\nThe mini southwest eggrolls taste like deep fried cheap bean burritos that you get from 7-11.  \n\nThe Italian sub is anything but subtle on fat slathered onto it, but maybe one of the most tasty things on the menu.\n\nThe Philly sub is not what I remembered.  The ciabatta bread is played out.  They put some horsey sauce on mine as part of it.  Between the cheese and mayo, um too much.\n\nThe shakes are tolerable.  They don't quite reach that gross artificial plastic flavor that McDs has.  \n\nThe roast burgers are strange.  They won't be here long.", "name": "Arby's", "rating": 2}, {"index": 53, "review": "So let me preface this by saying I want to like Arby's. Where else can you get a Beef N' Cheddar or a Chicken Cordon Bleu. \n\nI love the food here and the staff is usually friendly. The major downside is that in the 3-4 times I've come to this location twice I have gotten home ready to chow down only to realize that some of my order has not made it into the bag. Couple that with super sizing the price of the deal others have mentioned ( no longer $5.95 it is now 5 for $6.95) and I will be hard pressed to return. \n\nMy suggestion check your bag on the way out and make sure all your food is there or you may end up getting the 4 for $6.95 special ! \n\n***Update 8/16/11*** \n\nThe $6.95 special is long over and has been replaced by a Value menu. I have been back a few more times and have had better luck getting my order processed correctly. \n\nMajor bummer - they have taken the Chicken Cordon Bleu off the menu, but if you ask they will still make it for you.", "name": "Arby's", "rating": 2}, {"index": 54, "review": "I like Arby's, maybe I have a soft-spot for them because they're not in the crowded \"burger\" genre.  I wish they had drive-thru here though, and be careful making a left exiting Arby's on Steven's Creek Blvd, talk about Frogger for your life (and my car is green).  Also, those restrooms outside you need to get the key, because I remember homeless used to hang out there.\n\nThey've expanded their menu like all fast-food places have, and prices are so-so, not outrageous but not cheap either.  I used to love the potato cakes, but now that I'm older, or for whatever reason, I can't handle the oil they're deep fried in.\n\nBut I like the occassional change of pace it is, from other fast-food joints.", "name": "Arby's", "rating": 3}, {"index": 55, "review": ":'(\n\nI had to shed a tear first for my hastily made decision to go to Arby's. I was lured by a sneaky commercial advertising some fried potato somethings... and I happened to be really hungry, so I insisted that we stop by on our way to the movies.\n\nWhy oh why did I do it?\n\n1) I forgot that once upon a time, I had been to Arby's, had not enjoyed it, and had blocked it out of my memory.\n\n2) My boyfriend reminded me that we had actually stepped in once only to leave because nothing looked appetizing-- but I didn't take the hint. Hey! I was hungry...\n\nAnyways, that thinly sliced beef looks disgusting even on the menu and even in my moment of intense hunger, I couldn't bring myself to order that! \n\nBut my boyfriend did and was sadly disappointed by the blandness of all the food especially his sandwich which was 3/4 lettuce and 1/4 meat- although that was just fine since he said the meat was gross.\n\nWe ordered the little potato things which were actually not potatoes but cheese with a few crumbs of bacon trapped in a deep fried breaded triangle . They were like jalapeño poppers without the jalapeños. Or the flavor.\n\nI ordered the salad which looked okay in the menu but was really pathetic. It had hardly-green chunks of iceberg lettuce, cold tasteless cubes of \"grilled\" chicken, a bunch of grated yellow cheese, and a few (two or three) cubes of tomato. I put some ranch on it and ate because I was so hungry. The cheese was by far the best part of that salad.\n\nLuckily, we had a tiny bit of flavor in our meal because we ordered the curly fries as well. They were tasty, but we could have gotten those at Jack in the Box with some other good food and still saved $10.\n\nBig disappointment!\n\nAt least the employees were nice and had some good Mexican music playing in the background. They seemed pretty happy despite the fact that they work in a restaurant where they can't even get decent food :( They should work at Burger King: gourmet food compared to Arby's!", "name": "Arby's", "rating": 1}, {"index": 56, "review": "Haven't been on Yelp in forever but I felt it was necessary to dig up my  account info that I haven't used in at least 3 years (my password was \"guessthisshit\"...wtf), log in, and give this Arby's a 5 star review for their awesomeness.  \nThis happened like a week ago, on Christmas Eve.  I was on a mission to Best Buy across Valley Fair to do some very last minute shopping for my girlfriend, and I was pretty desperate to get this done since I wasn't trying to get b*tched out on Christmas Day.  \nSo it's about 5:15pm, store closes at 6, and right as I'm exiting 880, it hits me: a massive lower abdominal pain accompanied by a noise that I'm pretty sure is what a Kraken's burp sounds like.  It was about 4 days worth of crudely digested McDoubles and 5 Layer Burritos manifested into the worst case of the runs in recent memory, wanting out that very instant.  \nI decided I couldn't do it at the mall or Santana Row because it was way too populated; even if I managed to find parking in that mess, a slight bump from a stranger or any sudden stops on my barge to the bathroom would have made me spill among thousands of people and my self-esteem would never ever be able to come back from that.  My only option was to sit through traffic and get past the mall, and find a different place to deposit my chunks.  \nThus commenced the scariest and most painful 10 minutes of my life.  Stuck in holiday traffic, I inched my way towards a destination that I wasn't even sure existed.  Was there anything down this way on Stevens Creek?  Would it even be open?  Would they have a bathroom? What if they have no paper?  What If I don't make it? Am I gonna have to diaper myself up with these Safeway bags in my car and drive back home?  I felt my sphincter getting weaker with each question and I could feel beads of sweat forming in my nether regions.  I was seriously about to cry.  \nBut then I found Arby's.  Abundant parking allowed me to swoop right in front of the entrance.  I rushed in looking for a bathroom, and after a moment of sheer panic, I was told by the nice and friendly cashier that it was out on the side of the building.  There, I unleashed my Kraken, flushed 4 times, and the rest was history.  I ordered 7 dollars worth of value menu food to thank Arby's for their generosity and I was on my way to Best Buy.  \n\nOh and if anybody's curious about the food: dollar ham cheese thing was nasty, the mini shake whatever is seriously miniature, dollar roast beef  was dry and bland. I didn't really like it.  5 stars nonetheless.", "name": "Arby's", "rating": 5}, {"index": 57, "review": "2.5 Stars for this throw-back trip to the 1980s. Or was it 1970s? The inside has a retro-cool-fake fern bar appeal. Is this where plastic plants go to die? Well, they are clean, and green.\n\nThe marketing yahoo's who run this place in corporate really need a severe spanking. The \"official\" menu signage is minimalist, and stuck in 1975. So because they wouldn't spend $500 for a new menu, they have decided to kill hundreds of trees, and plaster window, after window, with gigantic signs telling us what new cardiac menu items they offer. I guess these signs might serve a purpose - in an unsightly area? Cover up the windows! But if there is any kind of view, why not let us see a sunny day, or the cleansing rain? I know, I know, you want two or three signs to attract folks in cars ... but do you really need 50 Jumbo Signs?\n\nThe roast beef and cheese was ok, and the bun was soft. The new (?) apple turnover was pretty good (for fast food). Personally, I'd spend a few more bucks and get a quality roast beef sandwich.\n\nYes, the outdated bathroom was run by the same guy who ordered those 50 Jumbo Signs.", "name": "Arby's", "rating": 2}, {"index": 58, "review": "ARBY'S OLYMPICS 2007 PRELIMINARY PROGRAM:\n\n1. Number of overall sandwiches consumed \n2. Most small sandwiches consumed \n3. Most medium sandwiches consumed \n4. Most large sandwiches consumed \n5. Most Big Montanas consumed (might as well just give me the gold here) \n6. Most Beef 'N Cheddars consumed \n7. Most potato cakes consumed \n8. Most curly fries consumed \n9. Most curly fries and potato cakes consumed \n10. Best time: consumption of small sandwich \n11. Best time: consumption of medium sandwich \n12. Best time: consumption of large sandwich \n13. Best time: consumption of Big Montana \n14. Most Cherry turnovers consumed \n15. Best time: Jamocha shake consumption \n16. Worst Jamocha Shake brain freeze \n17. Most horsey splooge consumed \n18. Most arby's sauce consumed \n19. Most cheddar cheese sauce consumed \n20. Most ounces of meat on a sandwich \n21. Most Jamocha Shakes consumed \n22. Biggest variety of items consumed from menu \n23. Overall largest number of items consumed from menu \n24. Most money spent at Olympics \n25. Most splooge/Arby's sauce on clothing \n26. Most items purchased for take out after Olympics \n27. Most vomit in parking lot \n28. Best use of horsey splooge during sex \n29. Best rendition of eating meaty folds of irridescent green beef \n30. Best horsey splooge facial.", "name": "Arby's", "rating": 5}, {"index": 59, "review": "Why, god, why, why, why, why why?\n\nI pretty much only eat fast food if I'm super-drunk or on a road trip.\n\nI figured it sort of counted as a road trip since I was coming back to the office from renting a 4x4 for Tahoe, so why not hit the Arby's so conveniently located between Hertz and work?\n\nMy stomach is currently protesting. Hell, my mouth was protesting from the first bite. Even worse, my EYES were protesting as soon as I unrolled what looked like a miniature version of a hobo's bag to reveal the rumpled, flattened, roast \"beef\" sandiwch within.\n\nBetween what appeared to be a bun were ribbons of this pinkish-grey meat-like substance, with all the consistency and texture of cornbread that's been run over by a steamroller. \n\nAs for the cheese? If that gloppy, yellow goo on top were actually served in the town of Cheddar, the citizens would wield pichforks and torches and revolt against the queen. \n\nAnd beneath the \"meat,\" a healthy dousing of Arby's sauce. There's no existing product with which to compare this watery, orangey swill, so they just call it Arby's sauce. For all I know, it's a reproduction of Mrs. Arby's menses.\n\nSo here I sit, questioning why I broke my steady but simple rules about fast food. At least I can take comfort in the fact that what I got really wasn't food. Just fast... something.", "name": "Arby's", "rating": 1}, {"index": 60, "review": "Still my favorite fast food restaurant! You can never go wrong with ordering the roast beef sandwich hehe I usually order a small w/ curly fries and I put ketchup and curly fries into my burger and eat it all together =) been doing that even since I was a kid. LOL =)", "name": "Arby's", "rating": 4}, {"index": 61, "review": "Yummy for my tummy!!!\n\nWhat's not to love?  Lather their Arby's Sauce on a cockroach and it'd probably taste delicious.\n\nThe roast beef sandwich goes down so pleasantly.  *cue heaven harps*  But, it sits like a brick in your gut (you should already know that, as all roast beef does).\n\nMarket fresh sandwiches are huge and indeed \"fresh.\"  \n\nHow about those curly fries?  Can't find a better seasoned fry anywhere.\n\nI go to Arby's for a big hunk of beef smothered in BBQ sauce with a side of greasy curly fries.  My gut can only handle it once a month, so I reserve this rare treat for special occasions.", "name": "Arby's", "rating": 5}, {"index": 62, "review": "I haven't gone here in a couple years. I think ever since I kick started my health binge, I just haven't taken much interest in fast food. \n\nFirst thing I noticed: they took out both of their really messed up soda dispensers and put in one new one. It's a welcome change because I remember thinking how broken the old ones were. \n\nSecond thing: My cashier was actually quite cheerful. I'm quite happy about that, the more happy people the better.\n\nThird thing: The feeling of complete crap an hour after I was finished, damn you health binge! I can't eat my junky junky fast food like I used to anymore :(.", "name": "Arby's", "rating": 3}, {"index": 63, "review": "I had a craving for a roast beef sandwich and so there I was.   What can I say? It's on camden ave and I was hungry.  Service was quick too.", "name": "Arby's", "rating": 3}, {"index": 64, "review": "WAY overpriced for a fast food place! save your $$$ and go elsewhere! Not sure why there prices are so high... other Arby's I've been to have better prices..", "name": "Arby's", "rating": 1}, {"index": 65, "review": "It's not meat.  It's  meat scented card board or insoles.  I ate here on accident once.  I had a 'milkshake' and some 'meat' sandwich.  \n\nDon't  do it.  \n\nLove animals don't make food that's supposed to taste like them. \n\nAt least they've found a use for all the recycled paper etc.", "name": "Arby's", "rating": 1}, {"index": 66, "review": "3.5 Stars\n\nNot a place that I go to very often, and there darn sure aren't too many of them in the Bay Area.  But the Roast Turkey Ranch & Bacon sandwich makes it SO worth a trip to a location every once in a while.  Until a good friend painstakingly reassured me that sandwich was worth it, I hadn't been in an Arby's for several years.\n\nToday's errands (Sept 21st) put me in the vicinity of this location.  So why not stop in for my quarterly fix.  The sandwich was pure heaven, as it always is.  The only disappointment in today's trip was that Arby's has discontinued the onion petals (think onion rings that aren't a circle and about the size of a quarter) from the menu. Argh - coupled with the Southwest sauce, those onion petals were the perfect wingman for that sandwich - something fried to make you remember you're eating fast food.  Seems they've replaced them with Southwest Mini Eggrolls.  I was too overloaded with grief to give the eggrolls a try today.  Guess that will have to wait another 3 months until I'm back for my sandwich fix again.\n\nAs for this location, it's old and the dinning room could use a fresh outlook.  But the staff is great.  Everyone is nice and helpful, and they keep the place clean.  And they're not very busy at all.  I fear this location might go out of business pretty soon.  I might have to step-up my once/quarter visits to once/month to do my part to keep the place afloat.", "name": "Arby's", "rating": 4}, {"index": 67, "review": "So after 24 years of being alive I have just discovered Arby's. I need to go on A&E Intervention because now I am obsessed!! I like the beef n chedda, it is my crack. It's like old people food, everything is so tender and soft it melts in yo mouth. *sigh* I love old people food!", "name": "Arby's", "rating": 4}, {"index": 68, "review": "5 for 5.95? Bobby was looking forward to the Jomacha shake being on this menu and so was I, but this wasn't on the menu. Another customer said the same thing when he walked in. he was disappointed too. Arby's is definitely an acquired taste like wine is an acquired taste. It takes many trips to adjust to the horse sauce or Arby's sauce with roast beef or just the roast beef in general.  I do like the railroad root beer they offer here and since this is one of the few Arby's left in San Jose, it makes me want to support it even more just like A&W.", "name": "Arby's", "rating": 2}, {"index": 69, "review": "The service here has gone way down. The fries were luke warm and cold in certain places.", "name": "Arby's", "rating": 2}, {"index": 70, "review": "i love arby's.  i'll admit it, even though it was ridiculed on 'the simpsons' \n\n\"i'm so hungry i could eat at arby's\"\n\"EWWWWWWWW\"\n\nthis place looks retro, like the furniture is the same from the 70s, like Mark A. stated already.  that's kinda cool, that means they kept it clean all these years.\n\ni like the 5 for $5.95 \"meal.\"  you could easily split it with a friend, unless your friend is a pregnant wife.  then she wants it all to herself, and then some.  she got the arby's melt, fries, drink, milkshake, and turnover.  she then told me to get the potato bites and my own sandwich.  then, after she finished her pile of food, she got some cookies.\n\nour baby better be big when it comes out.", "name": "Arby's", "rating": 5}, {"index": 71, "review": "Three stars for fast, friendly service, and a super clean restaurant! The tables were actually sparkling! I actually hate Arby's so called roast beef - but I do love the new southwest egg rolls! I can't say that Arby's is one of my favorite places- but if you have nothing fresh or defrosted  after work and school and don't feel like cooking because the temperature in your air conditioned car says 103- then this will definitely do!", "name": "Arby's", "rating": 3}, {"index": 72, "review": "I never knew what set Arby aside from other fast food restaurants until my friend told me . Their burgers are supposedly healthier because they're more like sandwiches instead of burgers . Also , their burgers are cold , not hot . Basically , it kind of reminds me of a fast food version of Subway . I don't like the whole concept ... it's weird . Fast food is fast food .. sandwiches are sandwiches . You do not mix the two ! Anyways , I remember having the chicken burger before . It was not the best chicken burger I ever had ... it was just okay . It was missing something . I came here again yesterday . I had the curly fries which were good . The popcorn chicken wasn't that great ... the chicken was too rough and not tender like the way I like it . It was also lacking flavor . The loaded potato cakes were okay but not all that great . 3 stars for having decent fast food and for having curly fries , my favorite ! =)", "name": "Arby's", "rating": 3}, {"index": 73, "review": "Coming into this Arby's is like taking a ride in a time machine. Fake wood panels everywhere. Brown seat cushions and orange counters. HAHAHAHA!!! The guy behind the counter had a black eye and a cut on his wrist, hmmmm... I guess how much can you expect from an Arby's though right? The Fresh Market Almond Chicken sandwich was good and I love their mozzarella sticks. I'd go back here, just wish it had a drive through!", "name": "Arby's", "rating": 3}, {"index": 74, "review": "So, you can't give a fast food restaurant 5 stars. The universe just doesn't work that way!! But dammit, sometimes you just crave Arby's!! So it's not real roast beast, but once in awhile nothing else with suffice! It's an american classic and it tastes good too!", "name": "Arby's", "rating": 3}, {"index": 75, "review": "Arby's is my favorite fast food.  The thinly sliced beef is so tendor and soft that it melts in your mouth.  The Arby's sauce and horsy sauce are perfect condiment for the roast beef sandwiches.  I just don't understand why McDonald's are everywhere but there are so few Arby's.", "name": "Arby's", "rating": 4}, {"index": 76, "review": "i know someone who worked here and she said that her latino co-workers would talk trash about the customers in spanish and also spit in their food and laugh as the unknowing customers were eating it......if u want some arby's i would STRONGLY RECOMMEND GOING SOMEWHERE ELSE....yuck!", "name": "Arby's", "rating": 1}, {"index": 77, "review": "Love Roast Beef Sammys, this of course is bottom level..  But if you're on the road & this pops up at you, you gotta turn in.  Now half their menu is dedicated to chicken (what's that about).  And in going the chicken run, they removed my fav - the french dip.  But in a couple of months they brought the big dipper back.  Dippers of America we do have a voice.  Always get some type of their fries & dunk in the dip.", "name": "Arby's", "rating": 3}, {"index": 78, "review": "I have always liked Arby's but haven't been in one in years simply because of lack of proximity of location.  When we visited yesterday, I believe we were served by the manager, Aurelio J.  He had a great big smile on his face as soon as we walked in.  He was very friendly and helpful with our order.  When our order was ready, instead of calling out, he actually walked it to our table and asked if we needed anything else.  I was amazed at the variety of menu here -- I am on a diet and ordered the Pecan Chicken Salad sandwich; it came on wheat bread and was superb!   When we left, Aurelio smiled and waved and again thanked us.  We had a terrific experience here!", "name": "Arby's", "rating": 4}, {"index": 79, "review": "Attention, Yelpers! DO NOT go to this Arby's, please!! The customer service is awful and the management is even worse. I had a coupon (if you call the toll-free number on the back of the receipt to complete a survey, you get a free sandwich) and when I presented it to the cashier, she said it wasn't valid, without even looking at it! Then the \"manager\" came by and said that the code I wrote down was wrong. Um, no. He proceeded to say that I need to listen more carefully to the machine next time?!? He obviously has never heard of the saying, \"The customer is always right.\" And where are his customer service skills? So in the end, he said that the free sandwich wasn't a big deal. I responded with, \"It isn't, so just give me the sandwich and be done with it.\" I will never go back there again, and I suggest you stay away too!", "name": "Arby's", "rating": 1}]