[{"index": 0, "review": "I'm a fan of Denny's going way back.  Glad to see this one did not disappoint.  Service was great, and the food was pretty decent.\n\nOne minor irritation is the menu has become overly complicated, plus there's a secret value menu on the back of the dessert menu.  The build-your-own slam option is pretty straight forward, and it has been brought to my attention that I'm just easily annoyed.", "name": "Denny's", "rating": 4}, {"index": 1, "review": "Very good to have a hot chocolate at midnight~ Stay here for a while and feel free~ Ok~Find a warm place in winter~", "name": "Denny's", "rating": 5}, {"index": 2, "review": "I always have a bad experience at Denny's but this time out server was great. I'm in the restaurant business so I know how it is. He had the whole floor which was 7 tables and was triple sat, had a great night honestly.", "name": "Denny's", "rating": 5}, {"index": 3, "review": "I was pleased to find that my recent visit on thursday for breakfast that the place was clean, quiet and service from Jose was fantastic,,, I appreciated the clean restrooms and good food and will plan on making more frequent visits....", "name": "Denny's", "rating": 4}, {"index": 4, "review": "The food was great service was ok restaurant needs to be updated.  Was close to the hotel I was staying at", "name": "Denny's", "rating": 4}, {"index": 5, "review": "Some Denny's locations might be better than others, but the food is basically the same.  You cannot go wrong with the value menu, but I had a very specific breakfast meal in mind and Denny's thankfully can serve it up nicely.  The Fit Slam is a good choice if you are focused on trying to limit calories and stick to a healthy meal plan. The egg white scramble is perfectly light and tasty (I add Cholula hot sauce and ground pepper w/ a pinch of salt for flavor). Turkey bacon is another good substitute. Instead of the English muffin and fruit that come with the meal, I asked to omit those and instead get a side of the honey wheat pancakes with sliced banana on top (ask for sugar-free syrup on the side). I scarfed down my food and enjoyed every bit of it. It was great to know I can eat out, get a decent meal that doesn't break the calorie bank.", "name": "Denny's", "rating": 4}, {"index": 6, "review": "Food was fine, but service was very slow. Was the staff playing instead of working? Oh, no...someone really messed up the schedule and left ONE waitress for the entire place when they were expecting a party of twenty in addition to the rest of us who just wanted a quick dinner.\n\nThe waitress was nice, but you could tell she was rattled.", "name": "Denny's", "rating": 3}, {"index": 7, "review": "This is a great place to bring kids. There is a mix and match menu that is interesting for them. For bigger kids and adults the build your own burger is fun and tasty.  I ordered a club sandwich and there was actually too much turkey in it. I had to remove some. Generally, the portions are not huge so don't expect left-overs. Our waiter was friendly and efficient. A good place to stop and eat when stuck in bad traffic and wanting to wait it out for a bit. \nWe found the restaurant to be spotless and sparkling and the bathrooms were very clean. That is always a good sign!", "name": "Denny's", "rating": 3}, {"index": 8, "review": "Denny's is a classic American diner that serves classic American food. It is by no means a fancy place nor is it a spot you would take anyone for a date, but if you're someone like my hubby and I who are always down for something comforting and super simple, Denny's is the perfect spot to go to.\n\nTheir extensive menu offers omelettes, burgers, sandwiches, and special breakfast skillets that will fill you up in no time. You'll have a hard time choosing what to eat because all of those pictures show some great-looking food. The decor of the restaurant looks like your typical diner with booths galore and a long counter-top for those eating solo. All of the waiters we have encountered so far have been extremely welcoming and friendly, so service is definitely a strong point here.\n\nFor this specific lunch date, my hubby chose the meat lover's skillet that came with various types of sausage, roasted potatoes, and two eggs cooked sunny-side up . I chose the ultra omelette that came with mushrooms, green bell peppers, tomatoes, cheese, as well as an English muffin and a side of hash browns. \n\nOur food was served relatively fast and was steaming as soon as it hit our table. I could hear the sweet sizzle of meat from my hubby's skillet and the eggs looked like they were cooked perfectly. I had to have a bite of the sausages and were immensely surprised at how well-seasoned it was! You could really taste the herbs that permeated the roasted potatoes as well. My hubby certainly had no complaints and practically inhaled his food. \n\nAs for my omelette, the eggs held up well and each forkful had a little bit of everything. The bell peppers had a good crunch and the cheese was super hot and gooey. However, I did feel that the omelette veered a bit towards the bland side and would have liked just a tad more seasoning. The English muffin was toasted well and the hash browns were crispy and golden. I can't say I was a big fan of the prepackaged jam at the table since it didn't go very well with the muffin, but I suppose it's more convenient that way.\n\nDenny's is a good place to go to if you aren't looking for something that will knock your socks off. Their food is decently made and it tastes as you would expect. Every now and then, you'll be caught off guard at how great something tastes, but most of the time, you're just left in a content silence as you chow down on typical American-style food. \n\nFor us, Denny's elicits such fond memories of our many \"Denny's runs\" when we were college students who were always looking for something cheap and filling to eat. Perhaps our fondness for the diner stems from our happy memories of ordering pancakes at 2 o'clock in the morning or sharing an Oreo milkshake. But regardless of why, Denny's is a solid place to go to and I'm certain we will be back again soon.", "name": "Denny's", "rating": 3}, {"index": 9, "review": "Not bad for a diner. If you are looking for great food do not come here, but if all you need is a place to get a burger or a sandwich then you'll be just fine. The staff is great here, way better than the food.", "name": "Denny's", "rating": 3}, {"index": 10, "review": "I've been to my share of Dennys and always know to expect less than service and food. But was i pleasantly surprised at this Location. We ordered blueberry pancakes(fresh blueberries wow!),Spaghetti, grilled chicken sandwich, kids chicken on a stick and everything was delicious! No complaints here, only empty dishes! And freshly brewed coffee nice and hot!! Major kudos to our waiter \"Red\" and staff, everything came out fast, hot and delicious! Definitely will return when in San Jose!", "name": "Denny's", "rating": 5}, {"index": 11, "review": "I had to work really late tonight, New Year's Eve 2016 into 2017, and so when I left work it was almost midnight!  Feeling really hungry, I Yelped for a place near my location that was still open.  This Denny's location was the first thing that popped up!\n\nWalked in and was greeted immediately and escorted to my table!  The place only had about 3 tables occupied, so it wasn't too busy!  The place looked pretty clean and well lighted!  \n\nI ordered the Double Cheeseburger with Seasoned Fries.  My order arrived within 15 minutes of ordering.  The burger was HUGE and the fries was nicely cooked with a very crispy exterior!  The burger was juicy and flavorful!  The fries also had excellent flavor!  That was a great meal!  Take into consideration that I was really hungry and any food that I may consume under this condition might taste more delicious than it really is.  But I'll still recommend the Double Cheeseburger with Seasoned Fries!\n\nThe service that I received tonight was fantastic!  I didn't get my server's name, but he was very accommodating, courteous, and professional!  Great job!\n\nI really like this Denny's for the food and the service they provide!", "name": "Denny's", "rating": 4}, {"index": 12, "review": "Here on a quick mini vacation from Chicago!!! If your  looking for some good, warm and delicious comfort food after a long day of shopping at Great Mall, this is the place! Super clean and organized! And for a busy night, manager Chona was super attentive and helpful. With great poise and a beautiful smile on her face, she welcomed us and made sure we had the best service! Wish had the exact same Dennys everywhere. A model example of management and a great location!", "name": "Denny's", "rating": 5}, {"index": 13, "review": "Came for a bite before going to bed, but maybe I should have just gone to bed instead, the food was kind of nasty here I had to put lots of pepper, tapatío and A1 sauce to give a decent flavor, the ham in the sandwich looked old and the whole time I had to listen to the employees gossip about the shit that goes on there at night, I knew there was a reason I don't eat at these joints anymore.", "name": "Denny's", "rating": 2}, {"index": 14, "review": "Not sure why Denny's has such a bad rating but the food I've had here is good enough that I return. I came to this one and ordered the nachos to start and the country fried steak. The country fried steak was decent quality-- I've had better gravy though. Nachos were great. \n\n(Didn't order it this time but my favorite is still the prime rib steak salad from denny's)", "name": "Denny's", "rating": 3}, {"index": 15, "review": "Very poor service. Im here with some friends and had to wait 20 min just to get a menu. Server saw me and I signaled for a menu but didnt bother to come up to our table. I had to walk over the reception desk to get a menu. The other staff member obviously tried to get the rude staff member to take care of our table but didnt do what was asked. Almost had to order again at the reception until the other staff member saw me and walked towards me. This is really messed up.", "name": "Denny's", "rating": 1}, {"index": 16, "review": "Best Denny's I've ever been to, hands down!\n\nTheir restaurant is very clean compared to other locations I've visited and their customer service is excellent.\n\nI tried their Bourbon Chicken Skillet and it was actually pretty good. It comes with two chicken breasts, but one of them was overcooked and too hard to eat. However, I would order it again because it was pretty yummy, which surprised me. I half-expected it to disappoint me, tbh. I loved that it came with veggies.\n\nHusband tried the The Grand Slamwich and it came with hash browns, which weren't burnt!! Super surprised at that, lol. First Denny's I've been to that didn't do that, thankfully. :)\n\nOHH, also, there is a huge parking lot behind the Denny's. I think they share parking with the motel behind them.", "name": "Denny's", "rating": 4}, {"index": 17, "review": "My boyfriend is always calling ahead of time for pickup orders. It's never ready when they say it'll be ready in 10-15 minutes. He goes the in 15 minutes later, and waits another 15 minutes. Btw, these orders are always just \"pancakes\". Smh he's not ordering here anymore.", "name": "Denny's", "rating": 1}, {"index": 18, "review": "Place is good for a casual bite to eat. Nothing bad. Nothing great. It fills me up and I'm happy.", "name": "Denny's", "rating": 3}, {"index": 19, "review": "Thank you so much guys! Love the service! Please visit this location over the 14th st location!", "name": "Denny's", "rating": 5}, {"index": 20, "review": "First time coming here, it wasn't as bad as I thought it would be. Food was pretty decent, a lot better than the other denny's I went to. Great customer service! The server was really friendly and nice. Definitely would come back again.", "name": "Denny's", "rating": 3}, {"index": 21, "review": "At first when we walked in we pick up a foul smell from the entire dinner, to me it smelt like old folk home, then our waiter seemed nice, but then he started to be over complementary, and he called my Fiancé \" mi amor\"=love. And also called her princess? Which I thought was crossing the line so forget about getting a tip from me, and im a very generous tipper, anyways, at first the food we got, tasted okay, what you would expect from a dinner but it wasn't until a few hours later when my fiancé and I started get sick, we realized that the only possible thing that could make us sick was the breakfast food from this establishment, it is already next day and we are still a bit sick, getting better, but sick, taking emodium so I'm sure we'll be fine, but nobody wants to get food poisoning or diarrhea from food places. So if you are new costumer here and were smart enough to read yelp reviews and made it this far. Choose another location, avoid getting sick. I can't remember the waiter's name but I can describe him as short and big built, Hispanic and over complementary and says mija or mijo a lot. Which was a little too much for my taste as hispanic person myself. Anyways choose another place.! I ordered the gram slam but hours later my toilet got a gram slam of diarrhea, I know gross. But straight forward. Just avoid it.", "name": "Denny's", "rating": 1}, {"index": 22, "review": "Worst place ever.  Service was bad, place wasn't clean, food was slightly ok.  Never going there again.", "name": "Denny's", "rating": 1}, {"index": 23, "review": "Wow, food was okay, but it took 20 minutes to get when it was empty in t hee restaurant. I was going to order something else, but the waiter had disappeared, had to go to the host to get my check and pay it, and after I left I saw the waiter walking back from down the street. Every time I go to Dennys it reminds me why its been so long since I've been there. Nothing redeeming about this place these days regardless of the location.", "name": "Denny's", "rating": 1}, {"index": 24, "review": "In giving this Denny's 5 stars because it deserves 5 stars! As soon as we walked in we were warmly greeted and sat right away. Our waitress \"Ana V\" was a total sweet heart and on top of her customer service. She was quick to serve and very friendly. \n\nWe were first skeptical of this Denny's because of the location but it turned out to be a wonderful experience! I will be coming back no doubt!", "name": "Denny's", "rating": 5}, {"index": 25, "review": "OMG... The oatmeal tasted like glue and had the consistency of wallpaper paste.", "name": "Denny's", "rating": 1}, {"index": 26, "review": "Three to Four Stars for three to four star YMMV service!\n\nFIVE STARS for supporting County of Santa Clara public employees with a 10% discount (with County badge)!!!\n\n\\(^0^)/\n\nFood quality:  It's the Denny's™ standard quality taste...", "name": "Denny's", "rating": 5}, {"index": 27, "review": "Get to Dennys and its pretty empty. The waiter sees us and continues to do something else. Finally seated, it takes about 15-20 min, before anyone comes to take our order. Wait about another 30-45 min only to have to food come out cold. I ordered a skillet, which should be sizzling but instead had dried cheese, and dry chicken and bacon. The blueberry pancakes we ordered were lukewarm. I don't know why our food didn't come out when it was finished. Returned the food and left, just terrible service.", "name": "Denny's", "rating": 1}, {"index": 28, "review": "Horrible customer service. From the manager down to the employee, Luis is probably the worse. Very quick to say no and just look at you. The phone rings off the hook and every employee just walks by and doesn't bother to answer. The tall man employee is very nice to customers and is usually the waiter for the main area- he is the only reason I've returned", "name": "Denny's", "rating": 1}, {"index": 29, "review": "Wow. Food was okay (about what you would expect) but the waiter was so rude! He actually brought my food to the table while talking on his cell phone, and slammed the plate down in front of me before walking off with his phone. I've never had that experience before! I asked for hot sauce and the waiter said yes, but didn't bring it and I walked around the restaurant looking for it. When I got up to pay my check no one was at the register and the waiter rang me up -- seemed very annoyed with my $2 tip. I won't be returning!", "name": "Denny's", "rating": 2}, {"index": 30, "review": "Great food for sure!!!\nI ate here very night I was in the.bay area.becux u always know that its open \nAnd ready to.serve you with great customer service and delicious food.\nJose was a server for.us one.night and he was very good at what he do. \nHe always checked our table and always smiling.", "name": "Denny's", "rating": 4}, {"index": 31, "review": "Cheap prices!", "name": "Denny's", "rating": 3}, {"index": 32, "review": "Best Denny's so far!! Good customer service. Food comes to you still hot. Coffee/drinks refills are on point. Leonardo was a great server. Even made sure my to-go order was done as I was leaving. Gotta love the buffalo chicken strips and their ranch. If your in the area check out this Denny's. Not super crowded but just rite. Thank you very much.", "name": "Denny's", "rating": 5}, {"index": 33, "review": "The overall cleanliness of this Denny's isn't so good. My nose started itching after a few minutes of sitting down inside from all of the dust on our booth. The water glass I received had a few black specs in it. I assume it was just a little bit of black pepper, but I asked for another cup anyway. \n\nI just had scrambled eggs, bacon and pancakes. I could only eat half of it before I started to feel grossed out. The pancakes were alright, but the eggs definitely tasted funny. There was some sort of bitter taste to them so I stopped eating after the first bite. Our waitress never came to our table once to refill our waters. Had to flag her down a couple times to get her attention which was a little annoying. \n\nReally the only thing going for Denny's are the good prices. Aside from that I just can't recommend this Denny's. There are too many similar and better restaurants around the area that will deliver a better dinning experience.", "name": "Denny's", "rating": 1}, {"index": 34, "review": "The food and waitress were fine but the rest of this restaurant is poorly organized. When we arrived the lobby was full and we put our name in. There were a few groups of 4 or more ahead of us and 5 empty tables that were vacant and waiting. There were also smaller tables and I literally had to tell them that there were people waiting to be seated.  We were finally seated and then waited 10 minutes for a waitress to take our order.", "name": "Denny's", "rating": 3}, {"index": 35, "review": "We stopped here in late march on our way to Hawaii I will say, this was the cleanest and most fresh food of any Denny's I have ever visited\n\nVERY CLEAN Very polite staff!!!", "name": "Denny's", "rating": 5}, {"index": 36, "review": "HEALTH HAZARD. i have pretty low standards for breakfast, but when you see this many insects, both alive and dead, you should FLEE (pun intended).\n\n## dozen little mothlike flying bugs and baby flies and little ones with wings, gnats along the window.\n### dead bug carcasses underneath and behind the salt/pepper shakers and sugar/sweetner holdders\n## coffee brought in dirty cup, ew! lip prints still visible!\n# dark carpeting under tables littered with bits of food and trash\n# greasy handprints everywhere\n# phone just ringing, ringing, ringing, ringing. no one to answer it.\n\n* server Fidel working very hard, great service, nice smile, friendly and generous.\n\nI give up.", "name": "Denny's", "rating": 1}, {"index": 37, "review": "Jose did an amazing job! Came back to check on us. Food was delicious! Came out on time. Just perfect! Manager stopped by our table to check in with us! Will definitely be back", "name": "Denny's", "rating": 5}, {"index": 38, "review": "My boyfriend and I came here last night/this morning (12:30a). As soon as we walked it it smelled like urine. We weren't greeted even after making eye contact with the manager. He looked at us and looked away. I wanted to leave but where are you going to find a place open at that hour? Anyways, We asked for a menu and he gave us ONE. My boyfriend asked for another menu and he gave him attitude. Whatever. After, we tried putting an order in to go and no one was there to take our order. 15m later someone came and we placed it. It wasn't even busy enough for them not to notice us. \n\nThe parking lot is shady too. Too many hoodlums lurking around.", "name": "Denny's", "rating": 1}, {"index": 39, "review": "This is probably the worst dennys I have ever stepped foot in.  The service was slow.  My group was more than patient.  It took 30 minutes for them to take our orders and another 50 before we left for Jack in the Box. Our water did not even come out.  I decided to take matters into my own hands and get water.  I walked to the back,  grabbed a couple glasses and filled them with water and fucking waited on myself.  Ignacio our server was nowhere to be found.  The kitchen was quiet and had no one leading the service.  No one was talking or communicating. Our group had enough and just left. I am in the car right now enjoying my fucking jack in the box.  Does it seriously take over an hour to cook some fucking eggs and bacon?", "name": "Denny's", "rating": 1}, {"index": 40, "review": "This was the worst experience ever. Oredered my food to go for a family of 5. Christmas night. I had to wait 1 1/2. I get home only to find they missed a meal because the person who charged me made a mistake. I go back and explain....Im getting attitude like it is my fault from the manager. I refused to pay more. I get my other order after getting sacarstic attitude by the manager like I planned to get a meal for free. I will never go there again. Horrible service.", "name": "Denny's", "rating": 1}, {"index": 41, "review": "The Skillet was too oily. The choco cake was half undercooked & half too hard. Icecream was not good either.", "name": "Denny's", "rating": 1}, {"index": 42, "review": "I am starting to make this my favorite Dennys for lun check time fare.  I've already been here numerous times (double digits) for lunch.\n\nEverythint is clean, ordered and the food has been just perfect.\n\nIn the local area, you have options, but lunch gets busy. This Dennys has never let me down in terms of wait time, fast and efficient.\n\nNow a special shout out to the wait staff, Ener in particular.  They are attentive with the coffee, bring extra napkins as needed, are there when you need them and fade into the background when you don't.  \n\nI don't feel rushed here, comfortable.  I can read my paper in peace and get some great service and a wonderful value for food.  \n\nDon't need a $3 coffee from down the road, and a $6 sandwich, for lunch.  I can come here, walk out the door relaxed and full for under $10.\n\nGreat people and place.", "name": "Denny's", "rating": 4}, {"index": 43, "review": "Not exactly sure how to rate this. It's a Denny's. You know exactly what you're getting into. Super cheap Grand Slams. They can be $5 if you know how to navigate the menu right (if this is one of your advertised skills, though, I feel somewhat sorry for you). \n\nThe food comes out not looking anything like the delectable photos from the menu, but again, this is Denny's we're talking about. \n\nEating at Denny's is perfectly fine. But the true shame is when you find yourself at one of these establishments when you're stone cold sober. It's just depressing. I would not wish that fate upon my worst enemy.\n\nThis is a restaurant where you go after a night on the town getting completely wasted and then you have a sudden craving for obscene amounts of grease. This is where Denny's truly shines. The way they treat the inebriated is truly award-worthy. The sheer amount of patience that is required to repeatedly take orders from someone who can barely mumble or stay awake or could even start yelling and causing a scene at a moment's notice is inspirational. Maybe that's why the food is so awful normally; anything tastes amazing when you're smashed. Denny's gets the extra star just for being so drunk-friendly.", "name": "Denny's", "rating": 3}, {"index": 44, "review": "The server was a nice guy and apologetic for how slow it was. I think his name was Sid. Juan working the cash register was in his own world. Slow, unresponsive, and really shouldn't we seating or taking money. First and last impressions are important. The manager or lead was even worse.", "name": "Denny's", "rating": 2}, {"index": 45, "review": "Ordered a quesadilla to go and they give me a burnt Tortilla with a sprinkle of cheese! And the night manager had an attitude about remaking it properly that he took the box and crushed it and flung it into the trash can.", "name": "Denny's", "rating": 2}, {"index": 46, "review": "Hungry? Why wait? Because they're so understaffed we can't get and drink order! We were basically forgotten for a good twenty minutes!!!", "name": "Denny's", "rating": 1}, {"index": 47, "review": "Just got back from a fun filled night out and thought, \"Hey, let's just grab a bite to eat at Denny's,\" so my friends and I did. The parking lot as of 10/17/2015 is a bit confusing to find since it's behind a gas station but if you do happen to find it, well then yay!\n\nThe servers and the hostess was super sweet and extremely nice and accommodating. They seated us really quickly and brought us to a nice spacious table, albeit next to someone else. The menu is just as you'd expect from a Denny's, the typical American food choices from a late night diner. As a group of 5 we ordered some food from the value menu since no one was particularly hungry. I ordered a Southwest Turkey Sandwich with a cup of soup, in hopes that they'd be able to substitute the soup for some fries instead like my closer local Denny's does. Unfortunately the server said they were unable to do so, so no substitutions on anyone's food. The food was overall what you'd expect. The bread on my sandwich was kind of greasy, the turkey was just a normal cold cut, the avocado was small and the soup tasted like salty broth with some noodles and chunks of chicken. At 2 am however, it's nothing I can really complain about but there is a certain fast food chain across the street that would have made me happier.\n\nOverall the service was adequate, the servers were friendly but unable to be all that accommodating, and the food was as expected from a late night chain. If you're really hungry and want to sit down by all means come out here, but if you're just looking for a quick food fix, there are better alternatives.", "name": "Denny's", "rating": 3}, {"index": 48, "review": "Undercooked sausage!  Waiter was ok friendly but rarely seen.  Had to find our own silver wear and napkins then one of the bust boys got a little sassy with us. Never going back\n\nWish I read the reviews before I went", "name": "Denny's", "rating": 1}, {"index": 49, "review": "So, we came in hoping to eat quickly and leave, we got seated and waited,and waited finally all our food arrived it was cold but we knew it wasn't the waiter'a fault it was the chef's and the management because there was about 11 tables all for one man to handle and I give him props for that \n\nSo we ate on. I ordered spaghetti from the kids meal and as I watched the food on my fork I noticed a small black strand I thought it was oregano but I lifted it up to be sure and it was a BLACK HAIR WRAPPED AROUND MY SPAGHETTI! Today was not our day ! I told my older brother  and he told Javier I think was his name they immediately gave me a new dish.woah I was scared to eat it but I got passed it and ate. Our waiter was extremely kind and patient. I do not remember his name but he was a bit large black hair and spoke Spanish it was not Javier tho, if the manager from this Denny's reads this please please 1 hire more bus boys 2 please give the man props he was sweating and needed a break please tell him that I said thank you for great customer service 3 make the chefs start wearing hair nets 4 HIRE MORE PEOPLE IT WILL MAKE CHANGE! \n\np.s. Manager, I came in on 12/6/14 from 12:30-1:30 whoever worked that shift attended my family. We were by the emergency exit", "name": "Denny's", "rating": 3}, {"index": 50, "review": "Day: 44 - I'm still here, the only thing clinging me to sanity is the music blaring out of the touchtunes jukebox.", "name": "Denny's", "rating": 2}, {"index": 51, "review": "Pretty classic. Hard to beat the basics of fast food.", "name": "Denny's", "rating": 4}, {"index": 52, "review": "I'm always coming here after nights of drinking.\nThey're patient, really nice, and I get my greasy goodness at 3am.\nNo complaints here, except the long wait when other drunk people show up.", "name": "Denny's", "rating": 4}, {"index": 53, "review": "This Denny's is probably the worst customer service I have experienced. This place is terrible. My friends and I were having a late night dinner during a vacation. One of my friends wanted to order food and the rest wanted drinks. We waited for 15 minutes and we literally had to call them but they said to us to go back to our seats and wait there. In total, we waited for 30 minutes to order drinks. I wouldn't recommend going here.", "name": "Denny's", "rating": 1}, {"index": 54, "review": "Ener happen to be the first server I have came across that had so much class and respect. He was very welcoming and help us pick the right dish since we kinda wanted it all lol. I say make him management he is for sure great at what he does. I watched him while he worked and he has the same effect with us on everyone that he serves. It was nice to see him put a smile on everyone's face. And he checks on everyone at perfect timing too. Every time we needed something bam he was coming to us to help us out. Big plus because most of the time you have to sit there with your hand up for a few minutes big bummer. Well I would like to thank ener for his amazing service SALAMAT PO.", "name": "Denny's", "rating": 5}, {"index": 55, "review": "Burger was distinctly average. Wasn't bad, but it wasn't good either. Don't think I'd go back for the burger. Would maybe give it another go for another item on the menu.", "name": "Denny's", "rating": 3}, {"index": 56, "review": "Went for breakfast on last weekend. The service was excellent at this location. I ordered the usual veggie omelette which was just OK. The vegetables inside it were oily and were fried more than necessary. Hash browns were good as always.", "name": "Denny's", "rating": 3}, {"index": 57, "review": "Okay so I know what your thinking, it's a Dennys, how good could it be? Well you would be stupid as F*** to think that about this Dennys. These guys know what they are doing. The key here is consistency, every time I come here the food is cooked the right way and served the right way and it has flavor and it's not greasy or soggy or any of the crap all the other Dennys are known for. How's the service you ask? Well if you like servers who actually pay attention to you and remember your order and have big gorgeous smiles, then yea, the service is top notch here. #ImDone #NuffSaid", "name": "Denny's", "rating": 5}, {"index": 58, "review": "One of the better Denny's, but only because we've been here enough times on Tuesday nights that Jose the waiter knows what I order and makes sure the cook (Walter or Matt, I can't remember) takes care of me when I get the bourbon chicken grill.  Make sure they don't overcook it into a dry mess.  Denny's appears to be more expensive relative to say, a Carrow's I went to the other day.  But when it's late, there's not much choice.", "name": "Denny's", "rating": 3}, {"index": 59, "review": "Good company, good service.. and apparently a waitress that has been serving the group I was with for over the past 5 years.\n\nThe food was good and what you would expect from a well operated Denny's restaurant. Nothing quite too special, though me and my party were in the back in a room that could be closed off for privacy (which was cool).\n\nI assume that space is used mostly for private events, meetings, or a for a birthday event. Nonetheless it was a nice breakaway from the normal dining experience at a Denny's. \n\nAll-in-all, for a typical dining spot.. I would call it 3 stars... but rating it against other Denny's and similar restaurants? Very much more towards 4 stars. I'll be coming back here more often I think.", "name": "Denny's", "rating": 4}, {"index": 60, "review": "Terrible terrible terrible!!!!!! It was not busy at all it took them an hour to get part of the group their food and another 10 minutes to get the rest!!! Very very disappointed!", "name": "Denny's", "rating": 1}, {"index": 61, "review": "This Denny's is ... weird. \n\nI went in the other day for something I consider an excellent dish, the $8 \"cowboy chopped steak\" thing that has onion rings on top, with two sides,  always order spinach and broccoli. A fairly healthy meal at Denny's, how about that? \n\nSo I went in, the waiter sat me right next to a family with noisy young kids (restaurant was almost empty) I re-seated myself further away, and ask for the dish and the waiter looked at me oddly and said, \"We don't do that any more\". \n\nI got up and looked at the front of the place, Yep the $2, $4, $6, $8 banner is still across the front window, doesn't take much time to scrape the paint off either. But ... \"We really don't do that any more\". \n\nUhh, OK. \n\nI walked out. \n\nMaybe only \"participating\" restaurants do the promotional deals, I dunno. It was just weird.", "name": "Denny's", "rating": 1}, {"index": 62, "review": "Good food for a Denny's. Pancakes were yum. Appetizer platter was good (chicken strips, mozzarella sticks, and jalapeno bottle caps). Server was nice. Service was kind of slow, but was able to speed things up a bit by asking for my check early and letting my server know I was in a rush. 10% discount for Santa Clara County employees. Bathroom smelled like piss, but I wasn't eating food in the bathroom and people piss in bathrooms so it made sense to me. No stars lost for that.", "name": "Denny's", "rating": 5}, {"index": 63, "review": "Terrible service! We got there at 9:30 am didn't get our apetizer until almost 10 then our food came our an hour later COLD!  I've never had such terrible service here. I asked for a water and he never brought it. Refused to refill our orange juice because it wasn't free refills and it wasn't even busy when we got there. Terrible would not recommend", "name": "Denny's", "rating": 1}, {"index": 64, "review": "Just stopped by for a late night dinner after work. Just ate at breakfast bar, and Ana V helped me out and was very kind. I had a casual talk with her while she was rolling silverware. Really cool after a exhausting day of work. and professional at that. She's been through a lot and I can relate. Thxs Ana. Food was good too. Come back for sure", "name": "Denny's", "rating": 5}, {"index": 65, "review": "So it's been like 4 months since I came here and I still remember our waitress' name! Anna was absolutely off the hook! She took care of our table of 8 at 12am while half of us were drunk and stupid. She was super patient and super sweet! As far as the food goes, eh well it's a Denny's and you can't really expect more than what you pay for. Thanks for the awesome experience Anna!!\n\n-the crazy group that ordered all kinds of random things NOT on the menu:)", "name": "Denny's", "rating": 5}, {"index": 66, "review": "The smell just about knocked me out when we walked in. Overpowering stench! Don't know what it was. Like, a combo of stale, mildewy air and bad body odor. Wonder if they have mold? It was gushing rain out or I would have told my sweetie we had to go somewhere else. I just didn't feel like getting drenched again, but that was a decision I ended up regretting.\n\nSure wish I could give more than two stars because the server, Manuel, was so nice. But according to Yelp, three stars means \"A-ok\" and the food wasn't. My eggs were undercooked, and the toast was burnt. I couldn't finish my eggs and barely ate any toast. Ordinarily I'd have sent it back, but I didn't want to keep sitting through that smell. My partner enjoyed his food and the smell didn't bother him much. I can say that my hash browns were wonderful. \n\nIt was not crowded for breakfast on a weekend morning, but maybe that was because it was pouring rain out. I don't know how it usually is. This was our first visit to this location in years. I don't think we'll be back.", "name": "Denny's", "rating": 2}, {"index": 67, "review": "First time I came here there was a cockroach on the table. Second time I came there was MOLD in the bread of my American Slam. Absolutely disgusting.", "name": "Denny's", "rating": 1}, {"index": 68, "review": "I can't really complain about this location. This place is a regular eatery for a guys night out with the fellas. Service is friendly and food comes out  pretty quickly. The food here satisfies any drunken hunger.  And that's impressive with a staff working after 2am in the morning!", "name": "Denny's", "rating": 4}, {"index": 69, "review": "My Fiance and I had brunch here yesterday as we occasionally do on weekends.  That was probably our last trip to this one.   When we arrived we were greeted by the usual young man, who is always there.  He is very polite and attentive.  We sat down, and were quickly asked if we would like to order. We placed our order after getting our drinks and that was the end of customer service as we knew it there. After nearly 40 minutes of waiting for an update on our food, I got up and asked to speak to the manager.  It took another 5 minutes for her to come out. When she came over I expressed my dissatisfaction, and not once did she apologize. She replied with, \"I asked the cook to rush your order...\" I went and took my seat and waited another 5 minutes for our food to come out, which by the way was two sandwiches that I could have made in 3 minutes. After we were finished up, the manager came over and felt the need to explain the delay. She stated that the delay was a result of her replacing the printer paper in the machine and the our order being \"lost\".  She even went on to blame our server for \"not listening to her\" when she advised her to not input our order until she was finished replacing the printer paper.  Not once did I get an apology or even some type of comp for the inconvenience. Poor experience that caused me to be done with this place! I will also be writing to corporate.  From the looks of it, this is not a first.", "name": "Denny's", "rating": 2}, {"index": 70, "review": "They were understaffed I get it. Just because the large groups doesn't mean you should  ignore your other paying customers. There must have been some type of competition last night because when hubby and I went their were at least three large (10+) parties of loud mouth children. Ya'll need to teach your kids indoor voices.\n\nAlthough we were seated right away and she brought us water it took 25 for someone to take our order my husband had to go to the front and ask if there was anyone else working. We saw there was one other lady attending to 5 other tables.\n\nThey were out of soup at 9pm. The fish was soaked in oil. The people who came in a little while after us received the same kind of treatment. I over heard them contemplating on leaving. We will probably be back since this is the only place I like that's open late in SJ.", "name": "Denny's", "rating": 2}, {"index": 71, "review": "Stopped by Denny's for breakfast this morning. Very disappointed with the substitution policy communicated. Ordered a Fit Slam (egg whites scrambled with grape tomatoes, with 2 slices of turkey bacon, and an English muffin). I requested to substitute the turkey bacon for a few mushrooms in my eggs. Can't do it - he can give me an order of hashbrowns, fruit, regular bacon, and even deli turkey, but not mushrooms ... Really? Seems silly to me. Food was fine for a Denny's", "name": "Denny's", "rating": 2}, {"index": 72, "review": "Waited 30 min for water, came in 9:30 when its slow.. ??\nAsked waiter if I could sub things told me NO for everything.\nThen agures with me telling me I don't know what I ordered \nReally?  This is the worse dennys ever.. Buyer beware!", "name": "Denny's", "rating": 1}, {"index": 73, "review": "Bad service we never come back again !! We have an order ultimate skillet and take about 15 mins after the server bring out the skillet only have potato and egg then I asking the server this skillet support to have the sausage?! He said the cooker he may forgot then take about 10 mins i don't have my sausage yet ... I just paid the bill and walk out the door then the server ask me u don't want your sausage !!!!!", "name": "Denny's", "rating": 1}, {"index": 74, "review": "I havent been to a Dennys restaurant in a long time. A buddy of mine had a great coupon offer and he lives in this area so we ended up at this Denney's location about a week or so ago. Athough we were seated right away, it took forever to get a server over to take our order. (There were only 4 other people in the restaurant.) We both ordered entrees according to the terms of the coupon. The Bourbon Chicken Skillet looked good on the menu so that`s what I asked for. Big mistake. It took a long time to get our food and I think it was because they forgot the chicken was still on the grill. T-o-u-g-h-e-r than any poultry I have ever had. The vegetables and potatos were like mush. My buddy`s Chicken Fried Steak was like a hockey puck covered with gravy. The broccoli was woody. The server`s attitude was so bad, we kinda wondered what would happen if we sent the food back. So we didn't even ask to talk to the manager. We declined the food and just paid for our drinks. On the way out we gave the coupon to a couple who were walking in.  Hope they had a different server and better food.", "name": "Denny's", "rating": 1}, {"index": 75, "review": "Denny's is not my #1 choice for breakfast but since we haven't been here in awhile we thought it's a good place for breakfast as a family. \n\nWe were seated promptly. Our server was attentive and courteous. The wait time for our food was OK; not super fast, but not too long either. Food was good for being Denny's. \n\nThis Denny's is so much better than the other one down the street, both in service and quality. \n\nParking is plentiful in the rear.", "name": "Denny's", "rating": 4}, {"index": 76, "review": "A review of Denny\"s? Seems silly but, I just had to do it. Outside looked yukky - a few homeless wandering around; the business next door was vacant. But I'd called in a \"to go\" order so I decided I might as well pick it up - and the guy on the phone had been great; helpful, polite, gave me info on the sides available and how long it would take without being asked. \n\nInside it was clean and comfortable. It was mid-afternoon, so not busy but several apparent \"regulars\" walked in with me, which is often a good sign.  The host(?) immediately greeted me and asked if I'd made the \"to-go\" order. It was ready to go, had all the extras I'd asked for and included eating utensils. I travel a lot so I know this isn't always the case. \nMost importantly, hot food was hot, cold was cold and many items were packaged separately so it didn't spill all together by the time I arrived back at the hotel. The salad was fresh and substantial. Food tasted good - and was well prepared - and I had fish, of all things!\n \nIt IS a Denny's and not a new one, which is why it's a 4 not a 5; but I was pleased and would definitely go there again when I'm in the area.", "name": "Denny's", "rating": 4}, {"index": 77, "review": "i've been sitting in this denny's the entire day.\n\nin the morning/day shifts, the female waitress attending to my table was really great and friendly and kept coming back to ask how i was doing, etc. while i didn't really need all that, i think this is what most customers like.\n\nin the night shift however, the male waiter wasn't as friendly- maybe cos i haven't ordered anything since his shift started. when i went to order tho, he picked up the paid receipt on my table, didn't look at it, and asked me straight out if this is paid for already. think he thinks i'm just freeloading and plan to run off, so maybe that's why his attitude wasn't so great.\n\non an overall though, i think i'd still come back. love the greasy american breakfast and free refills, and this outlet is really quiet for a Sunday! thought i was going to hear all screaming and shouting like starbucks all day but the families controlled their kids pretty well and it wasn't too busy all day.", "name": "Denny's", "rating": 4}, {"index": 78, "review": "called in my breakfast order 15 min prior to arrival, had my food ready and i was on my way to the airport", "name": "Denny's", "rating": 4}, {"index": 79, "review": "great late night spot, they have a meeting room that can fit 20-30 people works good when you have a large crowd at 3am!\n\nIf Luis is still working nights there, he is the man!", "name": "Denny's", "rating": 4}, {"index": 80, "review": "This place has one of the worst crew. It takes them ages to prepare anything. Hosts and the servers are all unfriendly. The food, however, is good.", "name": "Denny's", "rating": 3}, {"index": 81, "review": "out of all the Dennys i have been to, this one is the only i like \nevery time i go with the family my meals are hot and i receive an ok service \nit takes time for food to arrive but it is worth it", "name": "Denny's", "rating": 4}, {"index": 82, "review": "Terrible! Seated at a sticky table, after 20 minutes and several attempts to get the staff to even bring water with no results, we left. There were several other families still waiting and the staff was almost nonexistent.\nAs we left the person standing at the cashier's station looked at us but made no attempt to speak, gesture or otherwise acknowledge our presence or departure. \n\nAppeared to be very understaffed, but maybe 1/3 capacity of customers.", "name": "Denny's", "rating": 1}, {"index": 83, "review": "I love this place. It is very clean, spacious and quiet. I enjoy coming here to have a dish of pasta and while reading a book. The staffs are always sweet, friendly and nice. Their food are quiet good compare to the other Denny. Beside that, this is the only place carries pasta with meat balls, The order Dennys do not have it.", "name": "Denny's", "rating": 4}, {"index": 84, "review": "Terrible, terrible, terrible. We ordered two Lumberjack Slams. The meal was not hot. The pancakes were cold. The English muffin had yellow grease on it. No flavor. My stomach felt queasy. My dining companion went to the restroom after eating his eggs, sausage and bacon. Service was adequate. The server never checked back until the end of the meal. We won't be returning here ever again.", "name": "Denny's", "rating": 1}, {"index": 85, "review": "This is the worse denny's I have been to.  Me and my family will not be back to this one.  They have so many stipulations to there menus. There are no substitutions, they change they way that kids eat free, they don't allow you to add on to your selection without paying an extra charge (not extra food, but if you add a dived cucumber to your salad or tomatoes, there is a charge. I am aware that each denny is independently owned but they advertise the same for all and then switch when you get there.  Not cool.  If I could give this place a no stars I would but yelp requires that you give at least one to post a comment.", "name": "Denny's", "rating": 1}, {"index": 86, "review": "I went here for lunch on a Sat for my 30 min break! It was pretty packed and a little worried that i may take longer than 30 mins I got seat very quickly and had a server bring me water and menu promptly as well! Service was great food was fresh , hot and good! server was on it! got me refills and brought napkins without skipping a beat with many tables. If in the area will stop bye for sure!!!", "name": "Denny's", "rating": 4}, {"index": 87, "review": "Great late night spot.  Chocolate milk shakes are awesome here.", "name": "Denny's", "rating": 4}, {"index": 88, "review": "This Dennys is kind of in a little sketchy spot. It's kind of secluded from downtown club area so it's definitely nice to not have to deal with a bunch of drunk rowdy people late at night.", "name": "Denny's", "rating": 3}, {"index": 89, "review": "This Denny's is pretty cool. Been here a few times and. Ever had a problem with my order or the staff. If its an early breakfast, lunch or after bar hopping... It's always a cool spot. Clean, quick and efficient. Food is pretty decent too.", "name": "Denny's", "rating": 3}, {"index": 90, "review": "Typical older Denny's. Good breakfast at a reasonable price. Service is good as well.", "name": "Denny's", "rating": 3}, {"index": 91, "review": "It's Denny's. No big deal. The service is pretty quick and the food can be better. But I usually don't expect too much. \n\nFavorite things I like to order: the Slam burger, the Country Fried steak, the Sampler, the Grand Slam and the French Toast Slam. You can't go wrong with these. \n\nThe area is a bit questionable and the crowd is sometimes strange. But for a good 24 hour/ late night eatery, it pulls through. I prefer this one over others because it doesn't pack in all the drunkards straying from downtown. \n\nIf only Norm's could move up North. But until then, I think Denny's will do just fine.", "name": "Denny's", "rating": 3}, {"index": 92, "review": "I came here for an early dinner on a Sunday evening and this place was empty for the exception of one other customer.  Our orders were taken promptly and our food came out super fast.  The food was just okay, not as good as other Denny's that I frequent.", "name": "Denny's", "rating": 3}, {"index": 93, "review": "i'm not to fond of late night places that are crowded with rowdy and loud customers. this location definitely suits me better since no one wants to drive far for some quiet time after being at a club or bar.\n\nDecor: the place is your typical traditional Denny's..now that i've thought about it...all Denny's seem to look the same to me\n\nAmbiance: like i said, it's a lot quieter here. \n\nFood: Mac & Cheese Patty Melt. i was surprised i actually liked it since i'm not much of a fan of mac & cheese. it didn't over power the dish at all, the patty was nice and made by hand since it didn't look perfect at all. the crisp of the bread was just right. \n\nService: very good and acceptable service. no complaints", "name": "Denny's", "rating": 4}, {"index": 94, "review": "Average food, consistent with what you would expect from Denny's. I do have to admit the service is great at this location.", "name": "Denny's", "rating": 2}, {"index": 95, "review": "You can't go wrong with Denny's - consistently decent, no-frills food at wallet-friendly prices. I always go for their breakfast menu - everything is good, and cooked exactly to order. Coffee is above average too. The service may not be overly friendly, but in my experience it is always prompt and efficient. It's a shame there isn't a Denny's closer to where I live : /  \n\nPS I wish the bacon had choked you to death, you bastard.", "name": "Denny's", "rating": 4}, {"index": 96, "review": "4 stars...but 4 stars on the Denny's scale.  Not comparable to other restaurants, really.\n\nThere are few restaurants open late night (at least that I know of) so Denny's is kind of a default location.\n\nThe Denny's menu...always disappointing.  Especially for a vegetarian; every single breakfast item comes with bacon and sausage.  They did sub pancakes for me though, so I got exactly what I wanted.\n\nOur server tonight was particularly good.  He brought hot sauce to the table without a request, and brought my friend numerous refills of the Fusion drinks...which we were under the impression did not come with refills.\n\nIt may be Denny's, but it blows the IHOP down the street out of the water.", "name": "Denny's", "rating": 4}, {"index": 97, "review": "Not happy with dennys at all. I've been going there for years with my family because my son likes it. On our last visit we both ended up getting food poisoning. It was a terrible night for both of us especially since I am five months pregnant. I contacted them the next day to let them know and was promised that the general manager was going to call me. They hadn't called so I called back and they said it was under investigation and he would call the next day. Still no response!! I won't ever be going back there.", "name": "Denny's", "rating": 1}, {"index": 98, "review": "Some nice folk. Never crowded. Good strawberry shakes.\n\nAs for the food... Well.. It's Denny's.", "name": "Denny's", "rating": 3}, {"index": 99, "review": "WHAT can u say about Denny's? Any who complains about Denny's probably shouldn't be there in the first place! Late night eats..... early morning eats.... looking for a cheap eat or ur a cheap date... THIS is the place!!! When I order my breakfast at 7, 8, 11pm... I don't care that my bacon is small than the size of a pencil! I don't care that all the waiters are really hard to understand and can never get my order right! All I care is that it's fast... it's cheap... and if I really cared about the food I was eating at THAT moment... I would go somewhere else!\n\nThis particular Denny's is never packed...even on a Sunday afternoon when all us church people are starving..... the staff is always nice and seat you fast..... hey they even have a little stuffed toy machine the sucks in alllll your dollars and quarters AND u never get a prize! Now THAT'S service!!!!  ;o) (though I've won a couple time...)\n\nShall we dine?????", "name": "Denny's", "rating": 4}, {"index": 100, "review": "ok the reason we ate here was it was cheaper then the hotel food while we were at the clockwork alchemy con and they offered discount as we were part of the convention which was very good", "name": "Denny's", "rating": 3}, {"index": 101, "review": "The staff here are friendly and food is served quite fast.  I always enjoy having dinner at this Denny's.", "name": "Denny's", "rating": 4}, {"index": 102, "review": "Biscuits and gravy to die for.  Coffee cup didn't go empty.  Nothing to complain about.  But come on, I'm not going to give Denny's a four-or-above.  C'mon, it's Denny's.", "name": "Denny's", "rating": 3}, {"index": 103, "review": "The cashier couldn't figure out how to divide the check between 2 people.  Had to ask for coffee and jam.", "name": "Denny's", "rating": 2}, {"index": 104, "review": "Good service but i don't know if the waitress was just being nice because she wanted a tip or something else. But the food was really good like any other dennys i guess. i like dennys because you don't have to wait to be seated and the food comes vary fast depending on when you go,but overall it was a great.", "name": "Denny's", "rating": 4}, {"index": 105, "review": "It was the life saver again on the eve of thanks giving as all the other places were closed. I had the chicken melt and it was yummy and the ranch was also tasty. My friend ordered the strawberry lemoade and it was really refreshing. One of the thing i will live to recommend is the foul smell that comes once you enter the place, looks like they need to change there wiping towels.", "name": "Denny's", "rating": 3}, {"index": 106, "review": "Terrible Service! We went with a party of 13 (5 children)... The food took 1 hour to come out. There were families who were seated after us who got their food and finished before us. Our kids started to get fussy so we asked to at least bring their food out, but they waited to bring the entire food out. Some food was cold and it took them at least 30 minutes to bring out the drinks. Our waitress was Yolanda and the service was TERRIBLE!! At one point during check-out the cashier asked another customer, \"Did you give me a $10 or a $20\"? HORRIBLE! Do not go here unless you have time to kill!", "name": "Denny's", "rating": 1}]