[{"index": 0, "review": "We had the Lucky Jameson since it is St. Patrick's.\nThe bartender Antwon & manager  Stacy were absolutely hospitable & kind. It was a pit stop!\nGreat visit & great conversation!!! Y'all were GREAT!!!", "name": "Chili's", "rating": 5}, {"index": 1, "review": "Came here with a few of my friends and i ordered the santa fe crispers salad and a side of fries\n\nSanta Fe Salad: 2/5 My salad was drenched in dressing and it was way too heavy. Some of the lettuce even had brown spots. Only good thing about this was the chicken crispers. \n\nFries: 5/5 Great fries! \n\nService: 5/5 Our server was friendly and quick to refill drinks", "name": "Chili's", "rating": 2}, {"index": 2, "review": "One of my favorite places to take my fiancé our to dinner. The low lighting really helps set the mood while the interactive tablet brings some fun to the night with a wide verity of games that will definitely keep the visit entertaining. Chili's had a complete bar with shots,beers on tap, mixed drinks to accompany you delicious meal.\nMy favorite thing to order is the smokehouse trio. It is filling ,reasonably  priced, and delicious.\nThe service is surprisingly fast and is very welcoming. \nI will definitely be coming back.\n\nIf your looking for a good date night or, simply looking for a good dinner spot, Chillies a must.", "name": "Chili's", "rating": 4}, {"index": 3, "review": "Average food. Nothing impressive nor mediocre. Service was good. Dinner time looked somewhat like crickets chirping, which is not that busy. Food came very quickly! Noticeably...\n\nCold a/c rooms during dinner, thin tortilla chips and watery salsa, and somewhat weird meat color of the rib meat were the things to remember not to order in the future. Remember...\n\nBurger was good and the meat was cooked as requested.\n\nProbably won't be coming back. Seemed like the worse Chili's food I ever had compared to the other location I have been long ago.", "name": "Chili's", "rating": 3}, {"index": 4, "review": "So I don't know what to say, I have been to Chili's many times and every time I am disappointed but we keep going. I think the idea of a molten lava cake is it.   We went here and used the yelp app to get in line.  Big help.   Yeah Yelp!\n\nWe order the 3 appetizer special.  Hum how do you over cook onion rings.  Ask Chilis.  How do you make chicken wings taste like paper.  As Chilis.   Everything was medicore but the price was low.\n\nFinally go to the molten chocolate cake and it was not the same as a couple of years ago.  Not moist not chocolatey.  Felt like a sponge cake with sugar all of it. Not going to go to Chilis again, until we go again.", "name": "Chili's", "rating": 2}, {"index": 5, "review": "I'm only giving it a two because the hostess was a sweet girl and very friendly. For starters, it's disgustingly filthy. The floors need to be machine scrubbed with degreaser BAD. My shoes were sticking to the ground and continued to after leaving. The restroom floors are just as disgusting with \"gunk\" around the partition bases and all in the corners. Sink was moldy and had crud built up all around the faucets. Very nasty for a place serving food. The waitress was horrible. Not friendly and argued with us when asking for basic stuff, like limes for our beers and extra napkins. She never came to ask if our food was ok. Which it wasn't. The flatbread was undercooked. The dough was raw'ish and the pizza was cold. I didn't bother complaining because at that point I didn't want to eat their food anymore. Horrible experience. Worst chili's I've ever been to hands down.", "name": "Chili's", "rating": 2}, {"index": 6, "review": "My boyfriend had a $25 Chili's gift card. I had never had the best opinion of Chili's, and hadn't gone to one in quite a few years, but I guess opinions change...\n\nThe menu has definitely undergone some revisions. There were plenty of options to choose from, including some low calorie ones. I really appreciate restaurant that offer nutritional values!\n\nWould I return? Well, it won't be my first choice, but I certainly wouldn't scoff the next time it's proposed as an option. This location is also great, since there is plenty of parking.", "name": "Chili's", "rating": 4}, {"index": 7, "review": "Went to lunch today with a co worker. We were seated immediately and drinks on the table within 4 minutes. The lunch items we ordered were hot and fresh and arrived quickly. We used the device on the table to pay the check. The device worked properly. Nice quick lunch and will be back soon.", "name": "Chili's", "rating": 5}, {"index": 8, "review": "Chili's chili's chili's.  I really want to upgrade this location to 4 stars.  But every time I go to, I am reminded why it's only 3 stars.  The service was super slow.  Although our server was nice, she forgot about us for 15 minute increments at a time.  The only saving grace was the manager.  The manager we spook e to was very professional and picked up the slack where our server had fallen so short.  But geez man.  This chili's can be so much better with just a few tweaks to the servers staff.", "name": "Chili's", "rating": 3}, {"index": 9, "review": "Our local Chili's - we love it! Always super-fast service with a smile. Everyone is friendly - hosts, bussers, runners, servers, bartenders. Kaitlyn (our server the past few visits) is awesome!!", "name": "Chili's", "rating": 5}, {"index": 10, "review": "Usually come here and get good service, came in tonight around 5:30pm for dinner. We were seated right away and then waited the next 15 minutes for a waiter to come to our table. I let the host know but we continued to wait and wait. We left after 15 minutes and went to BJs. Although we had to wait another 30 minutes to eat, it was well worth it.", "name": "Chili's", "rating": 1}, {"index": 11, "review": "We have used this Chili's numerous times for take out (ToGo's) and somehow every single time something is left off an order.  Usually I just suck it up, but the last three times we order fajitas and each time we ask for extra tortillas. What happens..... we get none. This time I tried to even give a small tip to incentivize actually getting what we pay for. Nope in fact we get zero in total. So extra money for extra dishonesty from your team. I call the restaurant and first am answered by somebody picking up the phone and putting it on a counter where I listen to the restaurant pots and pans clink around for 5 mins. Finally get a manager who refunds a portion of the meal. I appreciate that but frankly this restaurant as a history of not doing their job. Chili's I expect you to make this right or I will continue to share my negative experience.\n\n***Update 12-6-17***\nNever heard anything back from this location so now I make it a habit to tell people to stay away from Chili's. I work in hotels too so I tell a lot of people. Good job Chilis for not giving a crap about my repeat issues.", "name": "Chili's", "rating": 1}, {"index": 12, "review": "I simply cannot believe how inefficient and disgusting this place is. \n\nWe should have left as soon as we walked in, however, we were mind set on having Chili's since neither of us had been there in years. \n\nAfter standing and waiting to be seated for 8 mins, we were finally seated at this disgusting table, and handed menus with nasty, caked on old food and drinks from someone else! THEN!!! ... the server hands me dirty silverware!!!\n\nWe should have left at this point, but for some reason my other half was really craving Chili's... Moving on ...\n\nThe draft beer I ordered came out tasting spoiled and had zero carbonation. I asked for a bottle of beer as a replacement that took nearly 20 mins to get to the table. While waiting for my beer I thought I would drink the water the server brought when noticed dirt in my water glass!!\n\nTHEN... I just happened to look up, and saw what looked to be years of dirt and dust hanging from the rafters!! Total health code violation!! This place is disgusting and needs to be shut down!\n\nThe table and floor next to us hadn't been cleaned in hours. In fact, when they brought out the food for the table next to us, they literally sat their tray of food on top of dirty wash rags and trash before serving it to them.\n\nTo add insult to injury, we were sitting there for about 20 mins waiting on the check... no one came to check on us so we decided to pay via the tablet on the table. I swiped my card, but it was out of paper! I have no idea if it was broke or not, we just got up and walked out. Hopefully we didn't dine and dash!", "name": "Chili's", "rating": 1}, {"index": 13, "review": "Whoa, whoa, whoa...  are you kidding me???  Yeah, I know, I promised not to review any more \"chain\" restaurants but this has to be done...\n\nBeen to this Chili's many times but something has obviously changed...\n\nStarted with chips and queso... Bleh... Have never seen their queso so chunky, oily and in clumps.  The chips... broken, oily and in bunches all stuck together.  Ordered the fajitas half beef and half chicken.  Just look at the pic and try not to laugh.  Portion is hysterical.  The beef was sliced with the grain of the meat so it was super chewy.  Chicken looked boiled then sorta grilled just to add markings.  Onions and peppers soaking in oil.  Tortillas came wrapped in tin foil but at least they were hot.  I guess they no longer give you a boat of sour cream, guac, cheese and pico de gallo to spice up your fajita. \n\nWhat happened here?  Was it just us?  I'm absolutely stupefied by this experience.  I actually love me some Chili's... or at least I used to.  Hoping it's just this location cause I've never been disappointed at either the Santa Clara or Alamden locations.  \n\nThink we'll be eating at BJ's Brewery moving forward...\n\nAdios Chili's @ Coleman!!!", "name": "Chili's", "rating": 1}, {"index": 14, "review": "I don't think I have much to complain about here - the food was tasty, the place was comfortable, and the service was smooth. Took a while to make our food but we did order quite a bit. Their chocolate cake was terrific and writing about it is making me salivate right now. Yummy", "name": "Chili's", "rating": 5}, {"index": 15, "review": "My wife likes Chili's burgers and she likes them with Swiss Cheese.  But to our surprise, this Chili's no longer carries Swiss Cheese.....what the hell?   Mr/Ms GM are you related to Trent Baalke (former 49ers GM)  because neither of you know anything about common sense!!!!  Plus the only reason you got two stars was because your server was excellent!\n\nCame for a second visit, still dont have swiss cheese.  But the food was good. Manager Stacy was excellent and checking on us regularly.   Maybe Stacy should become the GM... in fact I recommend it!!!  This visit four stars, because of Stacy", "name": "Chili's", "rating": 2}, {"index": 16, "review": "Tho it's a holiday I understand the wait time but what is discouraging is having to hear the host tell you that each side only has two servers due to be under staff and how he has to clean tables, seat another group ahead of us since they short staffed.", "name": "Chili's", "rating": 1}, {"index": 17, "review": "What a SH*TTY assemblage of \"employees\" tonight!  No fewer than NINE managed to avoid giving any attention, other than to each other.  Standing there for over ten minutes waiting for the order that I already placed and paid for online (which they refused to provide curbside service on, despite their ads for such).   Now I get cold, mediocre food, and lost the desire to eat it anyway.  Total waste.", "name": "Chili's", "rating": 1}, {"index": 18, "review": "Haven't been here in awhile. So, we thought we'd visit after arriving from a business trip. What a disappointing experience. We arrived and grabbed a table in the bar. The entire restaurant looked dead. \nAlthough there were few patrons, it took 10 minutes to chat or table and the surrounding duty tables weren't cleared the entire time we were there.\nOnce the table eat cleared, we ordered a burger, hit wings and chicken strips. The burger was surprisingly good. \nIf you're looking for a decent environment with good service, this is not the place for you.", "name": "Chili's", "rating": 1}, {"index": 19, "review": "So annoying! Placed an online order for chicken and waffles and I requested loaded mashed potatoes as a side and got fries... really? How hard is it to follow directions. Also I've been trying to call for the past hour and no ones answering the restaurant. Who's running this place?", "name": "Chili's", "rating": 1}, {"index": 20, "review": "Arrived Saturday at 4:45 PM. No hostess. Waited 5 minutes, guy from the bar came over and asked if we wanted to sit in the bar or in the regular dining area. We said dining area, he said give him a minute. He went back to what he was doing. Another 5 minutes later, another guy from the bar came over and suggested we sit in the bar because there was only one wait staff in the regular dining area. \n\nWe left and went to BJs. \n\nSaturday early evening, no hostess and only one wait staff in the regular dining area. Are they looking for help or are they looking to close their doors?", "name": "Chili's", "rating": 1}, {"index": 21, "review": "Friday night after TG & restaurant was pretty quiet.  We were seated quickly & our amazing waitress (Rihana) appeared & met our highest expectations.  Hamburgers, onion rings & caribbean salad were great-french fries not so much.  They were a little \"cardboardie\".  \nHowever, the main problem was that the place was freezing.  It was 64 degrees outside & when we walked in it felt like a fridge.  At our request they turned the cold off for about 15 minutes, but then it came back.  Took me 15 minutes in a hot shower to get warm when I got home.  Won't be coming back here unless they warm the place up.  What were they thinking?????", "name": "Chili's", "rating": 2}, {"index": 22, "review": "This is our default.. go to spot... We're hungry don't know what we want? Chili's... I think one of the biggest things that keep us coming back are the friends we've made here. The service is great the food is great.. what more could you ask for... Shout out to Yesenia, Carlos, Kaytlin, Keirsten and everyone who's always making our visits that much better!", "name": "Chili's", "rating": 5}, {"index": 23, "review": "SO slow!!! Horrible service. The waitress didn't follow up on our order and we were left waiting for over 45 minutes for our food. When it arrived the food was cold, my salad had wilted in the dressing, and wrong items were brought out. The manager came over to discuss the situation. He offered a discount and we asked to comp our meal instead because the experience was just that bad. As we were leaving it looked like yet another table was having an issue with the manager. Yikes....we won't be back.", "name": "Chili's", "rating": 1}, {"index": 24, "review": "NEVER AGAIN!!!\nI have had nothing but issues at this establishment and the latest one was this past Friday evening, I went with a co-worker for dinner, we got the 2 for $22 and paid an extra $1.00 each for asparagus with our steak meals.\nI ordered my steak medium rare, beside waiting over 30 minutes for the appetizer and then almost and hour for the meal itself, my steak was not medium rare, it was well done to a crisp. I notified the server who had a trainee and she was shocked it was so well done and said the meal would be taken off. \nOk, so 1/2 of 22.00 is 11.00 correct? NOT! They took of $10.00 and left the $1.00 for the asparagus which mine was tiny small pieces of stalk while my co-workers looked normal, I even questioned why and got some crappy answer. When question why am I paying for that, receipt got modified again and now I am paying $2.00 for the appetizer, are you kidding me? REALLY?\nI did not want another steak as the first one took almost one hour to get, do you think it was right to charge me for the appetizer, REALLY? This was you FAULT CHILI'S...NOT MINE, not even a free desert, nothing...ended up paying $17.36 for two horrible meals with horrible service.\nI never have ever had a good experience at this place so I am done, the service right down to the food..HORRIBLE.", "name": "Chili's", "rating": 1}, {"index": 25, "review": "This location is good but the service is slow. Not my first choice if places to go, especially with all of the other good choices nearby. Mixed drinks here are never strong. If you want a buzz you are better off ordering a beer.", "name": "Chili's", "rating": 3}, {"index": 26, "review": "We've gone to Chili's for years and been mostly satisfied with the food, value and customer service. This past week we visited the Coleman location and ate from the new menu. How disappointing! The mango chili chicken was rubber. It seems like pressed chicken or that it was over marinated. Either way, it was not good. My husband had the chipotle honey chicken tenders. He too was disappointed. They just weren't good quality. It seems they've downgraded the quality of the food in order to save money.", "name": "Chili's", "rating": 2}, {"index": 27, "review": "This Chili's by Coleman Avenue is quite impressive. First, the servers are super awesome! Always attentive, funny, and knows when to come to us and replenish our drinks! Second, the place is wayyyy better than any Chili's I have been at, and believe me, I have been to many. Third, love the selection of beers! And I am a beer man myself, so I am quite satisfied. Love the affordability of the food, not to\nmention the actual food itself is good. I am really sold though with their customer service. That is half the battle there...and that is a good indication of how well your night will be at that restaurant. \n\nSo try Chili's when you want to go cheap, and indulge on their happy hour!\n\nIndulged on - beers with happy hour food!", "name": "Chili's", "rating": 4}, {"index": 28, "review": "These workers in here are literally standing around talking about how much they drank last night in the To-Go area. Waiting. Waiting...", "name": "Chili's", "rating": 1}, {"index": 29, "review": "I'm usually pretty satisfied with most Chili's locations, however, I am extremely disappointed with the service I received tonight. At first our server was doing great, brought out drinks and appetizer fairly quickly. When our food was brought out, I discovered that my order was completely butchered and our server didn't come check on us until 10 minutes had passed. By this point, my boyfriend was already half way finished with his meal and I hadn't had a bite of my meal. Finally, I got my order fixed. The server was nice about it, but I'm still disappointed with my experience.", "name": "Chili's", "rating": 2}, {"index": 30, "review": "Good food, they let me bring my scooter in. They did say I may be to drunk to drive my scooter home, but I like to live life on the edge I pushed that bad boy home.", "name": "Chili's", "rating": 4}, {"index": 31, "review": "Went here yesterday, we ordered the egg roll appetizer. It was waaayy too hot ( temperature wise )it burned my freaking mouth to where it actually took a layer skin from the roof of my mouth. I let our waitress know of the issue and all she said was \"oh I'm sorry\" . I wasn't trying to get anything free or anything of the sort. But she showed no real concern and that is the reason for this review.", "name": "Chili's", "rating": 1}, {"index": 32, "review": "This one is my favorite Chili's in San Jose. Always right on when it comes to food and customer service.", "name": "Chili's", "rating": 4}, {"index": 33, "review": "First off it should be noted that I am temporarily in a wheelchair due to a terrible car accident with that being said it is a very complicated process to just go out... my family wanted to treat me out to dinner and when we got to chilis nobody seated us so we just sat ourselves. I was approached by a waitress about 3 minutes later telling me that me sitting here I was a fire hazard and that it's protocols that I am not allowed to sit here... I was shocked to be told that I was a) a fire hazard after nobody even sat me. B) made to feel like a bother. C) I was humiliated bc now the people sitting at other tables seen how this waitress was acting. I will not be coming here ever again. I will not be made to feel less than ever again, and shame on you for making a customer let alone anyone feeling like this. Pathetic.", "name": "Chili's", "rating": 1}, {"index": 34, "review": "I never have high expectations for Chilis, but this location is the ghetto of the Chilis chain.\nRipped up booths, dirty restrooms and excrutiatingly slow and indifferent service.\nThe restaurant itself smells of old fryer oil and it shows in the food. Ghastly.\nTook 20 minutes to be seated, another 15 to be acknowledged.\nTwo hours of my life wasted, never to be recovered.\nOnly reason to come, my kids like the tableside video games, which even broke down.", "name": "Chili's", "rating": 1}, {"index": 35, "review": "Awful service in the bar area. We've seen the waitress on in 40 minutes. Sitting with empty beer glasses. Sunday is football and happy hour - the waitress should be \"on it\"", "name": "Chili's", "rating": 1}, {"index": 36, "review": "Great service (Ashley) and a great meal! Pleasantly surprised. Our salads were fresh and our meals were hot and cooked to perfection.  This location is also super clean!", "name": "Chili's", "rating": 5}, {"index": 37, "review": "The best and most memorable thing chili's has is the baby back ribs commercial from a decade ago. Over all the fajitas were ok. Give me 15 minutes in a kitchen and I could've made something three times as good. It's a good stop if you're hangry and want some mediocre food.", "name": "Chili's", "rating": 2}, {"index": 38, "review": "If you cAn honestly say you enjoy chilis food and or service, then you have not truly experience dining or customer experience.\n\nI come here every so often as my father in law enjoys it so I don't complain, but it's never my first choice.\n\nTonight there were 5 of us and compared to how packed Chilis has been in past visits, it was really dead. Our food took 40 minutes to come out. I had ordered fajitas and they usually provide a side of guac, salsa, cheese. My cheese had moldy spots all over. I did not even bother to tell them or return it, simply because the gentleman who was running the food was a complete asshole.\n\nI highly suggest management has a conversation with the gentleman who was bringing food out of the kitchen to tables. Disrespectful and rude are only two words that I can find that are appropriate to use to describe him. \n\nGet your head out of your ass, smile, show some customer service skills and be the waiter that you are. If you don't like your job, get a new one. \n\nStay in school.", "name": "Chili's", "rating": 1}, {"index": 39, "review": "Despite having been served undercooked chicken once here, I still come back.  I just don't order the chicken breasts anymore.  Still a decent Chili's with what you'd expect from the chain.  This location can get busy during peak hours so there may be a wait on weekends.\n\nThis place is good for a decent cheap meal.  A lot of times, I get the dinner for 2 deals.  This place is also good for grabbing a beer and apps.  Service here is basically a crap shoot.  I've had amazing service as well as poor service here, it really just depends on your waiter.  \n\nNot really much else to say.  I still like Chili's every once in a while.  This location is convenient and honestly one of the better Chili's I've been to.", "name": "Chili's", "rating": 3}, {"index": 40, "review": "This place is great! Great customer service. I'm not from San Jose but if I'm ever back in this area, I would love to come back to this Chili's. Nick D. was our server and was really kind and helpful.\nMy girlfriend and I wanted to go get something to eat with the kids on New Years Eve after going to a hockey game and for my birthday. We decided to go to Chili's and we do not regret it at all. The manager was great, our food was great and the drinks were great too! Thank you guys for the awesome experience. Happy New Year!", "name": "Chili's", "rating": 5}, {"index": 41, "review": "Usually my lunches here are great. Today was not one of those times. I ordered the Bottomless Soup and Salad. My first bowl of soup had pieces of plastic however my server Lanessa quickly took care of that and brought me a new one right away. After that everything seemed to be ok. Both Lanessa and Devana were great servers and very courteous and friendly. \n\nProbably my only other concern was that Lanessa's bus boy never came by to remove the soup bowls and just allowed them to pile up on the table which never happened before.\n\nAll in all my visit today was saved by Lanessa and Devana but were it not for them, I would say this was not my best experience. :-(", "name": "Chili's", "rating": 2}, {"index": 42, "review": "The area and service was perfect the only thing that we were bummed out was they removed the skillet mashed potato and one of the reason we go to chilis is for their president margaritas and the skillet mashed potato", "name": "Chili's", "rating": 5}, {"index": 43, "review": "Horrible! We called ahead (days) and informed them we had a big party coming (30 people ), they did have our table ready which was nice.\n\nHowever, they subjected a new server to out party. So the service was horrible. The poor girl tried, but really was unable to help us.  The manager was completely unhelpful.\n1 they ran out of ribs !! Really?!? Manager was unapologetic \n2. We served ourselves napkins, utensils, some got up to the bar to get their own drinks.\n3. Food took over an hour to come out & most of the adults food was incorrect, ( over cooked,items on/in the food that was asked not to be there -onions when it was specified 'no onions' chicken (for a vegan meal), items missing from the ordered meals (rice, beans, etc)  the kids food -they just ate it. )   We had arrived between 8:30-9, ordered by 9:30. Food trickled out at 10:30! \n4. The manager NEVER came over to our table -not once, even after we complained because we got up to talk to to the manager about us having to serve ourselves stuff.  Not even to see how our orders were, not after our meals.  Horrible!! \n5. We did get an experienced server to help - he was efficient, & apologetic, but really just blamed the size of the party for the problems.  We asked about the other server & he said she was new.  But really?!?  Not our fault your restaurant can't handle larger parties on a Saturday night! \n\n 6.  checks were wrong, some had the wrong items on it...they did fix it. \n\nThis was not our first restaurant experience with this large group. We are organized in our system of ordering, we pay & tip properly,-and we know it's not easy with a large group. So we don't complain - but this experience was such a reflection of horrible management. Chilies should really look into this locations  manager, because it was horribly serviced, the new server should not have gotten our table, we should have had more than one server if we were to get the new one. The kitchen got most of our orders wrong.  It was a poorly run restaurant- that goes all on the manager!!! \n\nI come from a long line of food service families both catering & restaurants - this was the worst I have come across. Worth writing about!!!", "name": "Chili's", "rating": 1}, {"index": 44, "review": "They told my sister that is in a wheelchair that she was a fire hazard. Ah excuse me last time I checked your business is by law supposed to be able to service those in a handicapped situation, no matter race, age, religion, or the gender. So that fact that they refuse to service us , was not only unethical, but unconstitutional. So I do not recommend this un-American and in holy place upon my worst enemy.", "name": "Chili's", "rating": 1}, {"index": 45, "review": "I am sitting in here completely dumbfounded. Managers friends came in and were fed 30 minutes (no exageration) before our order was even taken. Complained to him and he disappeared. So much wrong with this situation but im so frustrated and dealing with two hungry children so i cant even type the whole thing right now. I will add to later. NEVER returning to this Chilis. Absolutely zero customer service. Wow.", "name": "Chili's", "rating": 1}, {"index": 46, "review": "Waited 36 minutes for flatbread appetizer, chicken salad, and soup.\n\nThis is ridiculous. You would think that at 5 pm the restaurant would be packed and busy. However, it wasn't. It was a slow Thursday evening. It took the attendant 5 minutes to sit me and my guest. \n\nWe ordered our food and the waiting begins. Our waitress was looking after 3 tables in our section. She came to them several times to refill their drinks and to chat. My guest and I waited 10 minutes to get our teas refilled. \n\nFinally after 36 minutes, we finally got our APPETIZER.. (flatbread was gross, don't get it)\n\nOur plates came out; My plate was boiling hot and the cheese from the enchilada was hard and stuck to the entire plate. The \"soup\" was something that reminded me of cafeteria food that I would see on prison t.v shows. My guest got a chicken salad and only took a few bites because it was disgusting. (Her chicken looked & tasted like it was from a microwave)\n\nThe only upside to this visit was that we were able to pay at the kiosk at our table and bolt out of there.\n\n0/5 for me.", "name": "Chili's", "rating": 1}, {"index": 47, "review": "I found this restaurant to be clean and has a nice ambience. I really liked their menu which is a good mix of healthy as well as greasy options. Their menu is concise which I really loved. \n\nWe ordered the Tex mex chicken salad and chicken quesadilla and they both were yummy. The salad was fresh and flavorful. The servers were attentive and helpful and the service was fast. \n\nMy only complain was that the chicken nugget I ordered for my kid was too salty and has to ask for a replacement which the sever handled very nicely.\n\nOverall a great experience and will be returning for my Mexican meals :)", "name": "Chili's", "rating": 4}, {"index": 48, "review": "Really good food. Staff was friendly and attentive especially for how busy it was on the Friday night my friends and I came in for dinner and drinks. Will definitely be back!", "name": "Chili's", "rating": 5}, {"index": 49, "review": "I ate here around 3 in the afternoon when it was pretty empty.  Chili's had a 3 for $10 offer which included a small salad, a burger and fries, and a mini molten dessert. \n\nMy server was decent at first, although de didn't seem to be in the mood for working (or for a good tip). After finishing my burger, he cleared my table and asked me if I knew how to use the ziosk to pay. I told him I did and he left. I didn't see him around for another 20 minutes. Finally, he walked by, so I asked him if the offer was supposed to include dessert.  He said \"yeah, it'll be right out\".  Although I was polite and never spoke angrily or upset, I finally got the dessert after 15 more minutes with no kind of apology for the wait. \n\nI don't mind if a server forgets something but at least admit it and apologize.  $10 was a good deal for the food but I have to agree with the other reviewers that management here must be terrible. Aside from the bad service, the place was dirty even though it was nearly empty at the time.", "name": "Chili's", "rating": 1}, {"index": 50, "review": "So, we get our seats and then after a long while we get a waiter, we'll call him dipshit (didn't get his actual name). He takes our drink orders, it was real hard, 3 cokes and a round of water. We get those after about 10 minutes of waiting. Then he takes our order and misenters 2 of the 8 orders into the system. We are all thirsty and pound those cokes and water. Dipshit had to be waved down to get refills as he never came around.\n\nPlace is not that busy at this time either.\n\nSo they have our food orders now and then about 20 minutes later our food comes out with our AWESOME new waitress (Alyssa, who deserves to work at a better place than Chili's as she is very attentive and extremely customer service oriented). Tipped her directly, and well. \n\nBut wait, where did dipshit go? Oh, he is off-shift now. Usually wait staff will come to a table and introduce the new person who will be handling their table when they go offshift or go on break. Dipshit didnt do this. Annoying.\n\nFood was like any other Chili's. Seems that Chili's corp is starting to ration the portions of the sides for the fajitas. About 2 table spoons of sour cream, guac and salsa.", "name": "Chili's", "rating": 2}, {"index": 51, "review": "This restaurant is awesome! My favorite Margarita and Baby back ribs is always great. Love to chill out every Friday night. I enjoy the energy and the friendly waiters.", "name": "Chili's", "rating": 4}, {"index": 52, "review": "Since BJ's was packed due to the Warriors playoff game, we headed to Chili's where there was no wait. Haven't been to a Chili's in so long, and my friend and I were happy to see that they had a 2 for $20 deal. We got chips with guacamole and salsa for our appetizer, and those chips are dang addicting. Paper thin and crispy, just wish the guacamole was fresher. We both got the bacon cheeseburger with fries, and it was pretty good! Our waitress was training, but she was really friendly and accomodating. I got the blueberry/pineapple margarita, and it was pretty sweet and huge! You can also pay for the food with the little tablet at the table which makes everything easy and quick. For the price, had a good dinner.", "name": "Chili's", "rating": 3}, {"index": 53, "review": "Dropped a star for today's visit because service was extremely slow from the beginning to the end. My friends and I we're there for about two hours. Time flew by because we we're all talking but we still noticed how long it took for everything to arrive. Took about 30 minutes for the beers.\n\nOur server was nice though and our food was delicious as always. I love chilis and I come here all the time. \n\nI decided to order something new and tried the Cajun chicken pasta - WOW!! That was sooooooo good!! Did not expect it to be THAT good! I really recommend that dish.", "name": "Chili's", "rating": 3}, {"index": 54, "review": "If the food was better I'd give it five stars the only reason I give it four cuz the hottie that tends the bar area every Sunday is a really good server. Haha sorry he's actually really fast and super sweet my cup is never empty don't lose that guy he's awesome", "name": "Chili's", "rating": 4}, {"index": 55, "review": "Good food, great drinks, lousy service. Half their tables are empty but they tell you you have a 20 to 30 minutes. Then they take your order strongly and they blame you. There are better places to go to have a good time.", "name": "Chili's", "rating": 1}, {"index": 56, "review": "So many people are down on Chili's. They think they are too good for it especially in the world of snobbery and high class of yelp. Not me! I love Chili's. Don't get me wrong, it's not fine dining or anything close to that, but they do have awesome drinks and one of the best burgers. \n\nYes, you heard me right, one of the best burgers. Oh, their mushroom burger is to die for. To be fair that's all I ever get here, because it's that good, so I can't really say much about the rest of their menu. I'm sure they have plenty of delights and treats for everyone, but this is all I need from this place. It makes my mouth water just thinking about it. Mmm. \n\nService is pretty typical. They try to rush and push you out the door, but you're not really coming here to feel intimate and special. You're coming here to chow down! If you consider Chili's a place where you can feel romantic and special, then I'm not sure what you're doing on yelp. \n\nThis is the closest location to me, so when I do Chili's, this is the one for me!", "name": "Chili's", "rating": 4}, {"index": 57, "review": "Honestly I only give 1 star to the waitress that helped us.  She was very nice but you can tell when it came to doing more she got very nervous and sort of ignored us for 45min.  But that's not what this review is about.  FUCKING MANAGEMENT!!! Let me put it out there that it was a give back to the school night or whatever.  They must have had at least 6 servers helping a table of 10 and not one of those waiters even asked if everything was ok on our end.  So when I finally was just disappointed with all the service I asked for the manager who I thought was going to be the last line of hope (SIKE) \nMy pasta was almost dry and they brought me some half ass chicken crispers on a plate with fries, my wife orders honey-chipotle and got buffalo instead.  So when the so called manager came over and we explained the horrible service only thing she dude was bring 4 little ass wings and offered me fucking Alfredo sauce for my pasta that I was no longer going to eat regardless of what she brought me.  after we sent her away we just walked out without paying for anything...  please update you management chilis.", "name": "Chili's", "rating": 1}, {"index": 58, "review": "Chills was super bomb the other night! Some of the best chips I've had rivaled only by Chevys! We started with a queso dip and their chips n salsa. For drinks, we went with two margaritas and my gf's bro got a strawberry lemonade, as well as a round of waters for the table.\n\n  I ordered the Southern Smokehouse Burger with no pickles (pickles are hella gross!!!), my lady got a Boneless buffalo Chicken salad, and her bro got the Cajun Chicken Pasta. Food came out maybe 15 - 20 mins after we ordered.\n\nI throughly enjoyed the burger even though I forgot to ask for Medium Rare (they do medium-well as default) but it was still juicy and very flavorful. Bacon was crispy and thick and the onion rings were very good atop the burger.\n\nThe Buffalo Salad was gigantic so my lady ate what she could and then took it home with her for lunch the next day. For her brother's dish, (\nwhich I always call \"adult Mac n cheese\"....ya know chicken Alfredo...) was also a large portion which needed to be taken home for a post meal snack or lunch.\n\nFood was good, service was not 5 stars since we had to ask for more chips and a refill on the lemonade, however it was generally a positive experience. Did not visit the bathroom which is usually a good way to test the cleanliness of a restaurant, but I'd recommend for a date night or a large party.  \n\nPlenty of TVs to watch sports and a decent size bar area for happy hour. The one big draw back is that the entry to the restaurant is on the street side of Coleman, quite a walk from the large parking lot.", "name": "Chili's", "rating": 4}, {"index": 59, "review": "Dearly beloved, we are here to celebrate the death of Chilli's Eastridge San Jose. Once a thriving restaurant many years ago who had good food has met its fate.   This Chilli's is survived by some really great servers who work their best. A dirty floor and uncooked food has finally taken its toll on this restaurant. May it rest in peace. \n\nThere still may be a glimmer of hope. If the manager will fight for this restaurant or find a new one to make sure pride comes back to this place.", "name": "Chili's", "rating": 1}, {"index": 60, "review": "Sorry but you need to hire someone else besides the portly man at the front.  He's always rude whenever I go in.  Also tried to order via phone and was put on hold for 20 mins so just hung up. Ordered online and have been waiting 15 mins so far for my order...thought the whole point was efficiency.  There are 5 other people waiting here with me", "name": "Chili's", "rating": 2}, {"index": 61, "review": "I remember being a kid in the 80's and thinking Chili's was a fancy restaurant. As I grew up, I quickly realized that the food was seriously sub-par. So for most of my adult life, I've stayed away from Chili's. Then one desperate rainy night, the 1 hour wait at the BJ's Brewery in the same plaza drove us through the doors of Chili's instead. The restaurant was quite busy, but there was no wait. Still with the mentality that we were going to overpay for frozen, microwaved, or fried food - we reluctantly ordered steak, fajitas, ribs, and chicken crispers. All those dishes are considered the restaurant's staples and part of what made Chili's famous. To our shock, everything we ate was actually good. The food came out hot and fresh. The pricing is still very reasonable and they offer specials all the time, like a 2 for $20 deal. The service was excellent and accommodating. I asked the manager if they could change the channel on one of the TV's to the Sharks game and he quickly did that for me.  Like a Phoenix rising from the ashes, Chili's has made its way back on to my list of respectable restaurants! I would definitely come back to THIS Chili's again - even if there was no wait at BJ's Brewery :).", "name": "Chili's", "rating": 3}, {"index": 62, "review": "Like the Chilis food as long time fan but service here isn't so great but convenient when in town for meetings and within our company budget.", "name": "Chili's", "rating": 2}, {"index": 63, "review": "My girlfriend ordered food to go. And the chicken crispers we very undercooked. We called and the lady that answered the phone only replied with, \"is that all?\" Really, you give someone potentially dangerous food and that's your response? \n\nWe finally talked to the manager. He wanted us to bring the food back. Really dude? Since I'm puking my guts out. And not that I want more food from your establishment. \n\nDo yourself a favor. Do not eat here. Just don't.", "name": "Chili's", "rating": 1}, {"index": 64, "review": "Sat down and all the staff just walks by me and looks. They see I'm dissapointed and just walk by. Ticket time is outrageous. Took the server a very long time to approach us and we're on almost an hour to get our food. Fail. Keep it moving. About to walk out if I dint get my food soon... we'll see...", "name": "Chili's", "rating": 1}, {"index": 65, "review": "Since I haven't been to Chili's in awhile, I was surprised to see these miniature iPads on the tables where you could place orders and also use to swipe your card to pay for your bill.  It bothered me a bit because one of the biggest reasons I come to a restaurant is for the service.  If I wanted to order from an iPad, then I could just do take out from home.\n\nI ended up ordering a Steak salad which I can't find online for whatever reason.  But, the steak was brought out sizzling on one of those mini iron skillets.   It not only smelled really good but it tasted great too.  \n\nNot sure how \"healthy\" this salad was and I think I'll pass on checking the actual calorie count online.  I'll just feel good that I had my greens and proteins and call it a day.", "name": "Chili's", "rating": 4}, {"index": 66, "review": "WARNING WARNING WARNING WARNING WARNING\n\n\nOmg WTF we order many plates after dinner we gt coffee and Tea . \n\nWell everything was perfect until we got two DISGUSTING USE SPOONS with chocolate FOR OUR HOT BEVERAGE .... my boyfriend didn't notice until he luck it.  I can't believe they give us dirty spoons. Who Fu.....n knows who use this spoons . Homeless? Sick person Ebola patient, HIV  sick person?? Who who who ? is the question....  Be aware of your utensils this is far one of the most grouse experience......\n\nThe waiter said ahhhh sorry... Sorry my ass hopefully there's no next time if I'm or any of us get sick promise I will sue this place GRRRRRRRGRRR\nGRRRRRR DISGUSTING", "name": "Chili's", "rating": 1}, {"index": 67, "review": "Dirty Spoons, tables were not that clean. Ordered Blue Moon draft beer, and it was pathetic. There was no fizz in it.", "name": "Chili's", "rating": 1}, {"index": 68, "review": "Went to Chilis tonight for dinner. It was good until our waiter disappeared for 30+ minutes after we asked for water. We had asked another waitress if she can look for our waiter because we were thirsty. He came back and asked us how he can help us...with no water smh. It's no wonder it's 2.5 stars. It's definitely not the food, it's the service that sucks.", "name": "Chili's", "rating": 1}, {"index": 69, "review": "Came by for lunch the other day. Parking was tight in front of the restaurant but was plentiful closer to Target. There was no wait slightly before noon. The host reminded me of the waiter from Office Space, cordial guy.\n\nMegan was our waitress and she was okay... she forgot to refill our waters until we were almost done with our meal!\n\nStarted off with the chips and salsa. Portions were huge and some of the chips were oily although very thin. The salsa was good but the guacamole was cold?!?\n\nMoved on to the crispers and they were surprisingly okay. They were rather oily straight out of the fryer. Both the french fries and corn on the cob were decent too.\n\nFor $20, we were able to get 2 entrees and an appetizer...definitely good value for a chain restaurant.", "name": "Chili's", "rating": 3}, {"index": 70, "review": "Went in for a girl's night out on a Wednesday parking lot's were all packed drove aimlessly through and through finally a parking \n\nWalked in through bar area found table immediately \n\nWaited waited waited usually I like to wait a few as we get settled as us girl's do\n\n15 minutes later little dude comes over uhhh hey ladies is there anything I can start you off with\nUh huh uhhh Duh\n\nGood thing we made happy hour for drinks \nEven \nTho\nWe\nWanted food by The time he came strolling back he said we couldn't order food for happy hour missed it as he was figuring out what his next step was\nGrrr.\n\nSo we settled for drinks untill we couldn't handle our stomach growling \nHad my favorite chicken crispers \nFries were cold and hard\nCorn was bomb\nChicken pieces hella hard and like ugh idk changed the chicken they used\n\n\nService sux\nFood is way different what did y'all do\n\n\nBar tender and  drinks ALways on point\n\n\nMy whole experience was mediocre \nToo bad we didn't get the other waiter \nWell grommed fast friendly and organized with time management \n\nHe was ball's to the wall \n\n\n\nSee ya chillies", "name": "Chili's", "rating": 2}, {"index": 71, "review": "Came here with family for a nice, relaxing dinner after a busy day in SF. We originally wanted to go to BJ's, but it was packed, and this place was surprisingly empty. \nNow, I don't usually like to review chain restaurants but I do want to make a few points here.\nFirst of all, that guy at the front was kind of weird. Since my brother and I are both kids, and my family wanted to watch the game, we asked if we could sit at the bar. The guy said maybe, but \"it was not recommended\"...(whatever that meant...).\nOnion rings are decent. Fajitas are really good, albeit a little on the greasy side. Flour tortillas were curiously \"crispy\", and the the cheese on the fajita topping boat seemed pre-shredded like I get at the store. \nOverall, it was about what I expected. Staff was nice (for the most part), and our service was good, but the restaurant seemed understaffed. It was an OK experience, but they are definitely cutting some corners here. It was just fine for a Chilli's, but not as amazing as it seemed when it first opened.", "name": "Chili's", "rating": 3}, {"index": 72, "review": "My family, a party of 7, stood at the hostess table waiting for at least 5 minutes. The waiters looked at us and then looked away. No one came up. No one said it will be a few minutes. This is unacceptable. It wasn't like the restaurant was packed to begin with. Don't come here unless you like restaurants with no customer service. We went to BJ's across the plaza and was greeted the moment we walked in. I rather spend my money here and elsewhere. PS: I had to give one star to post but really, it should be no stars.", "name": "Chili's", "rating": 1}, {"index": 73, "review": "Lauren was an absolute delight. She was both courteous and attentive. She made sure our drinks stayed filled and made sure we were enjoying our meal without being overall annoying and constantly checking on us. She ensured we had napkins and the essentials. She was the greatest!! Thanks for the awesome hospitality Lauren you rock!", "name": "Chili's", "rating": 5}, {"index": 74, "review": "I ordered a cup of chili and a southern smokehouse burger. Both tasted ok, but my burger's wheat bun completely fell apart after 2 bites. I had to resort to eating my burger with a fork and knife. My burger did not come with fries, and I hadn't even noticed until after I paid. \n\nMy friend had the southwestern mac and cheese. I tried a little and it was incredibly cheesy. At least her burger came with fries. \n\nService was ok, but what happened to my fries?", "name": "Chili's", "rating": 2}, {"index": 75, "review": "Martin, the manager was dope AF. Came out and made sure everything was good. His customer service was off the charts. He knows how to treat his customers. They need to give him some credit for everything. Out server Ashley also did a fantastic job on checking up on us and making sure we were good. Overall, great customer service. Keep it up guys", "name": "Chili's", "rating": 5}, {"index": 76, "review": "I ordered  lunch for delivery to my job. The delivery was on time and the food was good. I had loaded baked potato soup, beef jalapeno soup, and seared prawn with pineapple salad.", "name": "Chili's", "rating": 4}, {"index": 77, "review": "This Chili's is much like every other Chili's. The food was exactly as expected, but service was really, really slow. They have these little tablet things where you can order dessert from your table tablet, which was nice, and it was nice to be able to pay from that. \n\nComing in, we checked in and said we would wait at the bar. The bartender was awesome and made great drinks with friendly chit-chat, but the from desk area didn't let us know our table was ready. We checked in with her after about 20 minutes to find out if they forgot about us, and they had. She let us know it would be a few more minutes since they gave our table away. Ten minutes later we went back up and it seemed she had forgotten us again, but took us to be seated after a few more minutes. This was the only hiccup for this location. There was hardly anyone there, so there really was no excuse for missing us for 30 minutes when other people were seated in 5. \n\nOur server was pretty quick, but seemed to be handling all the tables in the whole place, so that slowed him down a bit. \n\nLike I said, food was as expected, so this place was still okay. We might be back to give them another shot at service and speediness. Or we might just sit at the bar and get quick friendly service!", "name": "Chili's", "rating": 3}, {"index": 78, "review": "Full Disclosure: One of our best friends is the manager here so this review is slightly biased. BUT, we have come here more than once when he isn't there and still had a great experience.\n\nPS: we haven't been in the main seating area or when it's slammed for dinner, so this review is for happy hour time (4-8pm) in the bar only. We've gone enough times now that it merits a review.   \n\nI'll be honest, Chili's isn't a place I would typically go. We started going to this location because of our friend (having only been once before to this location) but we haven't been let down yet. Plus it's a 3 minute drive from our office which is convenient. The service is always great and the food is delicious. They have really expanded their menu, adding a lot of healthy options.  My absolute favorite part? SKINNYRITAS! I have dreams of these. They are 110 calories of pure deliciousness. They use fresh lime juice instead of margarita mix, and top shelf tequila.  I am not a tequila or margarita drinker by any means, but these are so yummy and refreshing, it's worth the trip to come just for these! \n\nAnother fun addition is the \"Ziosk\" tablets at each table. They look like little mini iPads, where you can place drink or dessert orders, and pay your bill when leaving.  You can't yet order entrees but that's fine. Once you place your first drink order with the server, you can go in yourself and order more of the same, or different drinks on the Ziosk. It really gets the Skinnyritas flowing! It's nice to be able to pay and leave without having to wait for your server to return. Super cool techie addition. There are also games on it, which are probably cool if you have children in your party. \n\nWe always sit in the bar area, which has a lot of TV's to watch games. We do wish the TV's were bigger, but otherwise it's a great bar area to watch sports.\n\nOverall we love coming here for a casual dinner night (and 1 or 10 Skinnyritas).  Say hello to Jesus the manager if you go, he'll treat you like family!", "name": "Chili's", "rating": 4}, {"index": 79, "review": "We walk in the hostess is super nice and friendly! Once we sat down we were greeted right away. The venue is very casual and laid back. They have super awesome deals. I chose the 2 dinners for $20. Usually I am a BJs fan. For my roommates birthday we chose something more casual and also I have never been to chilis. The food is very tasty and affordable. We started offering 3 different appetizers. Unlimited chips and salsa which was a bad thing because it filled us up before our entrees! Also the fried pickles and chili cheese fries. Everything was delicious. For entree I had Cajun pasta. They were very generous on their chicken portion. The service from Austin was spectacular! Will diff entitled visit this location again! Although BJs is still very delicious. Chilis competes because their prices are very good for some good food. Thanks!", "name": "Chili's", "rating": 4}, {"index": 80, "review": "The service was OK and the Decour nice but the food was horrible!  Not fresh at all. Tasted like microwave packaged items!  Hopefully these reviews are read and the chef can visit sister branch in Mountain View where they're actually doing the menu right. The food on Coleman was too salty I got the buffalo wings they tasted like they came out of the microwave and had sauce poured over them then sprinkled with salt. I also got the chicken pasta that again was drenched in salt.  I almost gave the restaurant two stars but unknowingly my son ate here tonight as well with a separate party and when I got home he was complaining about how horrible the food was.he always orders the mini sliders which are excellent at the Mountain View branch. But he said they were clumped together and didn't even come with the regular onion rings.", "name": "Chili's", "rating": 1}, {"index": 81, "review": "Coleman Street: service was unacceptable. Had to ask for drinks. Fajita sides never came. They had a complete miscommunication with their staff and would do nothing to remediate. Our waiter was swamped while others stood around just chit chatting. Poorly managed and the food doesn't make up for it for sure. Only benefit is kids like it but I'll try not to come back. So many options why come here?", "name": "Chili's", "rating": 1}, {"index": 82, "review": "happy mothers day to me from my daughter jamie! was the best mothers day ever! the 10.99 specail you dont know what your missing my gosh the ribs were so yummy! i want more.my birthday is the 16th.the ribs so meaty and tender and the corn on the cob best i ever had..perfect.the salad was just right not to much.the desert was off the hook fresh out the over melt in your mouth good.i give it 5 stars aawww no corn bread but one thing the lemonaid with strawberrys couldnt taste it.was puree.i think when my brother tolk me to the one on el camino they had real strawberrys.i was craveing oh well..it was very busy and the servers was patient and courtious is important.friendly and sweet i love that.they smile at you.makes you feel welcome.would definatly refer a friend highly recommended chilis is the best.miss chevys but chilis is just as good..", "name": "Chili's", "rating": 5}, {"index": 83, "review": "I am sorry but that wait time for our food was ridiculous. I know it is a sit down restaurant but waiting upwards of 25-30 minutes for two really simple dishes doesn't fly with me. I know that the world cup was on but that doesn't mean you get to spend your time watching the game while we patiently wait for our lunch. I was on my lunch break and came back late due to the poor service. \n\nBoo", "name": "Chili's", "rating": 2}, {"index": 84, "review": "Unfortunately I came here for a lunch date with the wife and kids and it was unorganized.  Food didn't come out for 45 minutes then had to wait another 15 minutes to talk to someone to verify cancelling of my order. Total waste", "name": "Chili's", "rating": 1}, {"index": 85, "review": "We had some pretty bad service when we were here last. It wasn't because of they were rude, the just forgot about us( and a few other tables)\nWe came here before a game.  The server was out with the drinks and chips quickly. After they took the order they took forever! Not only that but they completely forgot about one meal. When They brought our food they said they would run back to get the soup and salad. Next thing you know, the person is around bussing the tables. We caught her attention, our server came back just to tell us that they were all out of the potato soup. \nThe manager did take it off the bill\n\nI noticed this happened to at least three other tables. It almost seemed like one table did not pay at all and just walked up and left.\n\nReally bad experience here for sure!", "name": "Chili's", "rating": 1}, {"index": 86, "review": "This had to be one of the worst visits to chilis  we have experienced the service was terrible and the chips were terrible They had so much Grease they were transparent  we asked for the manager he came to the table and said let me take care of this 10 minutes later he still did not return I would give it zero stars but you have to give one star to post I would stay away from this Chili's because all the reviews seem to have the same problem with this Chili's  poor service and bad management it took them five minutes to seat a person of one The place was pretty empty for a Saturday night", "name": "Chili's", "rating": 1}, {"index": 87, "review": "Food is mediocre.  Service is mediocre but keep in mind this is not a 5 star restaurant so you get what you pay for. I got a dirty spoon for my tea still with a piece if chocolate brownie on it! Sooo gross! I put it in my mouth and then I realized. I was horrorized! \n2 stars for technology though...they have these new tablets where you can order for youself without needing to call your waiter. Each table has a tablet and you can also play games while you wait for your food.", "name": "Chili's", "rating": 2}, {"index": 88, "review": "For today's visit. Haven't been here since I've moved back until today and this rating is solely based on today's visit. 30 minute wait which isn't so bad. We waited for 15 minutes until someone came to even greet us! When we finally received our drinks it took forever for our waitress to come check on us, so I could ask for a refill! Then the wait for our food, don't even get me started! Sitting here waiting for over 30 minutes. This place has definitely gone DOWN HILL!", "name": "Chili's", "rating": 2}, {"index": 89, "review": "As opposed to popular belief, I actually didn't have such a terrible time here. It didn't blow me away, but it barely made my expectations. Maybe because my expectations were so low.\n\nI came here with a few coworkers for lunch and we decided to grab a drink and some food at the bar. There wasn't a wait so we were already off to a good start. The bartender greeted us right away. He was a little busy and snippy, but he wasn't that bad.\n\nI wasn't super hungry so I ordered a Chipotle Chicken Fresh Mex Bowl from the lunch combos. It was only 7 bucks so it was a pretty good deal. It was a pretty good amount, a little on the bland side though. Overall, nothing too special about this place. I probably came on a slow good day because I have come on other occasions and I have had the worst time. This time I got lucky.", "name": "Chili's", "rating": 3}, {"index": 90, "review": "It's reasonable.  The fajitas are good, several items are good, not great though.  Decent margaritas.  The kids always like it.  Table side guacamole is a favorite.\n\nPrime rib tacos have exactly zero prime rib meat, it was more like brisket.  Disappointed with that.", "name": "Chili's", "rating": 2}, {"index": 91, "review": "Came in with my son and loved the kids menu. A lot of common picky kid food. He made his own order. \nThey have tablets at every table so he could play games as we waited. \nService was prompt and friendly I was impressed all around. \nThe food isn't anything more than you might expect however it was all spot on so I will be back again.", "name": "Chili's", "rating": 5}, {"index": 92, "review": "I love this place for every reason it's close to every thing and the FOOD it's Amazing and I love the excellent staff specially in the Bar area. \nWe normally go for birthdays, anniversary and more we always try to go for any reason!", "name": "Chili's", "rating": 5}, {"index": 93, "review": "Pretty much like any other Chili's---\n\nGREAT tortilla chips!\nSUPER honey chipotle chicken crispers\nTO DIE FOR cheesecake\n\nand....\n\nSTRANGE murky iced tea\nLOOOOOOOOOOOOOOOOOOOOOOOONG wait times\n\nBut we'd go again if we were in town and needed something predictable!", "name": "Chili's", "rating": 4}, {"index": 94, "review": "The food here generally makes me feel sick.  Most things are fried or too salty. The drinks have the aftertaste of bad water.", "name": "Chili's", "rating": 1}, {"index": 95, "review": "5 stars for the incredibly sweet hostess, Maria! She is a sweetheart, and a true asset to this restaurant! I hope they are treating her well!!!\n\nThe food was good, standard for a Chili's restaurant. The only downside was the super long wait :( We were seated right away since the restaurant was pretty slow, and we were warned it would take a while to order because there weren't many servers, so that was our fault for choosing to sit in the booth area! I think it took about 15 minutes for us to place our order, another 10 minutes for our first appetizer, then another 20-30 minutes for our food. The workers are very friendly, though! The -2 stars is simply an attention to the management to hopefully take notice of the need for more workers possibly, or rearranging the schedules to accommodate the wait time for customers. Good luck, Chili's!", "name": "Chili's", "rating": 3}, {"index": 96, "review": "the world according to noelle, 2013\n\n-----------------------\nthe quick details\n-----------------------\ncuisine:american food\nparking: parking lot\nprice: good\ngood eats: good\ncustomer service: friendly, ask for rick he's a great waiter\nrestrooms: yes \nfamily friendly: yes\nnoelle's favorites: chicken crispers\n\n-----------------------\nmy experience \n----------------------\n\nCame here for a late lunch with my husband. I've been coming to this Chili's since it first opened. They have consistently good food and customer service. The only drawback is the parking, it's very difficult to find a parking spot in this shopping center sometimes it takes ten minutes just to find a spot that's not even close to the restaurant (so be forewarned). \n\nOur waiter was Rick. He was awesome providing excellent customer service and our drinks were always refilled. \n\nOur order: Chicken Crispers and Chicken Bacon Quesadilla . \n\nI had the Chicken Crispers which are my absolute favorite thing to order at Chilis which is boneless chicken in a beer batter sauce fried to perfection served up with fries, sweet corn on the cob and per my request blue cheese dipping sauce (it normally comes with honey mustard). My husband had the Chicken Bacon Quesadilla which he liked, that was made of chicken, bacon, onion, green bell peppers and pepper jack cheese - I had a bite and it was definitely tasty.\n\n\nFrom time to time Chili's has specials, the current special located on the last page of the menu is 2 for $20, which consists of one appetizer and two regular size entrees which is a good deal and something we will consider in the future.\n\nChili's Grill & Bar serves up delicious simple American and Tex Mex cuisine. One of my favorites is the spinach and artichoke dip. Do note they have an updated bar menu with pizza and pretzels. This is a good restaurant that is family friendly.", "name": "Chili's", "rating": 4}, {"index": 97, "review": "Nothing ticks me off more than a long ass wait for my food. Chili's is not our first choice for dinner but we came here cuz we had a gift card so free dinner why not? We were a bit hesitant about dining in because we don't like long waits and what if our baby becomes fussy it would be stressful. We didn't wait too long for a table maybe 5-10 minutes. We got seated and I skipped the appetizer cuz I wasn't hungry and ordered something small, the crispy chicken tacos. Funny the waitress made it seem like the chips and salsa was free by asking us if we wanted anything to get started. So misleading. Good thing I double checked and asked and she said no lmao. I saw a lot of people get chips too I wonder if they knew lmao. Anyways the wait for the food was excruciating and long. While waiting I was regretting picking this place for dinner. Part of me had the feeling it would be long too. We should have went somewhere quick where we're in and out. But then again I didn't want to pay for dinner and rather have the gift card pay for my dinner. Anyways so I got the crispy chicken taco trio and my hubby got the steak, shrimp and pork combo thingy. Food was okay. It's like Applebee's and such. Nothing extraordinary. I initially wanted the enchiladas but wasn't hungry but since the wait was SO long I ended up being hungry! So overall it was the long ass wait for the food that made my dinner not enjoyable. I came in not hungry and ended up being super hungry because that's how long the wait for the food was...I swear they eitherforgot about us...or the waitress didn't put in the order....or they simply don't care about how long their customers wait.", "name": "Chili's", "rating": 1}, {"index": 98, "review": "This review is only for their lunch specials. I came here for lunch with my co-workers on a Friday afternoon to try out their lunch specials. \n\nLunch combos start at $6. For $7.09, you could order the bottomless lunch express and get unlimited soup, salad, chips, and salsa. There were other lunch combinations for $7, $8, or $10.. not bad for the amount of food you get. I ordered one of the $7 combos - started off with a house salad and chose the Margherita half flatbread. \n\nOverall, the food was decent and you get your bang for your buck. The service could have been better, especially since the restaurant wasn't packed. \n\n-------------------------------------\n\nAll lunch specials start off with your choice of:\n* House Salad\n* Bowl of Chili\n* Chicken Enchilada Soup\n* Southwest Chicken Soup\n* Loaded Baked Potato Soup\n\nThen, pick your favorite:\n$6 Combos\n* 6-inch Pizza - Five Cheese or Pepperoni\n* Southwestern BLT Toasted Sandwich on a toasted pretzel roll.\n* Classic Turkey Toasted Sandwich\n\n$7 Combos\n* NEW Fresh Mex Bowls - Choose Margarita or Chipotle Chicken†\n* Quesadillas - New Santa Fe Chicken or Bacon Ranch Chicken\n* Half Flatbread - Choose Margherita† or Chipotle Chicken†\n* Big Mouth® Burger Bites [2]\n\n$8 Combos\n* Bacon Avocado Chicken Sandwich\n* California Turkey Club Toasted Sandwich", "name": "Chili's", "rating": 3}, {"index": 99, "review": "This place is absolutely terrible.  If you want to ruin your Friday dinner....come to Chilis..if you want to make it unforgettably awful...come to this location.  \n\nThe service and food and margs were so bad, I made a yelp to write about them.  \n\nThe smell of this place makes me sick to my stomach, I feel disgusting.\n\nAlso, waiter with superman earrings....sorry to \"overwhelm\" you by asking for water, didn't think that was out of your job description.  \n\nWe were here for my buddy's birthday...I requested a cake and song...none ever came for my friend. \n\nThanks.  Do not come here.", "name": "Chili's", "rating": 1}, {"index": 100, "review": "It's Chili's. Sit in the bar, ask for Rick. \n\nLike:\n- queso chips and salsa \n- chili glazed sweet and spicy chicken with broccoli and rice\n- coronita margarita\n\nIt's ok. A great place if it's 100 degrees out and you're seeking air conditioning and a margarita.", "name": "Chili's", "rating": 3}, {"index": 101, "review": "well, we did go back...we were given a gift card for christmas...sigh. But I think it's safe to say we are done with this chili's now. \n\nThe kitchen seemed to be having issues again, this time the wait for the food was ridiculous, and the cheese was moldy. when I pointed that out to the server she went to go get me some fresh, and while she was gone the manager (at least, I think he was the manager) came over and asked what was wrong I told him and he also went to go get me fresh, he came back before our server did, with un-moldy cheese, and then tried to tell me sometimes the pepper jack gets mixed in with the jack and it probably wasn't mold, but pepper. (and you know even if that was true, every single piece of cheese having specks of black fuzz was \"pepper\" then this was not a case of a little getting mixed in, it was a case of the kitchen giving the wrong cheese altogether, but since I've never seen fuzzy pepper before...)\n\nthen after he left the server came back with ANOTHER plate... with more moldy cheese on it.\n\nSo yah, we're done with chili's, and this makes me very sad cause we used to really like the food here.", "name": "Chili's", "rating": 1}, {"index": 102, "review": "I enjoyed my experience here. Came for my birthday and of course the staff were great and sang me that dumb song but I appreciated the gesture. The food was to my standards. On another separate occasion, I had a good bar experience.  Pretty solid franchise restaurant.", "name": "Chili's", "rating": 4}, {"index": 103, "review": "Yay for new jumbo pretzels that they now serve but double sadness for no longer serving milkshakes!!! \n\nPS- on your birthday, you get a free scoop of ice cream", "name": "Chili's", "rating": 3}, {"index": 104, "review": "This place is pretty dang good! I haven't ate at Chili's in a long time, and today, from the waiter to the food everything was perfect. My bf and I ordered the southwestern eggrolls as appetizers, I chose fajitas which came with chili bean soup and my bf chose chicken soup with enchiladas. Yuuuuuum.\n\nThe waiter was really nice and cool. He occasionally asked us if we needed anything. We really did not feel left out in there. There are plenty of tv's around the place, so it'll be a definite go to for a game.\n\nAll in all, we would really come back. Thanks to my coworker who gave me a gift card to this place. Woot!", "name": "Chili's", "rating": 4}, {"index": 105, "review": "This location does not answer their phones for inquiries or phone order.", "name": "Chili's", "rating": 1}, {"index": 106, "review": "stood in the lobby for 5 minutes an no one looked at us....horrible customer service!!!", "name": "Chili's", "rating": 1}, {"index": 107, "review": "Food and Service was OK. Not much to say, just like any other Chili's.", "name": "Chili's", "rating": 3}, {"index": 108, "review": "I am generally loath to eat, let alone review, chains. That said, I will on occasion eat (more often drink) at Chili's or Fridays. Usually when I'm with someone and we want something quick and simple.\n\nIn this case, I just wanted to watch the Heat game.\n\nI had just moved into my place, and didn't have cable or internet yet, so I went with the closest place that I knew would have TVs - Chili's. As people have mentioned, parking is atrocious, and for some reason this Thursday the place was packed. Maybe it was the Heat game, maybe the Giants game. Maybe all the Freshman moving in. Whatever it was, the wait was 15 minutes, and the bar area was packed.\n\nEventually got my table, got a Sierra Nevada (I will say having that on draft isn't too bad), and spent more time watching the game then looking at the menu. Fortunately my waitress was incredibly patient and nice, and thus the three stars. At halftime I got the boring triple dippers and instantly regretted it.\n\ni won't even bother reviewing the food. Its mass produced, reheated generic stuff. But my waitress was really nice, and we talked basketball when she came over to my area.", "name": "Chili's", "rating": 3}, {"index": 109, "review": "If I could give a zero star I would . First me and my best friend walk in and no host . we waited about 7 minutes just for her to come and put our name on the waiting list . the amount of attitude I got when I asked her to put my name on the list or be seated she gave me a smart remark and then rolled her eyes and said on very loud what's ur name I tell her my name , she proceed to still give me attitude then I turn to her say please go get your manger ,because I don't like your attitude before walking away she said I DONT LIKE YOURS EITHER  . in my head I'm like are you serious how disrespectful . the manger comes and starts tell me he is not the actual manger ,but he's very sorry for her behavior . So we finally got seated then here comes the host again trying to get us drinks bit still very rude . we tell her we don't want anything we will wait for the actual waiter but then she comes with more attitude , we finally after she is hovering over us and won't leave us alone , we get the manger . we said we don't want her serving us we don't want her near our food scared she may mess with it or spit in it . the manger started to say that I was having attitude with him .I FLAT OUT TOLD HIM YOUR EMPLOYEE IS  HARASSING US HOW DARE YOU SAY ANYTHING TO ME YOU NEED TO CORRECT YOUR STAFF!! Needless to say this chilli's is horrible thee worst service I ever got I will never come back to this place I will never bring my family and all my friends will know to never come to this place !", "name": "Chili's", "rating": 1}, {"index": 110, "review": "I arrived about 10 minutes before my order was scheduled to pick up, they were just finishing. The gentleman who was putting my order together was very nice and said he had everything but the ice cream packed because he didn't want it to melt on me. Super helpful, and sociable. My only complaint had nothing to do with them but the people who were dining there they had 4 to go spaces all taken, I circled 3 or 4 times trying to find a spot when finally a to go order space opened up furthest from the building . When I got in there was no one else waiting on to go. Don't be jerks people take out spaces are for take out orders. (Also it was raining)", "name": "Chili's", "rating": 5}, {"index": 111, "review": "The service here was terrible. They forgot our order for a whole hour until I asked where my order was. The response was that the chefs thought they cooked our meal. To top it all off they tried to apologize by giving us a free soup or salad like that makes up for anything. The worst experience ever at a chili's. My burger was also greasier  then a toilet roll that fell in the toilet. They also got two drinks wrong. The chicken tenders were saltier than the ocean. The ribs were skinnier then mom butt. Straight disrespect and disgusting.", "name": "Chili's", "rating": 1}, {"index": 112, "review": "This was my second time in Chilli's and I went here last week on my friend's birthday  dinner. There was a 40 minute wait time.\n\nWe order couple of vegetarian dishes and non-vegetarian dishes but taste of vegetarian dishes was average. We asked them to fill bean in Quesadillas but they gave us beans in a bowl. Though, they replaced it when we asked them for it. Non-vegetarian dishes was little over average. Best item I ate there was Onion Rings ;)\n\nDrinks were nice specially Presidente Margarita.\n\nOverall experience was little over average.", "name": "Chili's", "rating": 3}, {"index": 113, "review": "I guess the only real negative aspect of this place would be its wait period (which can be prevented with a reservation beforehand). Food was really good, service was good plus they give crayons that's right.. Effin crayons and a badass drawing booklet about pillow dreams and what not to children (or adults of you ask really nice). \nIt is a family friendly place with on-table food ordering and paying system which adds a touch of ease to the dining experience. Overall a very pleasant experience.", "name": "Chili's", "rating": 4}, {"index": 114, "review": "The server was OK.  But, everything else was soooooooo bad.   It was early dinner time and still they sat us at a small table all the way in the back.  Had not been to Chilis since they closed the Cupertino restaurant.  Wait did I call it a restaurant?  The food was terrible!!  We used to get the fajitas a while back and tried them again.  What a bad idea, they were 1/2 the size and tasted terrible!!!   We will not be going back any time soon.", "name": "Chili's", "rating": 1}, {"index": 115, "review": "I've come here for numerous reason and have always enjoyed myself. On 1/16/2016 I reserved 2weeks in advance for a party for 25 and the day before I changed it 30 people. Day of the party more then 40+ people showed up and the manager and staff accommodated everyone of us. We were served rapidly nothing was cold or wrong. I'm not one to write many reviews but when I'm truly taken care of an establishment I need to let others know.", "name": "Chili's", "rating": 5}, {"index": 116, "review": "It's been awhile since I'd been to a Chilis since the one in our neighborhood closed so we were looking forward to some old favorites.  The recipes seem to have changed though, sad to say.  Our steak was grey and a poor cut of meat, and there was lots of skimp all around In the quality of the food.  The atmosphere was nice though and our server was 5 star.  I'd go back for a drink in the bar and an appetizer maybe, but that'll probably be it.", "name": "Chili's", "rating": 2}, {"index": 117, "review": "Worst service!! REGINA our waitress was horrible! She never came to ask us if we wanted anything or refills. Better yet sat there for about 10 minutes when we wanted desserts!! Do not go here or ask for a new waiter!!", "name": "Chili's", "rating": 1}, {"index": 118, "review": "It has been years since I'd been in a Chili's, and my friend and I stopped in for a burger fest on our break Sunday afternoon.\n\nOur waitress suggested the new Guacamole Burger, and I'm always happy to try something new.  After she took our order, she left off a questionnaire for me to fill out on the burger (this should have been a sign) and after she had walked away, I noticed that she didn't ask me how I wanted it cooked.  \n\nThe burger arrived by another runner, so I didn't see our waitress again.  The burger was pretty run of the mill, and the patty was burnt in places and medium in others.  \n\nThe manager came by the table to collect my questionaire, and asked me how I liked the burger.  I told him it was burnt on one side and that I would order something else next time.  I also told him that it was the first time I had ordered a burger in a restaurant and wasn't asked how I wanted it cooked.  He looked at me and just said, That's how we do it now.  \n\nThat's how we do it. now.\n\nA manager asks you how you like your meal.  You take the time to tell him it was sub par and he says that's how its done.\n\n....  right.   \n\ni don't think I need to explain what went from bad to worse in that experience...\n\nThere's a BJ's in walking distance, walk next-door and have a better experience.", "name": "Chili's", "rating": 2}, {"index": 119, "review": "This is pretty much the lowest-common denominator choice for food where my South Bay friends and I end up if it's late at night and we're in a group with lots of picky eaters. Sorry for such a short and vague review -- I mean the food's not terrible but if you've been to one Chili's you've been to them all, and this literally one of the last places I'd think to eat at if I was on my own in the area.", "name": "Chili's", "rating": 2}, {"index": 120, "review": "RUDE and UNBELIEVABLE! We came into lunch today at 1:00 and there was no one to greet us. Understandable it was lunch so that happens. But, what happened next pissed me off. First of all the podium is everyone's responsibility. We as patrons help you servers pay your bills! So, pay attention to the people coming. NOT 1 but 2 servers came and dropped menus right in front of me at the podium. I smiled. They looked down and completely ignore me as if I didn't give a rats ass who was there. Followed by the host breezing between us and not saying word straight to clean a table in the dining room. Staff ! It take 10 seconds to say \" Hi! Welcome . We'll be with you in a few minutes.\"", "name": "Chili's", "rating": 1}, {"index": 121, "review": "Went here a couple weeks ago on a Sunday (the 21st) during a Katey Perry concert at the nearby pavilion and the restaurant was so super busy! They were very understaffed and everything took a long time! \n\nThe only saving grace was our waiter who was very positive and maintained his composure. He still managed to check up on us once in a while and went the extra mile to wash our wine glasses himself so that we could get our drinks quicker. \n\nThe place is relatively clean and the menus were all wiped down.  The restaurant had a good vibe to it and the brownie and ice cream dessert was heavenly at the end of our meal\n\nWith that being said - 5 stars for the server, 1 star for management,  3 stars for cleanliness, 3 stars for the ambiance, and 4 stars for the food.", "name": "Chili's", "rating": 3}, {"index": 122, "review": "I want my baby back baby back baby back ribssss!\n\nMy usual Chili's spot is in Cupertino, but unfortunately that one closed down :( BOOO!! But it's okay since I moved to Berryessa... this Chili's is fairly close. Compared the the few Chili's that I have been to, this one is pretty big. I liked the layout of this place as well.\n\nSeated immediately, our server Lena, did the whole intro of, \"Can I start you off with a margarita.. or strawberry lemonade?\", which I thought was restaurant professional of her. And yes, my friends were sold on the Skinny Margarita (which they each ordered 2 of :P).\n\nWhat we ordered:\nSanta Fe Chicken Salad (Chile-rubbed grilled chicken with spicy Santa Fe sauce, house-made pico de gallo and ranch dressing. Topped with tortilla strips, cilantro and avocado) - This salad was HUGE. Ordered with both dressing on the side so it was a bit funky to eat it raw. Would highly recommend asking for double sites of the Santa Fe sauce... that was delicious! Doesn't feeling much like eating a salad when you have all those tortilla strips on in.. so 86 those strips if you wanna eat a bit healthier! Good salad all around.\nClub Quesadillas (Layers of grilled chicken, applewood smoked bacon, Fire-Grilled Corn Guacamole, sautéed onions, bell peppers, Monterey Jack cheese and ancho-ranch dressing. Served with sour cream and house-made pico de gallo) -These are DELICIOUS! a bit messy to eat, but delicious nonetheless! Could really taste all the ingredients jam-packed into the perfectly warm flour tortilla. Highly recommend! The pico it comes with isn't saucy enough, so I recommend asking a side of their HOUSE  salsa. \nSteak Fajitas (Green bell peppers with onions on skillet topped with slices of steak) - Can never go wrong with steak fajitas! Make your own taco/burrito, whatever you want to call it! Delicious! Just wish they added a little more meat.\nOreo Molten Cake - NEED I SAY MORE? Warm white and chocolate bread with oozing white chocolate in the middle topped with vanilla ice cream with a hard shell... OH MY GOODNESS.. felt so guilty eating this bad boy, but it was definitely worth EVERY BITE. MUST TRY!!!!!!!!!!!!!! YOU MUST NOT LEAVE CHILI'S WITHOUT TRYING THIS!!\n\nIn all I had a great experience at this Chili's. Food was delicious and affordable. Service was SPECTACULAR! Never did we once have to ask for refills or extra napkins. Had a really great time :)", "name": "Chili's", "rating": 4}, {"index": 123, "review": "Came here for a quick snack and beer to catch the end of the Warriors game. I was really happy with the nachos here, it was my first experience with \"chilis\" nachos. They were quite good !", "name": "Chili's", "rating": 4}, {"index": 124, "review": "I've been here many however my last experience was amazing. I came here around 9:30 pm with my boyfriend and we were sat right away. Our server was Mandy and she was so helpful and very sweet. I've never had bad service at this Chilis but Mandy went above and beyond. Thanks!\n\nBy the way the little computers that are on each table is such a cool idea. I really like that you can pay whenever you are ready.", "name": "Chili's", "rating": 5}, {"index": 125, "review": "Had a reservation for 20 for my husband and sons bdays Brooklyn was an amazing server she was great with everyone's orders very attentive and very polite. She defiantly sets the standard for service here. You never get good service with large parties but she was great.", "name": "Chili's", "rating": 5}, {"index": 126, "review": "I usually love chili's and they get me in with the promise of a free molten.  This has to have been the worst experience I have ever had at any chili's. We were being served by a trainee left alone. I didn't know this until the  desert was coming and the trainer came introduced himself and explained why our experience was so bad. \n\nThe food after our appetizers took around thirty minute and the food we waited that long for was disgusting. The fajita bell peppers and onions were so burnt that they literally turned to ash when you tried scooping them off the skillet and the chicken was cut in to four thick pieces that tasted burnt too.  Our steak that was ordered medium was well and we were brought no potatoes with it.  This was dropped off by our server who basically ran from the table after doing so. We spent the next few minutes looking for any employee who could bring us our fajita condiment tree thing that was not brought, our potatoes that aren't loaded anymore and some steak sauce. We decided to order desert ourselves in hopes that that would come out right. It came out in a timely fashion, but the molten that came out was the lamest excuse for a molten. The magic shell didn't even cover half of the ice cream and there was no chocolate on the plate like there usually is.  I will not be back to this chili's for sure and not so sure any if this is how they are now. \n\nDuring this whole time I did not see one manager anywhere I sight.", "name": "Chili's", "rating": 1}, {"index": 127, "review": "Since BJ's was so busy on a Tuesday night, Our party of eleven migrated to Chili's! I haven't had Chili's since seven years ago, so I was down to pay an old favorite spot a visit! \n\nWe were seated as soon as everyone in our party arrived. Starters were brought to our table and our server took our drink orders. After that she became less attentive to our table and forgot things here and there.... Our server's focus was clearly on the table next to us since her friends were sitting there. I can tell because she was gossiping with them and I sorta had to cut her off in order to get her attention and request for more guacamole. \n\nAnyway, the food was good, but the lack of service just reminded me of why I stopped going to restaurants like Chili's.", "name": "Chili's", "rating": 2}, {"index": 128, "review": "I wish I can rate this place with ZERO star! I ordered our dinners through EAT24 at 7:30 last night and the food did not delivered until 10:24 PM. The order literally took almost 3 hours?? REALLY?! The delivery service driver came with a passenger. Seriously? You're working. You do not need a passenger along for the ride. SO UNPROFESSIONAL. The restaurant was non-responsive and the driver was non-responsive when checking up status on our order. I ended up cancelling my order and when the driver showed up at our door, I told him to send the food back.\n\nThe service is HORRIBLE! What a TERRIBLE experience. I will never order from this place again. EAT24 customer care indicated this is not the first time Chilis did this. AWFUL! JUST AWFUL!", "name": "Chili's", "rating": 1}, {"index": 129, "review": "Some of the food is good, but other dishes I have found to be waaayy too salty. Especially the french fries and some of the rib platters. Service is very hit or miss as well. I've been told that it would be a ten minute wait before, only to have it be more like twenty. The wait time for your food is a joke most of the time. Even when it's not that crowded inside it still takes forever to get your food. You know it takes long when you have to start making up games to play using the items found on your table to keep yourself entertained. Average at best, three stars.", "name": "Chili's", "rating": 3}, {"index": 130, "review": "Have come here several times solo with up to 6 kids in tow. Loved this place because everyone could have a tablet to play with while I muted the pain with a cold beer. My wife loved it because I'd leave her at home kid free for an hour or two. Food was consistently average. Service was consistently below average. But we had fun competing against each other in trivia. \n\nThe place was always packed, but tonight we were seated promptly (sort of as the hostess seated the group that came in after us first) an empty restaurant. Now they only allow one tablet per table because the check is tied to it. And I have a table full of kids fighting over the only tablet. Won't be coming here again since we're forced to rate it on the food and service alone. On the bright side, maybe the kids will be reading  chaucer and I'll be enjoying good food and service the next time I give my wife a break.", "name": "Chili's", "rating": 1}, {"index": 131, "review": "Very slow when it comes to pick up order. . order is always not ready when I picked it up. its a bs", "name": "Chili's", "rating": 2}, {"index": 132, "review": "After a rather disappointing experience at another restaurant (Props in Watsonville), we came back to San Jose still hungry (couldn't get served at the other place).\n\nChili's is close to the airport so we stopped here. The service was prompt and customer oriented. The were going to seat us at a table, but we asked if we could have a booth instead and they accommodated us right away by clearing and cleaning one  and having us seated within about three minutes!!\n\nOur server was \"Johnny-on-the-spot\" and got us set up with iced tea and chips immediately.  The food came out of the kitchen quickly and perfectly prepared.\n\nMy husband has a specialty salad and I had the Sour Cream Chicken Enchiladas.\n\nChili's turned a disappointing and frustrating evening out into a good experience.", "name": "Chili's", "rating": 4}, {"index": 133, "review": "I don't know if I loved it this much because we were celebrating an engagement or if the food was really good but my friends and I loved it.  We sat at the bar and were greated by the bartender immediately.  He offered us their special and was super friendly.  Brought us our drinks fast and took our orders with no problem.  Salads came out, plates were picked up and voila! Our lunch was being served.  This is what I call good quality service and great food.  Love it, love it, love it.  Will definitely head back here for lunch, soon!", "name": "Chili's", "rating": 5}, {"index": 134, "review": "I'm very disappointed in the food here. I ordered food to be delivered by doordash. I was surprised that it wasn't mentioned that the $20 dinner for 2 meal didn't include fries with the baby back ribs. Every other Chili's I have been to have always included fries with the ribs on that order. I'm also disappointed in the quantity of food that they give us for that price. When I go to Chili's, they usually give us more fries with a burger order but I got maybe 10 fries with this take out order. Definitely not ordering take out from here again", "name": "Chili's", "rating": 2}, {"index": 135, "review": "The 2 for $20 deal is a steal; you choose an app to share, an entree each and dessert to share.  The portions are hefty and  are not bad. I usually get the 6 oz sirloin steak that comes with broccoli and loaded mashed potatoes.They're inconsistent with how they cook your steak, sometimes medium rare is well done and rare is medium rare. Service here is a tad bit slow. You'll probably be too stuffed before dessert but I recommend the chocolate molten cake, sort of like a lava cake (dee-licious)!", "name": "Chili's", "rating": 3}, {"index": 136, "review": "Came here to eat a quick unhealthy dinner before heading to the Coldplay concert.  We sat in the bar area to avoid a wait for a table.  \n\nMy husband and I had the $20 Dinner for Two with:\n-Chips with Salsa and Fire-Grilled Corn Guacamole (guacamole was generous and addicting, but half the chips were broken crumbs that we couldn't eat)\n-Classic Bacon Burger with fries (my husband ate it, but I took a bite and it was yummy!  A pretty meaty burger.)\n-Crispy Chicken Crispers with fries (The fries are addicting and the chicken crispers with ranch dressing satisfied my chicken tender craving so I was satisfied!)\n\nService was good and food was good.  No complaints.", "name": "Chili's", "rating": 4}, {"index": 137, "review": "Nothing special about to place.......the parking is hard to find and the service is pretty bad.\nI've eaten here 2 times and both times I sat at the bar and it wasn't busy. The first time they messed up my order, brought the wrong drink, added avocado to my sandwich and brought me a salad instead of fries.\nThe second time they brought me a quesadilla explosion salad instead of the chicken quesadillas.....I'm not to return food since that means I'm not eating when everyone else is but come on and they FORGOT silverwear, so we just stared at our food. \nThe food was like any Chili's (average) I'm gonna try one more time and hopefully the service can get it together!", "name": "Chili's", "rating": 2}, {"index": 138, "review": "After a long week I came here with a few coworkers. Service was slow due to the Stanford/Oregon game. It was hot as hell in the place. I felt bad for our waitress because I could see the stress in her eyes as my coworkers were shooting eye darts at her every time she passed our table without our order .\n\nThe food was ok knowing it's a chain restaurant. I wasn't expecting 5 star food or service but I feel knowing that Thursday was a huge game day and it was showing in the bar, they should have been better prepared/staffed to accommodate. We did come here instead of waiting for half an hour next door at BJ's which probably would have warrant the same service and food, considering.", "name": "Chili's", "rating": 2}, {"index": 139, "review": "Don't know if this is the chili's my friend and I went to, but it was close to downtown so I'm pretty sure this is the one. Anyways, we went to go have a drink and dessert at the bar and the bartender was hilarious. He's an upcoming Chris Angels. He showed us multiple mind-fucking magic card tricks and it was just mind fucking. We couldn't believe our eyes. The finale of his trick was to turn the entire card deck blue from red. Before it was red and he had my home girl put her hands on the deck and tapped it and it turned blue. Holy shit. Overall, even though we didn't really had the food here, but a drink and a cake, experience was great. Thanks Stephen ? I think that's his name. Everyone just go to the bar here, LOL.", "name": "Chili's", "rating": 5}, {"index": 140, "review": "I love this place presidential Margarita always on point.cant do anything but give them 5", "name": "Chili's", "rating": 5}, {"index": 141, "review": "I normally do not crave chilli's and the one time I do we decide to stop in at this location to get a quick bite around happy hour on a Friday.  To be honest I was a little disappointed in the quality of food and even thought the portions are not the same like they use to be.  We ordered a bloody mary that just did not taste right at all and had way too much vodka in it ( I Know who complains about that) but in all honestly it really took away the taste of a bloody mary. It just was not a great experience they seemed short staffed on top of that and it just was not the good ol chillis that I remember it being. we had order the triple sampler and got the fried pickles boneless wings and southwestern eggrolls. The first time they brought out our order it had sliders on there instead of the boneless chicken so what do they do they take it back wipe off the sliders and part of the pickles and bring it back and then bring a separate plate with the buffalo chicken on it. lol the eggrolls are not as big as they use to be and they just seemed a little on the stingy side. I don't I probably wont go back for a while it kind of just left a bad taste in my mouth with this whole experience and like I said it is not how it use to be that's for sure.", "name": "Chili's", "rating": 2}, {"index": 142, "review": "Chilis is a common place that has something everyone wants: good priced food and drinks!\n\nMy friends and I went there for my belated birthday and we waited awhile to be seated that we had to seat ourselves. We sat at the bar since we thought that it would be easier to get served. The bartender was chatting away with her friend so we got our own menus from another table. 10 minutes later and our order was in. Before we got anything she gave us our bill which I thought was really rude!\n\nThe drinks were really good. I ordered the gold margarita, and my friends ordered the standard ones. Luckily the drinks were good because we waited way too long for our appetizers and she gave us our bill.  I didn't know it takes 20 minutes to make chips and salsa???? Our meals came in. My friend and I ordered the margarita chicken and our other friend ordered chicken salad. The margarita chicken had WAY too much salt on it that I felt I was going to get diabetes! I know it was a \"margarita\" style but the cook was way too heavy handed. \n\nThe bartender re did our bill and took the appetizer off since we waited so long which was really nice. I wouldn't recommend ordering the margarita chicken unless you really like salty food. The margaritas are a good choice and sit at a table if they ever decide to seat you.", "name": "Chili's", "rating": 3}, {"index": 143, "review": "Do arrive before 7pm. Do understand you will be receiveing frozed food style appetizers. That is what they taste like, keep it real. Now for my Chilis experience: good waiter, busy but attentive as possible. Got the 2 for 20 and my half stack ribs hardly had any meat on them -__- My friend's steak was good, a bit dry. Mashed potatoes good and fatty tasting. My strawberry lemonade was just right, not too sweet. But, we were not offered refills.", "name": "Chili's", "rating": 3}, {"index": 144, "review": "It's Chilli's. It's a chain so short of a huge problem or something awesome, you get what you'd expect. The place is clean and the staff is pleasant. There drinks are watered down. The food is good. The last time I was there they were out of ribs which is strange considering it's a rib place.", "name": "Chili's", "rating": 3}, {"index": 145, "review": "Okay. Let's do this.\n\n1) Nobody led us to our table. The host pointed to a booth through the glass and told us to walk over to a booth and have a seat. \n\n2) The booth wasn't even cleaned yet. Food crumbs everywhere and sauce was still sticky on the table. The guy cleaned it, but did it backwards. He wiped the table then the seats and he did it without flipping the cloth. Great. \n\n3) Nice waitress. \n\n4) margaritas should not take so long to make that we have finished our giant plate of chips (appetizer sized) before they arrived. \n\n5) Food was ok. just. ok.\n\n\n\n\nmehh", "name": "Chili's", "rating": 2}, {"index": 146, "review": "Wow. Talk about a bad experience....\nI came by this Chili's yesterday afternoon for a small lunch with my boyfriend. We were immediately greeted and seated by a really nice host. We had a seat at a both and were immediately approached by our server. (Notice I said approached not greeted). Anyhow he asked us if we would like some drinks... As he was sweeping up the section. We ordered our drinks. When he was back with our drinks he asked if we were ready to order, we said yes and ordered. I ordered a cup of soup and salad, my boyfriend ordered the chicken sandwich with fries. Our waiter quickly brought my soup out. It was a cup completely covered in soup, even the outside of the cup! He sat both the cup and spoon on the corner of the table, no saucer or napkin! Just a cup of soup covered completely in soup and a spoon. I felt like a DOG. \n\nWhatever I let it go.... So then our food comes out.... I'm pretty sure it was the manager who ran our food based on the way she was dressed. She asked if we needed anything else and we said \"yes silverware and napkins please\" she said nothing, made a weird face and walked away. Someone else returned with our utensils. Literally seconds later (we are yet to take a bite of our food) our \"server\" comes by with our check. Wtf??? Ummm we are no where near done!! \n\nOk so finally when my boyfriend and I try our food, he notices his bread is stale! Eww. Whatever he just ate the inside of the sandwich.... We were pretty upset at this point. We paid our bill and left. Leaving not even a penny as a tip. My boyfriend and I are both servers... We hate not leaving a decent tip, but our experience here was horrible. We will never return to this location.", "name": "Chili's", "rating": 1}, {"index": 147, "review": "I have never liked Chilis. Being an ex-waitress at a franchise restaurant, I never have very high expectations for these types of places. My boyfriend always tried to make me go and finally one night he convinced me since it was close and I was starving. First off the service was fantastic! We had Christopher for our waiter. He was very attentive, he was fun to talk to and was honest and caring about the service he was providing. The food was surprisingly fantastic and came out in a timely manner. I had the steak and shrimp fajitas and fried pickles. I love fried pickles and am very picky, but Chilis was spot on! Overall I changed my opinion of Chilis that night thanks to Christopher and my great experience!", "name": "Chili's", "rating": 4}, {"index": 148, "review": "I thought I would go in for an early lunch this morning and beat the crowd, about 11:25 am. Walked in seated myself at the bar and nobody ever said hello. They started cleaning booths around the bar area. I sat there for about 10 minutes, not word was said to me the whole time. Not even when I walked out on them to pick up something to eat across the way.  HORRIBLE SERVICE! They need to train their staff big time.", "name": "Chili's", "rating": 1}, {"index": 149, "review": "Great service, great food! Our server Alejandro was very attentive and helpful, he seemed authentic too, not fake friendly the way service can sometimes be! We were there with our kids and they were happy with food! I liked the potato skins appetizer.", "name": "Chili's", "rating": 5}, {"index": 150, "review": "Worst service ever! Came here on a Saturday night and it wasn't too busy. Got my first drink and app quickly. I ordered a salad and some sliders and another drink. Didn't see my food...EVER! I watched the bartender talk to his friends while I waited for my drink for 15 min! Then he made it and it sat there for another 10min!!! I asked for another one and he just poured it into another glass and added juice. He had no idea I could see him. In short I got my meal comped. Don't come to this chillies if you want good service.", "name": "Chili's", "rating": 1}, {"index": 151, "review": "We were seated, the waiter took our drink and appetizer order. We got our appetizer and drinks, he took our food order and it never came out. 45 minutes later still no food, while the couple next to us had ordered and received their rib dinners (we only had salads). Finally we call the waiter who annoyedly says he's been checking the kitchen for the order. We call the manager who gives us a basket of chips and salsa for our troubles (gee, thanks, we're starving) and then comes back to tell us our order never made it to the kitchen. \n\nNo tip and definitely won't be coming back!", "name": "Chili's", "rating": 1}, {"index": 152, "review": "Poppers, crispers, sizzlers,stuffers \"add your name + er\" here. I think there's a whole genre of food Chili's may have that are on the border of the English Dictionary, but not quite in the Urban dictionary. Some times you crave caloric Americana style food like ribs and pepper corn burgers with crazy looking drinks. If that's the case, look no further.", "name": "Chili's", "rating": 3}, {"index": 153, "review": "We went there for lunch last week.  The service was horrible and the food was just ok.  If you are on a lunch break I would not go here unless you get an hour plus to eat.  I Don't.", "name": "Chili's", "rating": 1}, {"index": 154, "review": "still going about once a week... but less impressed with service.  i'm not sure what's happened, but they have become very inconsistent there.  if you end up on the far side of the restaurant by the windows, pretty much expect you'll have bad service. \n\nfood is still good.  i'm a fan of the soup/salad lunch.  it comes with chips and salsa, which are really tasty.  the enchilada soup is one of my favorite things.  cheese and tortilla strips on top... oh yeah... it's good stuff!  if you want to really splurge (in a diet sense), go for the skillet queso.  wow... looks a little nasty, but don't let that fool you.  hot cheesy goodness!!!\n\nall in all, it's not a bad spot to grab a sit-down lunch at a price that won't empty your wallet.", "name": "Chili's", "rating": 3}, {"index": 155, "review": "Spicy Susan was out in force today!  \n\nAfter seeing the latest Harry Potter movie with my friends, we were hungry.  We decided on Chili's.  I haven't been to Chili's in years but my friends like it and have been to this one often.  Perhaps like Harry and Voldemort's wands, Chili's and I are destined to not be compatible.  This was less than satisfactory meal for a variety of reasons.\n\nWe were seated quickly and placed our drink order.  We got our drinks fairly quickly, ordered as soon as we were ready and got chips, guacamole and salsa right away.  The chips were really salty.  The salsa was seasoned with hellfire.  Even the cooling quacamole had large chunks of jalapeno in it burning our mouths.   I quipped that Spicy Susan must be working in the kitchen today, and we think she was the cause of all our problems.  Either that or the full \"blue\" moon tomorrow.\n\nAfter ordering our food our waiter said, \"I'll bring out your food as soon as it's ready.\"  So of course we had to discuss this for 5 minutes.  What else would he do?  Why state the obvious?  What a weird thing to say.  Then he came back around with our drink refills and said it again.  So we talked about him even more and how ridiculous it was to say something so unnecessary.\n\nEventually, our server brought out our food.  Then asked us if we needed anything else.  I said that I ordered chili and hadn't received it yet.  He then snapped that it's coming.  Why did he ask if we needed anything else?  He didn't say it was coming so there was no way for me to know if it was coming or not.\n\nOne of my friends got ribs and it came with corn.  He didn't order corn.  He thought it came with fries but didn't specify because no one asked.  The waiter brought out some fries quickly.  However, he didn't bring out any extra napkins or wet-wipes that usually come with the rips.\n\nAt the end of the meal our server gave us our check.  But it wasn't our check since it didn't have anything that we ordered on it.  It then took another 5 minutes to get the correct check.\n\nOverall the experience wasn't horrible but the service was not acceptable.  I doubt that we'll go back for a long time considering how annoying the entire meal was.", "name": "Chili's", "rating": 2}, {"index": 156, "review": "This is a conflicted review.\n\nThe food. The last three times I've eaten a burger here, I've ended the night on the toilet in one way or another. French fries come out cold, and meals are often served at different times, and little details are frequently overlooked (ex: ask for no mustard on burger, burger comes out with mustard), etc. 2 stars. \n\nThe service. Like another reviewer mentioned, there seems to be a high turnover so there is a good chance you will get a new server who is still figuring things out. In my experience, the service is either exceptional or terrible. Our latest visit, for instance, our waitress was honestly one of the best servers I've ever had. On other occasions though, we had to fight just to get water refills. Sometimes 5 stars, usually around 2/3 stars.\n\nThe atmosphere. They just remodeled this location and it feels like they tried to make it more trendy or \"clubby\", not sure I like that. They made the layout more open which creates a louder atmosphere on busy nights. 2 stars.\n\nOverall, 2-2.5 stars.", "name": "Chili's", "rating": 2}, {"index": 157, "review": "Don't even bother! Especially during lunch on a weekday. \n\nI came here with my boyfriend and his co workers because we wanted to watch the Olympics. It was very crowded and busy because it was lunch time. Our server was slow and didn't seem like she knew what she was doing. Perhaps she was new? We all ordered the lunch special and when asked if our quesadillas came with a side of french fries, she rudely said that they didn't. Umm... excuse me? It clearly says on the the menu: (All lunch portions. Sandwiches, Bites and Quesadillas served with homestyle fries.) Copy and pasted from the Chili's menu online. \n\nAnyway, the only thing worth getting here were the free chips and salsa. Oh wait... we DIDN'T even get that either! \n\nWhat a joke! Never coming back to this location again.", "name": "Chili's", "rating": 1}, {"index": 158, "review": "Darn, this place was decent when it first opened. We dined there last night, and it had been over year since the last time we visited. There were MANY open tables but for some reason they were not seating people. Everyone that came in they told the wait was 45-60 minutes. I don't understand this. It seemed as though they had enough staff. Aside from their new menu, which is terrible, my husband got his meal and when he went to bite into his corn on the cob, it was FROZEN. I am not kidding, icy and frozen. As cold as my glass of rum and coke. All we could do was laugh. We didn't give the waiter any trouble about it, because it was just too laughable. So sad, does anyone check the meals before they come out. Ice cold corn on the cob. I can laugh thinking about it. Anyway, so sad how down hill this place has gotten. It used to be our go to.", "name": "Chili's", "rating": 1}, {"index": 159, "review": "** 2.5 stars **\n\nI now remember why I don't eat here all that often.  My daughter and I needed to grab lunch before heading over to another part of the shopping center so she said she had never eaten here, so we decided to try it.  The hostess who sat us was awesome, so sweet and upbeat!  Our server was pretty good to, he came around frequently with a smile.  So why only 2.5 stars?  It was the food.  The fried cheese was fine, nothing special.  I ordered fried shrimp which was just okay at best, and when I asked for tarter or cocktail sauce or any sweet sauce, they said they didn't have them, all he could offer me was honey mustard.  I had never been to a place that serves shrimp and doesn't have the typical tarter or cocktail sauce.  The coleslaw was just not good.  Prices would be okay, if the food was better.  Parking is easy.", "name": "Chili's", "rating": 2}, {"index": 160, "review": "Standard Chilis.  Nuff said.", "name": "Chili's", "rating": 4}, {"index": 161, "review": "Clean spot with lots of parking, easy to find, and service is pretty decent here, would come back for drinks and appetizers again! This Chili's is just like every other one, hence chain restaurant!\n\nThis place always seems to have cute girls who work here which is a definite plus! The food is standard chain foods but not bad the $10 triple dipper mix-n-match and a tall Newcastle (another plus!) is great!!.. as in tasty but not for you. Also got free chip & salsa for my foursquare check-in which is super cool! (Where you at yelp!!!)", "name": "Chili's", "rating": 4}, {"index": 162, "review": "I question the cleanliness of this location. There was someone else's hair on my glass! when I told the server he swapped it out, but it still showed up on my bill. If there is a hair in your food or drink should just comp the drink or food because it's disgusting.", "name": "Chili's", "rating": 1}, {"index": 163, "review": "I came here earlier this year and the service was AWFUL. I was with 3 other friends and we were just standing at the front of the restaurant waiting to be seated. None of the waiters even bothered with us. They'd just walk by and not say anything. I didn't think we looked bad either... Dumb that we didn't leave, but it was the only restaurant at this shopping center that was open. We went to grab the menus and seated ourselves. Once again, the waiters and waitresses just walked past us without saying anything until we had to jump out to stop them. Finally we got our foods. Wow that was really mortifying and embarrassing.\n\nMy bacon sliders tasted great but the whole time at the table, we were extremely bothered by how awful and bad the service was, we couldn't enjoy our food. The artichoke dip was extremely salty and cheesy. I felt I was getting high blood pressure. The mango and blackberry tea weren't too sweet and very refreshing. YES for free refills.\n\nHowever, when we came again recently, the waitress tended quickly to us and would constantly refill our drinks. But I still saw the bad waiters/waitresses were still there and slacking on their job...", "name": "Chili's", "rating": 2}, {"index": 164, "review": "I usually sit in the bar area noticed that the margaritas tasted watered down like drinking water not the quality they used to have. There menu is lacking flavor too. Gonna find a new hangout like BJ's next door.", "name": "Chili's", "rating": 2}, {"index": 165, "review": "I agree with those complaining about the terrible service.  The food was good on the chili's scale.  The 2 stars is after downgrading for the dismal service.\n\nWe were waited on by the aptly named \"Chase.\"  After serving the food he immediately brought the check \"for our convenience\" and vanished.  Chase is what we had to do to track him down.\n\nRefills?  Never asked.  Desert?  Never asked.  Is everything OK?  Never asked.  He never came back until I managed to flag him down long after we were ready to leave.\n\nI wanted a container for half of my sandwich and it took 10 minutes of watching for him to get it.  He came out of the back twice during those 10 minutes; once to bring someone's order...and he never turned in our direction, and once again to bring an order where I waved both arms to get his attention.  He came where he immediately looked to see if I had paid the bill yet.  I wasn't falling for that...I knew once I paid it I'd never see him again.\n\nI requested a container which he brought a few minutes later.  He walked by the table, tossed it on the table and said \"here ya go\" without breaking stride.\n\nI normally leave a minimum of 20% for a tip and was sorely tempted to leave $26 on the $25.75 bill but left another measly 2 bucks just in case the waiters share their tips with the rest of the staff.\n\nStaff:  If the waiters do share their tips be aware that crappy servers like Chase are costing you money!  If I ever get zero service like that again I'm leaving zero.  We left angry.", "name": "Chili's", "rating": 2}, {"index": 166, "review": "I hardly eat at Chili's... but when I do... it's at the Santana location. But alas, I could not go there since I happened to be shopping at the Target nearby.\n\nI'll cut to the chase:\n\n- Appetizers took way too long to be called 'appetizers' --I wasn't paying attention to the time, but when it DID come... the main dishes came about 3-5 minutes after that! It didn't even give my boyfriend and I a chance to finish it halfway. Became more like a 'side' after that.\n\n- Our server NEVER followed up or asked to see if everything was 'OK' once our food was dropped off, even when he was notifying us he was going on a dinner break and a new server was going to help us. Had to flag a different server to help me get additional things. Maybe the original server (never got his name by the way since there was no introduction) knew my food was lukewarm. I know for a fact they didn't even have the dish under a heating lamp once the chef was done cooking it because the plate wasn't hot nor warm!! I got the vibe that maybe perhaps this dish was made WAY beyond my even ordering it. \n\n- I ended up eating the food that I ordered for my son, who by that time was full off the stuff I brought to curb his appetite until his food arrived. Had to accepted the fact that I was just going to box my food up to take home and let the microwave do the work. Actually... I haven't even warmed it up yet and it's been a few days since this visit. Probably just gonna toss that out...\n\nI never like to tip crappy (I was a server once too!), but this experience definitely called for it.", "name": "Chili's", "rating": 1}, {"index": 167, "review": "It's Chili's. I'm sure we are all familiar enough. This one does have pretty good service though.\nAnd if you check-in on FourSquare... free chips and salsa every time!", "name": "Chili's", "rating": 4}, {"index": 168, "review": "Chili's is always good and consistent, mostly for their happy hour (which is all day on Sundays!)\n\nGreat prices on draft beers (Blue Moon, Sam Adams) and well drinks.\nEven the margaritas are decent for the bargain!\n\nYou could order some boneless wings or artichoke dip and hangout for a while, enjoying the All-you-can-eat Chip & Salsa.  The bartenders/servers aren't always attentive as one would expect, but the food and drinks are fairly priced and consistently good.  Great place to catch a game and a few drinks.", "name": "Chili's", "rating": 3}, {"index": 169, "review": "I did finally hear from Chili's management, and they stated they will not resolve the issue, they will not update their training manuals, or instruct their managers how to deal with abusive employees. FUCK YOU Chili's", "name": "Chili's", "rating": 1}, {"index": 170, "review": "This Chilis is always a hit or miss. Walked in to sit at the bar and my boyfriend asked if it was open seating.... RICK told us \"no\" as he bussed the table. As we walk to the host stand she lets us know that it IS OPEN SEATING.??? Hmmm. Interesting. Walk back... our luck the table is taken now by people who sat themselves. It was beyond frustrating that the server told us otherwise. But I guess he saved us from getting his bad service so thanks sort of. Oh well. Next time we'll just stick to BJs", "name": "Chili's", "rating": 1}, {"index": 171, "review": "here is my long waited review... chilis in general is mediocre, great easy for families and large groups on a budget, decent quality food and drinks and usually smiling faces. HOWEVER, this location is by far the worst ive ever been to. always a rude host/hostess at the front, waiters are kind of hit or miss whether they be grumpy or smiling. we come here quite often as we have a 1.5 yr old and its close to home. the waiters ALWAYS put all the food, drinks and apps down right in front of the child, a grabby toddler. a huge no no in any restaurant. proper training should include this. anyways the food doesnt make it much better either.. in the 13-15 times ive been here in the past year ive had one meal i didnt send back or that didnt have a problem. last time i was there there was 4 table including my own that all received food within about 5 min of each other and every single plate went back to the kitchen..  bottom line go to another location or another restaurant entirely if your looking for quality food.", "name": "Chili's", "rating": 1}, {"index": 172, "review": "So my family and I messed up by going to this chilis before reading the reviews about how bad it is over here. Just bad service overall. The food took forever to get to our table. My boyfriend ordered the fajitas and it wasn't even sizzling or hot when he received it. We were so disappointed with everything. Even though this location is close to home I would rather drive all the way to milpitas or the one near eastridge then to this one again or simply go next door to BJ's next door.", "name": "Chili's", "rating": 1}, {"index": 173, "review": "Oh Chili's! What happened to your customer service? The waiter was a bit snotty and it took over 40 minutes to get our food. By the time it was delivered to our table, we had to ask for togo boxes as our lunch time was up. Ended up eating my food at my desk at work. I order the Triple Play with Chicken Crispers, South Western Egg Rolls and Boneless Chipolte Wings. The food was good and that's why I gave 3 stars. Customer Service is 0 stars.", "name": "Chili's", "rating": 2}, {"index": 174, "review": "Typically I hate to give a bad review and try to make the best out of any experience,but this has got to be the worst service I've ever experienced. There was no one in the front to greet and sit us down,and once we were seated several waiters passed our table up before being asked if we'd been helped already. The wait time for our food was just as disappointing (nearing 30 minutes), in which we were never even offered a drink refill. Overall this was a very disappointing visit and hope the staff at this specific location make changes in order to improve their lack of customer service.", "name": "Chili's", "rating": 1}, {"index": 175, "review": "Waited over 20 minutes for no service.  I even got the waitresses attention and told her we we'd ready to order and she just smiled and said ok and walked away. They should make the kiosk app let us place our order on it. That was way to long for no service, we left.", "name": "Chili's", "rating": 1}, {"index": 176, "review": "I went here to try Chili's out for the first time ever in my life & omg... I am missing out! The southwest eggrolls were so freaking delicious and the 10 OZ sirloin w/ loaded mash potatoes and broccoli was BOMB! Did I mention that there's bacon bits & cheese sprinkled on top of the mash potatoes?! Holy heaven in my mouth! The steak tasted amazing and was the perfect size. Besides the yummy food, the waitresses were attentive and super nice! I WILL be back for more. ;)", "name": "Chili's", "rating": 5}, {"index": 177, "review": "I thought this would be a safe bet for a mediocre meal but it was so below par it is worth documenting.  My simple chicken sandwich was miniature and sparse fries.  Usually chili's does not skimp on the basics.  This was overwhelmingly lame.  Worse, my date's chicken tenders tasted horrible, just horribly cooked with the batter coming off and too much spice.  She had more fries at least.\n\nThe menu at this location sucked.  I thought chili's had a standard menu.  Other chili's did not suck this bad.", "name": "Chili's", "rating": 1}, {"index": 178, "review": "That guy told us we need to wait 20 mins. After a hour we were still waiting! We then had to ask to find out that were needed to wait for at least another 20 minutes, and will take at least another 30 mins for the food to arrive to the table!!!! This is some bullshit!! He could've just let us know the waiting time might be longer at the first 20 mins if he was informed that wait time would be even longer. I can't believe they just let us wait!!", "name": "Chili's", "rating": 1}, {"index": 179, "review": "Came here one night with my mom after picking up my sister from the airport, we got seated pretty quickly, but the booth they put us in had some sort of spilled beverage all over the floor (and some on the seat).  Obviously the staff wasn't paying much attention to that.  We got moved to another booth with no problem, and the rest of the meal was decent enough.\n\nCame back here the very next night with some friends and sat down in the bar area for the happy hour specials.  It took quite a lot of time to get service, and our waitress hardly ever came by.  Just like before the food was just fine, and it's probably the only reason why I would plan on going back.", "name": "Chili's", "rating": 2}, {"index": 180, "review": "Worst Chili's ever!!!!! There was more than 20 empty tables, and all the people work there just acted like we're invisible!!! The waiter was walking across right in front of us, and didn't even care to talk! We waited, and waited, everyone is not too busy talking to each other and cleaning empty tables!!!", "name": "Chili's", "rating": 1}, {"index": 181, "review": "What the hell did they do to the menu? I ordered frajitas. They came out dripping in cooking oil. The toppings came on a stand in tiny little sauce dipping cups. Even the tortillas were smaller. The table had an electronic tablet but it only works if you want to add more items to your bill. The refill button only allowed additional alcoholic drinks, not soda refills. Waiter was polite but was slow to respond.", "name": "Chili's", "rating": 1}, {"index": 182, "review": "It's always wonderful to gather with family share a meal - no matter where you are.\nWe chose this Chili's location because it's a half-way point to meet for myself and my kids.\n\nAs usual, dinner time on a Friday evening, this Chili's is a bustling busy. My DIL called to make reservations prior to our arrival because of the size of our party.\n\nIt was a 15 minute wait for us to be seated after our arrival - however, this is where it starts to take a downward turn.\n\nOur server was great - he was working is tail end off, however, the support he was supposed to get in serving his tables was scant or non-existent. It took us almost 45 minutes to get our main entree and numerous requests from him and other servers to get refills on our drinks, chips, tortillas and salad dressing. We even had to get up to get our own to-go containers once we were done.\n\nIt took a few requests to see the restaurant manager to voice our concerns about the service we received.\n\nThe manager eventually did come to our table. We told him how unsatisfied we were with the quality of our experience. He was very gracious and friendly. He listened to our concerns and - we did not expect this - comped us on a portion of our bill. It was nice that he he did this and definitely uplifted our frustration from the no-so-good service that we had experienced.\n\nWe don't frequent Chili's restaurants often - but we'll consider returning to this location with hopes that it was just an off-night for them.", "name": "Chili's", "rating": 3}, {"index": 183, "review": "Couldn't even get acknowledged by the host I understand being understaffed but a simple hi isn't that hard", "name": "Chili's", "rating": 1}, {"index": 184, "review": "I like coming here when in the area they have a great sporys bar and good service. im hunggggrrryyyy.", "name": "Chili's", "rating": 4}, {"index": 185, "review": "I would rate is ZERO stars if I could. Although our waiter had great customer service, our booth was dirty and sticky. \n\nMy boyfriend and I went here for dinner.  We got the two for $20. As an appetizer we got the half order of Texas Cheese Fries. And for the two entrees we got the Cajun Chicken Pasta but one without chicken. And for dessert we got the Molten Chocolate Cake.\n\nOur Texas Cheese Fries were good AT FIRST. But then we started to taste mold and spat it out immediately! It was absolutely disgusting! Then we got our entrees and the plates were black! It made the food so unappetizing. Wish I thought of taking pictures for yelp. So anyway, I had the entree with the chicken and my chicken was pink! I thought it was just me so I took my fork and opened up the chicken pieces to see if it was pink on the inside as well. IT WAS. I even had my boyfriend check for me. OH, and he had to get me a new fork because there was still food stuck on my fork!  The Molten Chocolate Cake wasn't so bad but was way better at other Chili's restaurants. (Both of our spoons were dirty too!)\n\nEven though we knew it was not our waiter's fault, we told our waiter about our food and he told us that he would inform the kitchen. A few moments later, a lady comes out (assuming she's the manager or something) and we tell her what we told our waiter.  She told me that maybe it was just the lighting that made my chicken look pink, but we checked the chicken out of the lighting as well. Then she said it was weird that we tasted mold in our fries because they keep their fries in a freezer.....\n\nShe ended up taking off an order of the Cajun Chicken Pasta. But would I ever come back here? NOT A CHANCE. ABSOLUTELY DISGUSTING!\n\nI do not recommend this place  unless you prefer good customer service over quality of the food.", "name": "Chili's", "rating": 1}, {"index": 186, "review": "Tried to give this place a chance again and it is NOT WORTH THE MONEY OR THE HOUR WAIT! Ordered our food and the chips came out fast then that was it. An hour later our flatbread still has not made an appearance and neither has any of the food. The manager is no where to be found and everyone around us is asking the same question.. WHERE IS OUR FOOD? I will never dine here again and will tell everyone I know not to come here again.", "name": "Chili's", "rating": 1}, {"index": 187, "review": "Can I just say, I am blown away by the service we received today.\n\nIts been ages since I last went to a Chili's, but we stopped by because it was near Trader Joe's. We were seated within 10 minutes, and our waitress greeted us within 5 minutes of us sitting down.\n\nMimi is AMAZING. Extremely attentive, came by to check up on us during our meal, not excessive, but just enough. \n \nThe food on the other hand was less than desirable.  I ordered the Grilled Shrimp Tacos and my mom had the Choose two combo with Baby Back Ribs and Sirloin. The rice that came along with my tacos was extremely bland and the broccoli with my mom's oder was overcooked and soggy. My tacos were mediocre at best. The sweetness of the \"lime\" shrimp threw the flavor all and I didn't taste any \"lime\" from lime shrimp. Boo.  \n\nDon't see myself coming back anytime soon.", "name": "Chili's", "rating": 3}, {"index": 188, "review": "I was given a Chili's coupon by a friend, and they opened one up not to far from my work, so I thought I would check it out.  I remembered that Chili's has a good black bean veggie burger, which is what I planned to order.  I looking over the menu a few times but I could not find the veggie burger.  I asked the waitress, and she said it is no longer offered.  So, the choices for vegetarians are slim and for vegans even slimmer.  Basically your choices are pizza, side salad, and/or fries.  The waitress was not very friendly or helpful.  Were it not for having a coupon, I would have left.   I ended up ordering a side salad and fries.  They were ok, but I won't be coming back, and I do NOT recommend them.", "name": "Chili's", "rating": 1}, {"index": 189, "review": "Great service !!!! We had the dinner for 2. We had a great time and food was on time and waiter was awesome will recommend  this chili's to family and friends.", "name": "Chili's", "rating": 5}, {"index": 190, "review": "I ordered delivery from this restaurant through GrubHub today. I had ordered four cans of Coke, which did not arrive. I was refunded after contacting GrubHub, who then contacted the restaurant. I ordered a 10 oz. steak, which arrived lukewarm, and tasted awful and was loaded with gristle. I couldn't finish it. I also requested that my corn be buttered, which it was not. I also had to reheat my pretzels as they were not warm at all. Awful, all around.", "name": "Chili's", "rating": 1}, {"index": 191, "review": "Tonight when I stopped by Chilis to order some food to go, I did not expect at all to be disappointed like in all of my previous experiences with other Chilis Restaurants. I ordered a cup of Sweet Corn Soup and Cajun Shrimp Pasta, which I had a sure feeling that my food would end up amazing. However, there were a few things about my meal that I was not too thrilled about. First, a $16 meal? But I only ordered some pasta (which I could easily make at home given I had the right ingredients) and a cup of \"soup\", that was actually chowder (though sometimes those two terms can be used simultaneously). Both items contained a very small portion so to a great extent I felt jipped. \n\nSecondly, my soggy, unvibrant, garlic toast wasn't so toasty after all since it was obviously undercooked just to make the evening's quota/sales. If I didn't know any better I would have thought my garlic toast/bread was just a sponge from someone's dirty ass kitchen. My pasta was drenched in Alfredo sauce and was missing a lot of/more cajun spice, grated parmesan cheese, with hardly any diced tomatoes, MAYBE 1% chopped green onions, and obviously not enough penne pasta. My box was oversized to make it seem like I was getting a great meal when in fact, it was a bit mediocre (to say the least). \n\nAnd to also think that the cashier girl would actually be a little more sincere if she knew my food was going to be halfassed. In retrospect, I'm sure she was just \"doing her job\" to earn a higher tip. $16.15+2.85? Does someone get to earn that much more for just taking food orders and pretending to have an enjoyable conversation with their customers? Anyways, I won't be coming back and I don't care if anyone wants to start throwing bad words at me. Insult me just implies you are a tool to be used in Chili's marketing tactics.", "name": "Chili's", "rating": 1}, {"index": 192, "review": "I used to hate coming here because service sucked, but this server (Anthony) changed my perspective. He was very friendly and quick. The food came out perfect and he went the extra mile. I will be coming back to this Chilis.", "name": "Chili's", "rating": 5}, {"index": 193, "review": "Over-cooked, over-fried appetizers.  How tough is it to cook a slider, potato skins and wings anyways????", "name": "Chili's", "rating": 2}, {"index": 194, "review": "This is a great spot for co-worker get togethers after work for happy hour or a christmas dinner if you wanna do some secret santa type of business\n\nI usually share a 2 for 20 here with a friend or coworker which always works out. I like the updated decor here and there's hardly ever a wait. \n\nFor a food chain, i'd have to say everything is sub par, of course as good as something like cheesecake factory. \n\nThe servers here are ok, It always seems like theres a huge turnover here and you never get consistency.", "name": "Chili's", "rating": 3}, {"index": 195, "review": "I give this place 4 stars for their awesome bartenders! They are constantly checking on you- making sure your drinks are full & that your food was what you expected :) Alfie & Anthony (aka Twon) are a GREAT duo! Highly recommend sitting at the bar if possible. Food was great for Happy Hour- basic:  nachos, boneless buffalo wings, artichoke dip, etc... \nGive it a try ;)", "name": "Chili's", "rating": 4}, {"index": 196, "review": "Hypoglycemia kicked in again while shopping for invitation supplies at Office Depot in the Coleman Center. Since it renders me unable to make any kind of decisions, the bf and I landed at Chili's to grab some takeout.\n\nWe popped into the \"Take Out Door\" and placed our order.....we split the combo plate of 1/2 Habenero Ribs and the Monterey Chicken. Since we were quoted 15 minutes for the food to be ready, we grabbed a seat at the bar and ordered a pint. To our surprise, the food came in about 5 minutes....*glug*, *glug*, *glug* so went our Newcastle. Yum, I love Newcastle.\n\nBy the time we got home, our Combo Plate was still pretty warm. The Monterey Chicken was fairly moist, the Ribs pretty dry, the loaded mash potatoes were delish with bacon and cheese, and the steamed veggies---well, they were steamed. Not much you can do with that.\n\nOverall, it was a mediocre experience. The food was \"meh\" and not cheap at $17+ for our plate after tax. But then again, I'm at Chili's and at least the food came quick and hot!", "name": "Chili's", "rating": 2}, {"index": 197, "review": "Food was good. Messed up my order but made up for it. Had like 5 different people bring us our order. But what was really upsetting was our server was wearing his iPhone headphones the whole time while working and taking our order! NEVER seen that in any restaurant before. Can't believe his boss would ever allow that or not notice", "name": "Chili's", "rating": 2}, {"index": 198, "review": "Parking is terrible, but I don't mind a walk. \nComing into Chili's I was not expecting much because it is a chain. So my expectations were not too high. \nWent on a Thursday night, seemed pretty crowded already. For a party of two we were told it would be a 10/15min wait. Luckily a table in the bar opened up after 5 min and we swooped it! Holla!\nWaiter was not friendly whatsoever but he seemed pretty efficient. We ordered the 35$ deal for 2: 2 margaritas, 1 appetizer, 2 entrees, and 1 dessert. Pretty good deal. \nThe gold margaritas were surprisingly strong! One star for that!\nGot the guacamole and chips- not enough guacamole!\nBoyfriend ordered crispy chicken crispers- your basic fried chicken strips, fries that came with were over salted\nI ordered the chicken/bacon quesadillas- pretty decent, you could tell they had put my plate in the oven to keep warm while they waited for the rest of the food to finish cooking.\nChocolate lava cake for dessert! Bomb! Loved it! Amazing! Two stars for that ooey gooey chocolate warmness! \nWould not return except if it were for dessert or happy hour for some stiff drinks.", "name": "Chili's", "rating": 3}, {"index": 199, "review": "So I've had to update since last September...   First off, simply because it's a \"fav\" food of yours shouldn't qualify this place for 4 or 5 stars.   \n\nFactor in the service here...   Shitty at best.\nFactor in the cleanliness...    The health dept really should take a look at this place.\nFactor in the actual quality of the food....   Low grade dog food is more appetizing.\n\nChili's should be renamed to \"Low Expectations\".\n\nServers who are only there to collect a check, not to give Chili's a positive image.   Managers who will argue with you over poor food or service, then go talk shit in the back with the employees about customers.  Pre-made food that's reheated and served.  YUCK!\n\nEver seen the movie \"Waiting\"?  Eerily similar to Chili's.", "name": "Chili's", "rating": 1}, {"index": 200, "review": "Chili's has never provided the \"wow\" factor for me after all these years.  Their selection food also haven't changed much. Service is a coin toss at this location. Sometimes you get good service and sometimes you get ignored. One thing that has been consistent is the food quality which is why hubby likes to come back here every time.", "name": "Chili's", "rating": 3}, {"index": 201, "review": "I have always been a fan of Chili's but this location has let me down many times recently.  The food has been good but the service is horrible, even compared just to other Chili's locations.  If you don't mind waiting (and waiting and waiting) for your server, then I guess this is your spot.", "name": "Chili's", "rating": 2}, {"index": 202, "review": "Second time in a row where service was unacceptably slow...\n\nWow... the only thing right on our order were the drinks. Three dishes and one appetizer.\n\n-Appetizer came out after entrees.\n-Buffalo chicken came out as some other grilled chicken sandwich dish.\n-Another chicken dish came out as tilapia.\n-Steak came out well done when ordered medium... second attempt was well also.\n\nManager did not remedy the situation in a satisfactory manner.\n\nWhy come here when BJ's has better food and service??  Good luck Chili's Coleman location...", "name": "Chili's", "rating": 1}, {"index": 203, "review": "No one at the front to seat us.  No one to take our order.  Waitress said the are short staffed.  That's what they told us last time.  It's so odd how bad things are here lately. I'm not sure why.", "name": "Chili's", "rating": 2}, {"index": 204, "review": "Service is ok... Nice lil' place...\n\nTheir chicken pasta with cheese alfredo sauce is pretty darn good...\n\nTheir baby back ribs are dry though...\n\nChips and salsa are ok...", "name": "Chili's", "rating": 2}, {"index": 205, "review": "It's a typical Chili's--food is pretty much the same at every location. However, the service at this particular location sucks. I've been here on multiple occasions to be fair, and the majority of the times, service is very spotty.\n\nWas here over the weekend, and we seemed to be served by two waitresses. You'd think two would be better, right? NOPE. It was worse! We placed our order with one waitress and instead, another waitress came with our entrees. However, neither came with our appetizer prior to the entrees. We told the second waitress that we'd ordered an appetizer that we'd never received. She whisked away, and out came the first waitress with the appetizer. So we put our entrees to the side (luckily they were salads) and proceeded to eat the appetizer. Waitress #1 apologized profusely and offered up a soup or salad (even though we already had salad entrees, but I will give her some credit for offering up that).\n\nI also asked waitress #1 for extra salad dressing which she never came back with, so screw it, ate the salad anyway. Waitress #1 didn't come out to check up on us after the appetizer snafu. Instead, we saw her at the end of our meal when she brought us our check.\n\nSeriously, Chili's...you need to do something about your service at this location. I cringe every time peeps suggest we meet for lunch or dinner at this location.", "name": "Chili's", "rating": 2}, {"index": 206, "review": "came in to watch the game on sunday at the bar.\nwalking in we were seated and saw happy hour is all day on sundays! \ngreat selection, good beer, great service and atmosphere at bar.\nour server was very attentive and food was great.\nwill come back again this sunday!", "name": "Chili's", "rating": 5}, {"index": 207, "review": "I love this place. Great Service and food. Our server was awesome and attentive! Thanks again Stephanie!", "name": "Chili's", "rating": 5}, {"index": 208, "review": "I must say we must be on a bad streak because again we are  waiting at one of our favorite restaurants.... we have been here for 20 minutes and we haven't even had a waiter/waters take our drink order let alone our food order.... I must say I am highly disappointed in the service we have received..... ugh less than 1 star.", "name": "Chili's", "rating": 1}, {"index": 209, "review": "I ordered food for delivery from here, I ordered the triple appetizer and got the chips and spinach/artichoke dip, boneless honey chipotle wings and big mouth bites. I specifically added a note and asked for NO CHEESE on the big bites and asked for a side of ranch and ketchup. When I received my order I found cheese in my big bites and couldn't find the side of ranch and ketchup. I guess they didn't read my order correctly. That's probably the last time I'll order from them to deliver. To think I was excited about them delivering, and couldn't wait to eat my food. Now my big bites are in the trash because they couldn't read.", "name": "Chili's", "rating": 1}, {"index": 210, "review": "I'm 50/50 with this place.\n\nI really like the food but the servive...well...sucks! Every single time I go we have really bad service. It never fails. They're terrible about checking on customers and bringing food on time. We always plan to wait a while and make sure we're not too hungry when we go because we know it'll be a while until we get our food.\n\nThere food is pretty good though. If it weren't I would never go.", "name": "Chili's", "rating": 3}, {"index": 211, "review": "The food was good but our waiter was excellent I think his name was Chris. My kids loved him he was very attentive and outgoing. I have no complaints about this place they are always on point food and service is excellent even when it's packed.", "name": "Chili's", "rating": 5}, {"index": 212, "review": "I had to work late on a Thursday night. Ok, I have something against Chilis and Applebees...just not my preferences. So, when my coworkers chose to eat at Chilis, I was a bit pouty, but I didn't feel like eating Baja Fresh either. So, I sucked it up, and went to Chilis. As we walked in, the bar was on the right, and on the left was the dining area. Yeah, I know...I'm being so descriptive! Looked at the menu and I was eying the margaritas. The list of margaritas looked so good, but I knew I couldn't order any since I had to go back to work. So, I decided to have a BBQ chicken salad. To my surprise, the BBQ chicken salad and iced tea were alright. The service was friendly. So, I guess my negative impression and experience of Chilis is a bit better than before.", "name": "Chili's", "rating": 3}, {"index": 213, "review": "Slow service. Period. It always starts off well. Then we get forgotten. Our orders are never correct.", "name": "Chili's", "rating": 1}, {"index": 214, "review": "Had a good experience here. Anthony the bartender is an awesome guy and took care of my friend and I. I also had the create your own meal with half rack and salmon, while she had the flat bread pizza. It was really good. Do realize this shopping center is ALWAYS busy so you might have a little wait.", "name": "Chili's", "rating": 4}, {"index": 215, "review": "The food at Chili's has always been on the blah side, not to mention that almost everything on the menu is ridiculously unhealthy, so you don't even get the satisfaction of eating unhealthy food that tastes good.  But this particular location has another negative going for them: the service couldn't be any slower.  Came here for lunch and it took an hour and a half!  Server took forever to take our order and once our orders were place, it took at least 30 minutes for it to come out.  Ridiculous.  Never coming back here again... or any other location for that matter.  Operation Boycott Chili's starts now!", "name": "Chili's", "rating": 1}, {"index": 216, "review": "The food is your standard Bar & Grill fair. I was not expecting the food to be outstanding. I wasn't expecting the service we received from Monica to be as outstanding on a busy Saturday night. Well I was wrong. I have not received such fabulous service in well over 5 years. Monica was able to describe the items on the menu with delicious and precise descriptions. I ordered the Mango-Chile Tilapia, It was every bite as delicious as Monica explained to me. She was extremely cheerful and engaging. I even ordered dessert, which I usually skip. I would like the management of the Chili's on Coleman Ave to acknowledge Monica in the next staff meeting. She truly made my experience a memorable one. Touche Monica!", "name": "Chili's", "rating": 5}, {"index": 217, "review": "Pros\n\n+Cobb salad was OK\n+Jalapeno Smokehouse Burger was OK \n+Nice location\n+Service was good.....although during both visits, I was there after lunch and before dinner time...pretty mellow\n\nCons \n\n-Discontinued lettuce wraps\n-Discontinued awesome blossom\n-Fries too salty\n-Limited beer selection\n-Dessert shots (strawberry shortcake and fudge brownie) were smaller than at Applebees\n\nNot sure if I'd be back for a third visit??", "name": "Chili's", "rating": 3}, {"index": 218, "review": "We have eaten at many Chili's but this one needs some help. The food was what you would expect from Chili's but this location had some very poor service. My wife ordered fajitas and they took so long to serve it that the skillet was cooled off and did not sizzle on delivery.  To top it off the server forgot to bring the tortillas and sides. We coild not locate him or any other server until she was almost half done with her meal. When we did get her sides, the rice was undercooked and hard. We all had empty beverage glasses before anyone offered refills. We think the entire restaurant staff could benefit from some retraining on service skills.", "name": "Chili's", "rating": 2}, {"index": 219, "review": "I only do this Chili's or the one on Almaden and Blossom Hill.  The others are shit.  (esp. Santana Row or Eastridge)...\n\nHad great service tonight from Sean... the happy hour is amazing... the drinks were good... and the girls were fun to look at after a few margaritas...", "name": "Chili's", "rating": 4}, {"index": 220, "review": "Man has the place gone downhill! I randomly came with my family on a week night; pretty late about 9pm it was still open so that was nice. We were seated quickly by this polite young man. The service was ok no complaints there at all but the place was a mess! There was garbage all over the floor I thought that was a little weird I've never experienced that at a restaurant with waiter service, maybe because I rarely eat a restaurant chains. It reminded me of McDonalds I most likely won't be back :(", "name": "Chili's", "rating": 1}, {"index": 221, "review": "I signed up for a yelp account just to write this review.  Sat at our table for ten minutes before a server showed up. Took our drink and appetizer order and disappeared for another 5 or so minutes.  Brought drinks and then was absent for over 10 minutes, after which she brought our chips without the Queso we ordered. 5 minutes later, got the Queso but no chips. In summary, we were there for an hour without getting our food, and we weren't the only ones.  Our lunch companions said that this was the 3rd time they had such bad service. It wasn't busy at all.  Even after getting the manager to our table, we waited almost 15 minutes before walking out. I will not go back.", "name": "Chili's", "rating": 1}, {"index": 222, "review": "This Chili's is one of my least favorites, yet I come here more than any other because it's close to everything.  So unfortunately, I have had many bad meals from this Chili's.  The location is great, right in the middle of the Coleman Plaza, so there is always parking.  I've never once had to wait here (which is both a good and bad thing - good b/c I've always eaten right way, but bad b/c no one goes to this Chili's).  I'm not sure why this Chili's is worse than others, I think it could just be because the servers are a little slower and the food just isn't cooked that well.  But probably because this is where I was when I found out that Chili's removed my favorite dish - the Chicken Cesar Pita.  Well even though it's not my favorite... I'll still go.\n\nAlso, as far as happy hour goes, Chili's has an OK one.  Their drinks are pretty affordable, but I generally like their happy hour because of their Skillet Queso dish.", "name": "Chili's", "rating": 2}, {"index": 223, "review": "So I rolled in late on a Saturday night and we ended up sitting there for about 5 minutes before somoene came to our table.  Not a great start but they redeemed themselves and then some.\n\nA waiter came over and took our order.. apologizing.. knowing it wasn't his table but wanted to get us taken care of.  Some people would just say.. \"let me get your waiter\".. he went above and beyond.\n\nHe then got our waitress who was full of personality (and kinda cute :P) and she provided excellent service from there on out and offered free dessert.\n\nThen... the manager comes over.. hearing we had waited a while and apologized and said they would not be charging us for ANYTHING.\n\nAll in all.. people make mistakes.. but this kind of customer service will pay 10 fold in return.  It was my first time there.. going back soon.\n\nOh.. food was pretty good too :)", "name": "Chili's", "rating": 4}, {"index": 224, "review": "It's happy hour! The waitresses should be happy right?! Wrong.\nIt wasn't even busy and she took forever to come back to our table. The food was good though so that was a plus. I ordered the sliders, and my husband got the wings. Very good food and cheap.", "name": "Chili's", "rating": 3}, {"index": 225, "review": "Food-- Hot food hot, cold food cold. Perfect. Obviously not gourmet fare coming from Chili's, but for simple American food it's very very good. \nService-- Chase was fast and friendly. I did feel slightly hurried, but I think that's how they operate at this store during lunch hours as many business people tend to eat there and need to leave in a hurry. I DO wish they'd gone over the specials as I was a bit lost when I looked at the menu.\nOverall very clean, music wasn't too loud, no wait at 11am on a Tuesday. Pretty good. :)", "name": "Chili's", "rating": 4}, {"index": 226, "review": "Anthony is the friendliest bartender.  EVER.  Good job!", "name": "Chili's", "rating": 3}, {"index": 227, "review": "I am never the one to offer up, \"Let's go to Chili's!\" Yet somehow I always end up here. Ughhh. \n\nIt's not that bad & it's not that good. It's exactly like Simon Cowell always says on Idol, \"It's forgettable.\" Which is probably the reason I keep getting talked into going back, because I forgot that I didn't like it that much to begin with. What a conundrum. \n\nAnywho, there are just too many solid restaurants in this city to keep getting drug back to Chili's. I'm putting my foot down as of right now. Unless you are out of options, in a hurry or have a persuasive 'Chili's' lover in your group...skip it.", "name": "Chili's", "rating": 3}, {"index": 228, "review": "What I like: TV's and sports everywhere, food is aight.. tastes like cardboard, but fun place to be with some friends.. I guess if I had to pick one of these chains.. I'd be all about the Chili's.  The burgers are really good (the sliders/small bites) small but lots of flavor..  I like to go in have a cocktail and watch a game, the atmosphere is much better than the food :)", "name": "Chili's", "rating": 4}, {"index": 229, "review": "After my wife spent hours in the kitchen on Thanksgiving Day and night I said lets go out for a quick and convenient sit down dinner. (Friday Night)\n\nWe did the $20 2 people special and the food was good , service was just fine! \nchips were endless basket, but a little greasy. Only word of caution is ask first what the cost of the Margaritas are a head of time. My wife had a Strawberry one and it was $9.00 ouch! \n\nBut we will come back, so that says something.", "name": "Chili's", "rating": 4}, {"index": 230, "review": "I really enjoy eating at Chili's, but I was surprised that they did not have wi-fi.  I like to do work while on my lunch, and I could not due to no wi-fi.  When looking for wireless access.  I noticed that the yogurt shop, Supercuts, and a few of the other surrounding businesses offerred that to their customers.", "name": "Chili's", "rating": 3}, {"index": 231, "review": "I've actually never sat at a regular table for this location out of all the times I've gone. I've gotten take-away there with no problems, and have sat at the bar.\n\nThe bartender I had my last visit, JustinJustin, was fantastic! Super attentive and funny, mostly commenting he was jealous my boyfriend and I were attending the Sharks game that night ( evident by our jerseys). He was helpful in making choicesvon some of the variation on the chicken tenders I had and my glass was always kept full. If everytime I went the service was that put together and phenominal I'd make it my Chili's of choice.", "name": "Chili's", "rating": 4}, {"index": 232, "review": "I've visited here a few times during happy hour and was generally  buzzed and happy by the time I leave. A few of my favorites have been the loaded $4 mac n chesse, $4 chicken pot pie, $7 braised short rib with mashed potatoes. \n\nI have enjoyed the food and the drink prices are okay but not super cheap about $5 for a pint of beer or well drinks and $6-8 for for wine. \n\nMy only complaint has got to be the time they charged me $12 for a long island. I consider long island a well drink and I won't typically care if they do mess up form time to time but this one I was just curious if they had forgotten. Her excuse was that long islands have more different alcohol thus not being a part of the well drink special. I didn't want to argue since teh service was great but i'll just remember not to order that again. \n\nenjoy.", "name": "Chili's", "rating": 4}, {"index": 233, "review": "Wow what an epic fair for such a new location. My main complaint has nothing to do with the food this is just off the service. The place wasn't that busy however the service at the bar area was horrible. It took forever almost 30 minutes to get our drinks. I thought in a bar they want to get those to you ASAP so you drink more. The food wait was even worse and to make things worse the server was just talking to other people and it seems like he was pawning off his tables to other employees. Will never even bother coming back, if I have to eat in that area again I will choose one of the many other options in that shopping center.", "name": "Chili's", "rating": 2}, {"index": 234, "review": "not impressed at all with the food, most of the dishes anyway.\n\ntried their chips and cheese/small beef chucks dips, pretty fresh with good dip sauce. got it for free as i joined the email listing so can;t complain much.\n\nthe cheese fries.. not bad, but not special. u can make this at home for the same taste\n\ngot the dinner for 2 for $20... got the 6 oz sirlon steak... i asked for medium rare, got a hard steak close to well done.. although the waitress asked us to cut open the steak to make sure it was to our liking... we said it was over cooked, but didn't return the food due to not wanting to waste food. the side veggie were nothing special.. again, u can make this dish better and cheaper at home.\n\nalso go the chicken dish on the lighter fare with black beans.. not too bad, but not memorable..\n\nso.. pbb will not go back again...would i recommend it? i dunno... it depends on what u are hoping to eat... for sure a fast food type of restaurant that serves entrees.", "name": "Chili's", "rating": 2}, {"index": 235, "review": "Came here a littler after 10pm on a Saturday night to grab drinks and food ...It was New year's Day and our intention was not to be around crazy NY drunk people...Hence, we headed here.\nI haven't been here in such a long time, and I was actually surprised to \nfind out how cheap their drinks were! Oh. They were cheap, and well made. The bartender did really good. He did go all out with the vodka.\nTo try: Vodka, Cran, with a splash of black raspberry. and the Strawberry Mojito. (if you hate the basil floating around in your drink, you can have them drain it out)\n\nMinus one star because I wish they closed later.", "name": "Chili's", "rating": 4}, {"index": 236, "review": "Horrible service. We sat down in the bar and sat there for 25 minutes with no service. The waitress looked at us many times, but never even came over to tell us it would be a few minutes. There was a couple sitting next to us who were there at least as long as us. They ended up walking out. Five minutes later, we walked out.", "name": "Chili's", "rating": 1}, {"index": 237, "review": "Here I go again. Reviewing a mainstream restaurant! I just had to share!!! \n\nWednesday night my finace and I were hungry but were running errands at Target. We both looked at each other and smiled. OK OK we'll eat at Chili's. Hey! Its brand new! How bad can it be?\n\nWe walk in and are seated at a booth with dirty seats.(bad sign already) I smile and just wipe the seat down and patiently wait for our waitress.\n\nWOW. WHY US??? We get the waitress with NO teeth! Just as I suspected! ugh.. I hate mainstream joints..why did we come here?!! It's OK. I can be gracious..just don't look at her. She's an older fat lady who keeps smiling. gross! (I think she stunk too but I didn't try to smell her!)\n\nWe get our drinks. I order a Presidente Margarita. I need one badly at this point if I'm gonna eat here. 5 mins later she brings my margarita and pours it for me..NOOO don't touch it! ugh..one of her hairs is on the shaker. (why did we come here?!) \n\nAt this point my fiance feels shitty about suggesting we eat here. I drink my margarita in 3 minutes flat. I feel better...ahhh. \n\nWe ordered the fajita trio which was actually GOOD. We also got the $5.99 1/2 slab of ribs you can add to any dinner entree. Don't forget the southwestern spring rolls. All were tasty! This is what gets this Chili's ONE star. \n\nI won't ever be back to any Chili's. I think that this place is good for families and teeny boppers who want to go out and have a \"nice\" dinner. LOL\n\nWHY WHY WHY do all the nasty people work downtown? and WHO hires a waitress with NO teeth???", "name": "Chili's", "rating": 1}, {"index": 238, "review": "Chili's at this location is the go to place for sports bar dining. I am always pleased that you are seated quickly and the wait times are never long. I go for the sweet potato fries and a sandwich. The bar area is always filled on weekends especially when there is a good game on! You do not have to sit in the bar to see the monitors because there are lots of TV's all over the establishment. Each table holds these Ziosk systems where you can re-order drinks directly from your table screen (probably takes the place of an actual waiter which could be bad when you think of staffing). Some things that I feel would improve the Chili's experience. Pick up your floors and dust your fixtures because when you see the mess it doesn't make customer's feel that cleanliness is important. All I had to do was look down then up to the ceiling and saw the cob webs off of the ceiling beams. Yikes! The customer service is good and the food okay, so this is why I score 3.5 stars!", "name": "Chili's", "rating": 3}, {"index": 239, "review": "Friday Dec.13, 2013 \n We decided to have dinner here. There were four of us and we waited between 30-40 minutes to be seated. Around 9:00 PM we were seated. The area we were seated was far left side of the restaurant near the restrooms.\n The waitress that was assigned to us was sooooooo slow  in greeting us. We finally were able to put our drink orders in but we waited a while for them.We looked around and saw our waitress sitting with two guys at the table behind us!!!!! She was talking and laughing with them.\n Our table at some point was able to order. We ordered two different appetizers. Our drinks were brought first and after a wait one of our appetizers. Again, we noticed the waitress was paying lots of attention to her friends at the table behind us. She came by and asked how we were enjoying our food!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I could not believe her nerve. Our drinks were empty and nothing had been cleared!\n We were all so hungry that we tore into the small order of cheese fries that we were lucky to get. I finally had enough and went to speak with the manager. he saw the waitress talking with the guys at the table as she SAT WITH THEM! I told him everything and asked for a different waitress. Still she came to our table asking how everything was!!!!!!!!!!!!!! By that time I was mad and didn't want to see her at our table again!!!!!!!!!!!!!!!!!!!!!!\n I was very frustrated that even speaking to the manager did not help. Even worse was the obvious stress that this girls crap was putting on the other workers. I don't know why even after seeing this waitress sitting/talking with her friends the manager did nothing. I asked for the manager once again and told him I did NOT want that waitress at our table again. \n The food was cold our drinks were not filled and worse the dishes were slow to be cleared. Our bill was high and the manager didn't even offer to comp us a thing. The worst experience I have ever had anywhere. After all of this enjoying our food was close to impossible. I will never return to this site...................\n*Spoke with Sean (ASST. MANAGER) today and I really feel better about the whole thing. He is going to handle every one of my concerns. OH- the servers name was Stephanie*", "name": "Chili's", "rating": 1}, {"index": 240, "review": "this place rocks i can't say enough about this place my food is always right and fresh and it works great with my diet.", "name": "Chili's", "rating": 5}, {"index": 241, "review": "Service is getting better, although I've been ordering through their to go menu as of late. My biggest gripe about the to go side is that their \"reserved\" parking is always filled up with people dining inside or getting a haircut. Parking on the sidewalk seems to work. I want to see some cars crushed and melted as advertised!", "name": "Chili's", "rating": 4}, {"index": 242, "review": "I love the locations and the enviroment inside and out are clean and cozy. However, foods aren't that good. Their steaks are dry. Their nachos's salsa not so delicious just OK and I think the salsa from Trader Joe's are much better =P. Their foods tasted like from a frozen cooked food that's ready to heat up and serve. The waitress weren't so much help at all. She didn't even  recommend any good menus and I love recommendation since i love to taste new foods but nothing.", "name": "Chili's", "rating": 1}, {"index": 243, "review": "I go to Chili's more than I should.\n\nEspecially, being an ex-employee - I don't know why I go back. I didn't work at this one, but still...\n\nI'm in the industry - so it takes a lot to ruffle my feathers. But at the same time, if you are stupid ... the excuses run zero. Because, you know why? I am in the industry - I make the exact same excuses.\n\nFood was sub-par, partly because the server couldn't get our orders right. She couldn't input anything over three modifications. And I'm sorry, that I was difficult - because ordinarily I'd cuss you out under my tongue if you did that to me. But AT THE SAME TIME, you are a server... you should expect that your job could potentially be challenging. Food just was BLAH, service was blaringly awkward. Moving forth, she was hardly graceful - it took about five minutes to get noticed (were you busy, no) ... \n\nI didn't get it. I've had better experiences at Santana Row, and they can GET BUSY. I might hesitate about going back to this one, but it would be okay if I was in the area...", "name": "Chili's", "rating": 2}, {"index": 244, "review": "Went here at lunch with my friends.  My friend who ordered the steak and portabello mushroom fajitas had to send it back because it was so salty.  They replaced it with a Cobb salad that eventually came.  Later, we found out that they didn't put either course on the bill!  We asked out waitress but she said don't worry about it.  How lucky were we?\n\nChili's food will never be great and best case, it won't suck but you have to like any establishment who tries to do right by the customer.  I gave this place 3 stars for excellent service but mediocre food.", "name": "Chili's", "rating": 3}, {"index": 245, "review": "This is a great Chili's location. Food always seems fresher than other Chili's branches in town. Call me lame but I love me some Chilis!", "name": "Chili's", "rating": 5}, {"index": 246, "review": "I created a yelp account because of how offended I was today at this Chilis. It is my friends 23rd birthday and a friend came in from out of state, so we all meet up at Chilis for dinner and drinks on happy hour. When I arrived my friends were already seated at a table for 6 so I pulled up two chairs from the neighboring table for my self and my boyfriend who would be meeting us. The server came over and bluntly told me that we weren't able to have extra chairs at our table due to fire safety. Which is understandable but made no effort to suggest an alternative. My hott head friend asked to speak to a manger and when he came over he pretty much said the same thing, made no effort to suggest a alternative that would work for us. Not to mention is was 8 of us, not something ridiculous like 20. So I then asked to be seated somewhere with a bigger table. They moved us from the bar area to the \"dinning room,\" where we were serviced by Imeh who was a great servicer and was very personable and funny! A nice change from the poor service we were receiving and I'm glad we had him. Anyways, we ordered a few more drinks and food and when the bill came none of our meal was happy hour priced. We asked to speak to a manager once more. He pretty much told us too bad, that we had moved to the dinning room and there was no happy hour there. We explained to him that he himself had placed us in the dinning room not giving us any other alternative so it's doesn't seen fair. He said we should have just split up and sat at two tables in the bar. Where we explained that he hadn't informed us of this option and did not even tell us he'd be moving us from a happy hour section to a place we would no longer be offered happy hour! After a few minutes of us explaining this and the manager Jeremy still offering nothing to correct the problem, I said \"oh well, it's fine we will just take care of this\" lifting up the bill, Jeremy then walked away from our table without so much as an apology for the misunderstanding! It was a terrible experience and the manager Jeremy made no effort to help and ultimately made things worse! I have been a server for the past four years so I know how difficult it can be when a guest seems unreasonable. But we did not make too much off a problem and even ended up paying a great deal more than our bill should have been! The management I have worked with would have bent over backwards to ensure the customer leaves happy but Jeremy did absolutely nothing. He needs quite a bit more hospitality training. I WAS a regular of this Chilis, always tipping their servers well and even on this experience tipped 20%. I find it outrageous that the manager Jeremy would do nothing to accommodate us, and feel that he didn't care because we are a younger crowd. I will be taking my business to the neighboring BJs from now on!", "name": "Chili's", "rating": 1}, {"index": 247, "review": "I'm not normally a fan of chain restaurants, but a friend and I were in desperate need of a Sunday night drink and this place was close and open. Their happy hour specials are actually pretty great, with $5 fresh margaritas. You also get free chips and salsa, but I'd splurge on the queso. Delicious.", "name": "Chili's", "rating": 3}, {"index": 248, "review": "I have a secret.....\n\nI used to work at Chilis.....\n\nwow, my secret is out!  I really can't think of any other things I keep so under wraps but I'll be honest...I heart Chilis food.  I didn't eat much of the food while working there but years later I crave it from time to time.  \n\nI am disappointed that free chips and salsa are no longer part of their happy hour (I suppose I can afford the $3, but still!) and not sure they have any food specials anymore but I flipping love their chips and salsa.  I also love their appetizers and the triple dipper what have you thing, or as I like to call it, \"the artist formerly known as the Triple Play\".  One presidente margarita will usually get the job done for me too and it's like 3 1/2 drinks in one because you get to keep refilling the teeny martini glass that you shake the drink into.  \n\nChilis also has my favorite honey mustard and my favorite ranch dressing.  I probably eat 30 grams of fat from dressing when I'm here so it's good that it's only a few times a year.  The desserts are awesome for chain food (I've been known to have a molten cake for dinner) and the french fries are too.  I feel that Chilis is a consistently good chain for it's class (Fridays, Applebees, Hooters maybe?).  It's cheap and casual and you can bet that you'll smell like the place when you leave.  That fajita grease is like cigarette smoke or something, it sticks to you.", "name": "Chili's", "rating": 3}, {"index": 249, "review": "I always seem to end up coming here when me (and whoever else is in the car) can't decide between Indian, Thai, Mexican, Chinese, Armenian, or any other more tasty option. So we end up coming here for good ol' American food.\n\nSure, everything is probably processed, greasy and really bad for me, but it all tastes good, notably the awesome blossom (fried onion), spinach and cheese artichoke dip, baby back ribs, buffalo chicken strips, shrimp fajitas, and the quesadilla explosion. The service is solid. \n\nThe only negative about this place are the people inside. Why is everyone so fat? Why is everyone always complaining? Why is everyone never satisfied? And really, why is everyone so damn fat?\n\nWait. That kind of sounds like the United States of America. \n\nWhat was I expecting from a place that serves good ol' American food?", "name": "Chili's", "rating": 3}, {"index": 250, "review": "It's a Chili's. Pretty standard. Shared two appetizer samplers. Basically go to try everything. Deep fried goodness. Anyway, located in a shopping center so there is lots of parking.", "name": "Chili's", "rating": 3}, {"index": 251, "review": "Chili's is one of my son's favorite places to eat.  They treat kids very well, and he likes that the televisions are on all the time.  Unfortunately, the food really is lowest-common-denominator \"American\" food.  Don't go here for anything you couldn't pick up just as easily at a deli counter or freezer section.\n\nThe servers have all been extremely helpful answering questions about the menu, but during busy times the service can get incredibly slow.  I think that's probably more of an issue with the kitchen being backed up, but it would be nice to get a heads up that our food is on it's way.  This is more important with children, who get impatient particularly when they're hungry.", "name": "Chili's", "rating": 3}, {"index": 252, "review": "HORRIBLE.  HORRENDOUS SERVICE.  NEVER AGAIN.\n\nIt's New Year's Day and I had a gift card for Chili's that I was given, so we decided to give it a go.  We entered the restaurant, and there wasn't a hostess in place to seat us; no big deal--I got over it.  The hostess finally returned, and brought us to a small booth for two, had the bus boy wipe down the table for us, and gave us our menus.  This is where it goes downhill, and a sign why I never, ever go to Chili's. \n\nI can fully understand that you never want to \"crowd\" over customers, but a simple acknowledgment that, \"hey, you're in my section, I'll be right with you cause I'm busy\" is all we needed.  We:\n\n-  waited 5-10 minutes to be acknowledged--and not even a glance was made our way by the server\n-  watched a table that was seated after us be greeted, have their drink orders taken, and probably got the orders in\n-  decided that enough was enough, and got up and left\n\nAs we walked out, the hostess that sat us asked what was wrong, and we told her about the service, or lack thereof, that we received and promises that the issue would be addressed with the manager.  While the words somewhat satisfied with the response, I was really disappointed that we more or less ignored.", "name": "Chili's", "rating": 1}, {"index": 253, "review": "Got \"To Go\" for lunch for coworkers.  Salads were sparse and unimpressive to say the least.  This was also true with the fry's that came in the lunch combos.  To go meals should be equal to in house meals.", "name": "Chili's", "rating": 1}, {"index": 254, "review": "Off of the 87, this spot is located in a nice, good size plaza with plenty of parking.  When we entered we sat at the bar area, the table was still wet.. as i put my purse down.. GROSS! But besides that, the waiter came took our drink order, recommended the happy hour drinks all night along with happy hour appetizers.  They have the 2 for 1 deal (1 appetizer, 2 entrees) We ordered the half texas cheese fries (the fries were old), I had the bacon cheese burger (no cheese).  That was actually pretty good.  Jay B. had the half order original baby back ribs with a full baked potato. Rinsed down with Coors Light and Blue Moon.  YUM!!! Waiter never came back to refill our water.. or to check up on us.  Not GOOD! Sorry Chili's i'd rather go to the one near East Ridge Mall.  More Live, esp during a game! =)", "name": "Chili's", "rating": 2}, {"index": 255, "review": "par tex mex food, been here a few times with consistent experiences.  never had a horrible time, or extremely great time.  \n\nfajita's with a beer is the best!", "name": "Chili's", "rating": 3}, {"index": 256, "review": "So, out of all the Chili's in the San Jose area, I like this location the best. The food always comes out fast and good. I always get the Oldtimer Cheeseburger, at any Chili's location, and this location always gets my \"medium well\" order right. It's never too overdone; its always just right. The fries are cooked just perfectly, whenever we come to eat here. \n\nThe one factor that separates this location from any other Chili's is that it's never really busy, at least at the times we dine here. The service is fast and refills come out in perfect timing, right when you're running low.\n\nIf you like talkative servers, you won't really like this place because they're really just around to serve you. My boyfriend doesn't like \"in your face,\" talkative servers so this place is perfect for us. Our servers, whenever we come here, do what they need to do--take our order, refill our drinks, check on us & see how we're doing with our food.\n\nI still have yet to try one of their special presidente margaritas. I will though, and when I do, I'll update my review.", "name": "Chili's", "rating": 4}, {"index": 257, "review": "Horrible Horrible! \nAte there this past monday for lunch with 2 other colleagues. All three of us got the stomach flu. I missed work for 3 days and so did my colleagues. Hospital told us it was a stomach virus or bacteria! I called the manager Shawn at the location to inform him of the situation and he didn't even offer an apology. He said, \"cool, we'll put it in our log.\"\nThe nerve of these guys, where we all missed work, spent money on hospital visits and prescription medication, and 3 days of excruciating pain. \nHonestly, I did not want any compensation or anything, just an apology and steps to find out what might have happened to prevent future cases like that, but I guess, it is only deserving of a cool thanks man and a notation in a log. Which by the way I told him I was calling to inform him in case they keep a log of stuff like that.\nI recommend a restaurant that cares about its customers even if it doesn't take pride in the taste, they should have the human decency to ensure the safety of its patrons.", "name": "Chili's", "rating": 1}, {"index": 258, "review": "It's Chili's. Predictable, better than Applebees, and pretty good for a chain restaurant. Prices are reasonable. Food is generally good. The one thing that makes the experience at the Coleman location better than other locations was great service from Mimi. She was very attentive, friendly, and sweet. She provided us better service than I we have ever had at any Chili's. I would go back again and ask for Mimi!", "name": "Chili's", "rating": 4}, {"index": 259, "review": "The service was average and the nachos were crap. This location is average for just a simple bite, but the franchise is not as great as it once was. The fajita's I love and always ordered them, but this time I can say that the quality has gone down drastically, they skimp now :)", "name": "Chili's", "rating": 3}, {"index": 260, "review": "Starvinnngggggg....\n\nI swear my boyfriend and I can pick out any restaurant and never be acknowledge for DAYS by a spacey hostess. We stood at the door for quite some time and the stupid thing is that servers will walk by and smile and not do anything about it. But whatever it was a \"busy\" Sunday night.. NOT\n\nFood was ok, Server was eh... decent. Even though we sat in the bar section because no one decided to seat us I didn't expect bar quality service. And I mean bar quality service as: fast talking, stressed out server, food that comes out really late, ribs before appetizer? yes, no refills of water and barely any eye contact from the server with his what... 4 tables running around. 4 tables.. I can do that asleep..", "name": "Chili's", "rating": 3}, {"index": 261, "review": "I am in this area alot, and when all else fails we go to Chili's. Sometimes they forget to put the syrup in the mango/blackberry iced tea and we've had to ask for many times. Usually pretty fast service, and the food is always great.", "name": "Chili's", "rating": 4}, {"index": 262, "review": "The place seems to be undergoing a renovation, it seems like the place will look much nicer once it is finished. \n\nThe biggest improvement though has been the service, so I'm giving them one extra star for now. The service was excellent when I went there on Saturday, and I hope it is not just  a temporary push they are doing while the place is undergoing renovations. A few more times with service like this and I will consider giving 4 stars.\n\nTo be honest the bad service in January had kept me from coming back here for 4 months, so I don't know how recent all the changes are, but I hope they are here to stay.", "name": "Chili's", "rating": 3}, {"index": 263, "review": "Our server, Anthony J., was \"Da Bomb!\" he was warm, funny and attentive while we loitered for 2 hours. Our group was from out of town and had A LOT of time to kill and we had nowhere to go. Anthony made us feel welcome and continued to fill our chips and drinks the entire time. I wish all our servers could be like just like him. He's in my top 5 servers category. Thanks Anthony!", "name": "Chili's", "rating": 4}, {"index": 264, "review": "I may be in the minority but I always get exceptional service here.\n\nI only go about once a month or so, but every time I went I felt really comfortable. I've gone when it was really busy and when it was really slow. Not much of a difference in service (at least if you get the waitresses). \n\nMost of the time I order either country-fried chicken crispers or big bites (kinda like a bacon cheeseburger sliced into portions with piled onion rings). They are more than enough to fill one's stomach up. The fries are a bit salty but you can always tell them to go easy on the salt. The iced tea is great, as I'm always varying between blackberry and mango. Their strawberry lemonade is also satisfying if you've got the sweet tooth for it.\n\nConvenient location in a shopping area, and if you don't feel like Chili's there are numerous restaurants within walking distance from Chili's. However I don't really find myself going anywhere else in the area.\n\nNOTE: Tell your waitress you accidentally gave her your ex-girlfriend's credit card to pay the tab off. Funny reaction guaranteed.", "name": "Chili's", "rating": 4}, {"index": 265, "review": "Try your luck at another chili's. Frequent this place often due to it being so close to my home and wait time is usually minimal. Unfortunately you pay for it when you wait for your food. All I can say is ...expect to wait Fooorrrever for your food! I can't count the number of times that we have visited this place and had our food come out at different times, come out cold or just simply wait forever for it to come out. I've had much better experiences at other chili's but for some reason this one is just way to slow in getting food out in time.", "name": "Chili's", "rating": 2}, {"index": 266, "review": "Same as all chilis, however gets 3 stars simply because of the hours they close at 11:00...really?... why when they are in a huge plaza filled with other restaurants and stores? Not to mention is near campus..It would get 5 stars otherwise..Love the Margs and the fajaitas!!!", "name": "Chili's", "rating": 3}, {"index": 267, "review": "I will keep this short due since we didn't stay to eat our meals.\nArrived after the lunch rush and sat at a \"somewhat\" dingy table in the bar area. it was the only available table that looked \"somewhat\" clean.\nNoticed salsa on my silverware. No biggie... toss those aside.\nOrdered food from a friendly server that made it clear he was just helping out. Ok, I can live with that.\nReceive our waters in dirty plastic mugs. Now I'm getting worried... new waters were provided by the less than charismatic bartender in clean class mugs. Problem solved.\nTortilla soup arrives. Cold with an ice cream sized scoop of avocado and extra large lime wedge. Sent it back and received a very average cup of warm soup. See the trend developing???\nAbout a half hour has passed since we placed our orders when we receive our identical lunch meals. One is steaming, one is cold. Both we made incorrectly. Decided to cut our losses and walked out.\nI used to love Chili's. Now it's a last resort. Ughh.", "name": "Chili's", "rating": 1}, {"index": 268, "review": "We all know how Chili's food is so whatever...\n\nWe came here one late night after picking up our daughter from Grandma's.  We needed a late snack so we decided to go for a Triple Play platter.  \n\nWe were seated instantly which was great, but having to wait 10 minutes for your server, not so great.  I looked around to see and well hmmm...nope wasn't busy in the restaurant area. \n\nWe finally met our server and he got our meal ready to fire up on the grill or stove..WHATEVER...\n\nThen it came another 15 minutes after.  Okay damn can you say nearly on starvation mode.  I mean cool it took long if it was a large ass meal.  But it was one plate.  I guess it took him a while to figure out how to carry out.  \n\nI dont mean to sound like a bitch, but c'mon with 6 tables full of people in the entire restaurant during that time and 3 servers running around to service those tables.  Our server was a bit rude and inconsiderate.  I wonder if it was because we looked like teenagers with a 4 year old (damn us asian folks age well.)\n\nI don't think it was necessary to take that long.  I know how it feels like to work long days, but you still gotta treat people as if they were your first table of the day.", "name": "Chili's", "rating": 2}, {"index": 269, "review": "Lately, this place has been headed downhill at a faster rate than our economy. My coworkers and I often order takeout for work and they almost always screw up at least one person's order. (Yeah, we keep getting free entrees/vouchers, but still...)\nWhat really killed it was when I ordered a triple dipper with southwestern eggrolls, spinach and artichoke dip, and chicken fingers. Umm, when my order arrived, there were two different kinds of wings with only four measly pieces per flavor. The chicken fingers were oozing with oil. Oh right, and the wing bites were hard as rocks as if the chicken had been extremely old. I just threw everything out.\nOn a separate occasion, a coworker ordered a triple item fajita special  since it is one of the only menu items that includes shrimp (her favorite). When she opened her box up, the shrimp were completely missing.\nThat, and their condiments are not paired up with orders consistently. UGH. Fail.\nEmployees, however, were friendly and eager to somehow repair mistakes...bump to two stars.", "name": "Chili's", "rating": 2}, {"index": 270, "review": "This Chili's is a reliable place to drop into for a quick drink or two and some decent appetizers; it is nice to be reasonably assured that the food will be decent and the service prompt and good.   Most of the times we've been there, we've eaten in the bar.    We'll definitely go back.", "name": "Chili's", "rating": 4}, {"index": 271, "review": "Its Chilis not much more to say than normal overly fried food full of grease and sodium.\n\nWe chose not to partake in main food but did have some chips which of course were the side to the pile of salt they were served with.\n\nPicked up a few margaritas and substituted some Herradera instead of the normal tequila which worked out great since it was happy hour so the cost only came out to be 50 cents more.  They were better than most chain margaritas that are watered down and over priced.\n\nService this time around was actually a bit slow as our waitress took awhile to take our order and to check on us when she actually did.  It actually took some time to even get her attention since my gf and I were taking off early.  \n\nThe funny part is our friend we were meeting up later that night had left chili's only minutes before we arrived.  I always like to randomly run into people too bad we missed you EVA!!!", "name": "Chili's", "rating": 3}, {"index": 272, "review": "Wow - simply the worst service I've had in years. Where to begin, I guess with a positive, was seated very quickly in a section that was nearly empty except for us (maybe 3 other tables split between 2 servers). There was an ominous sign when we waited 15 minutes for our server to say \"hello\" (not that she hadn't wordlessly walked by us many times in that period). \n\nDrinks came from the bar, eventually, but without glassware for the IBC root beer we love so much. Waited another nearly 10 minutes before walking to the bar myself to get glasses. \n\nWe made 1 special request with the food (to leave out 1 ingredient), when the food finally arrived (did I mention our section had filled in the meanwhile and other tables who were seated 25 minutes after us were well into their meals) it was of course - wrong. \n\nServer set it down, didn't even notice it was wrong. I said - \"of course you know that will be going back\" at which point she looked down and realized the error.  No apology, no I'm sorry, no rush to fix it.  I thought at this point it would be wise to let the manager what had been going on. \n\nHe was unsympathetic and basically accused me of causing the problem (huh???  I'm not sure exactly what I did to cause the server to ignore me, forget to bring glasses, wait 10 minutes to get them and then mess up my food order).  \n\nThe food itself may have been good - who could tell after all the drama.  Basically we just shoved it down and tried to get out as quickly as possible.  \n\nTo be fair I've had other last problematic experiences here.  But I just can't accept having the manager side with his server in the face of clear errors.  Sorry Chili's I won't be back.", "name": "Chili's", "rating": 1}, {"index": 273, "review": "As a college student, quick, affordable, and delicious food is hard to come by. Generally, one of those preferred qualities gets sacrificed for the benefit of convenience or taste. With Chili's, I never have to worry about making any sacrifices. The service is quick, especially ordering To Go. The fact that they accept my university access card for purchases just makes it that much easier. Oh, and did I mention that the burgers are amazing? Not to mention the ribs and appetizers...", "name": "Chili's", "rating": 5}, {"index": 274, "review": "Okay, so first... I give this place a two-star rating ONLY because of the server. He seemed to be a tad spacey at times, but was constantly checking in on us, had an appropriately cheerful attitude, and was fairly prompt when it came to bringing us our food.\n\nThe reason this restaurant would have received a single-star rating is due to the lacking quality in food. For $30, it would have been nice to have decent food.\n\n My mom and I decided we would do the 3 for $20 deal, and started off the meal with a 1/2 order of the cheese fries... which I must add, were mediocre and luke-warm.\n\nNext, I decided to get the buffalo ranch chicken sandwich. This sandwich actually came with surprisingly soft bread, but no spice, which is something I would expect when the word buffalo is in the name. I ended my experience with a side of heartburn, something I am never fond of.\n\nMy mom ordered the chicken fried steak, and ended up with chicken rubber steak. Usually she rather enjoys getting chicken fried steak from where we go, but this time around she had an incredibly difficult time trying to cut it, and the gravy that was on top was gloppy and unsatisfying. The only decent things on her plate were the corn and the mashed potatoes. Needless to say, she was unhappy with her order.\n\nTo end our meal, we decided upon the white chocolate molten lava cake. When you order a lava cake, you typically expect there to be \"lava\" in the center, so that as it is cut it expands all over the plate. This was nothing like what we expected, and ended up with an extremely mushy cake, and a minimal amount of filling in the center. Also, it tasted of nothing but sugar, and left little to be desired after the first few bites. It seems that the ice cream was the only tasty part of this dessert.\n\nI would like to say that we had a pleasant experience, as it was our first time eating at this establishment, but that would be a lie. We hope that whoever else decides to eat here has a better experience than we did.\n\n-El", "name": "Chili's", "rating": 2}, {"index": 275, "review": "I like Chili's in general.  This place was clean and had good customer service.  They take care of the kiddies with coloring stuff which can be a life-saver.  The food isn't the healthiest (they do have healthy options though), but it's consistently good.  Full bar if you're in the mood for drinks too.", "name": "Chili's", "rating": 4}, {"index": 276, "review": "A consistently decent Chili's franchise.\n\nThis location, adjacent to downtown's businesses and newer high-rise residences, is a welcome change of scenery from either the Milpitas Chili's (*cough*ghettofab*) or the Eastridge Chili's (*cough*ghetto.period*).\n\nAside: Saw Cristina I.  Hi, Cristina!  Ladies (and gents), visit her at Blu Cocoon Med Spa, located in close proximity to this Chili's! [http://www.yelp.com/biz/blu-cocoon-med-spa-san-jose#hrid:MKhp8pVDtPIWpcralYXPYA/query:blu%20cocoon]\n\nOn a number of post-work occasions, we've stopped in here for casual, midweek dinner/drinks.  It is a familiar chain, of course, so culinary appeal is \"wow\"less with over-glazed, over-sweetened, over-spiced outings of faux-TexMex.  The trade off being an uncomplicated sit-down affair where company is the focus (and isn't great company ALWAYS the focus?).\n\nMy lab partners were treated to lunch and a half day here on Friday.  The restaurant (and bar) is particularly busy from 11:00-2:00, but our group of 10 were promptly seated and tended to by the waitstaff.  At 2:30ish, after the third beer had been spill't and a schooner shattered, you would think they would have kicked us out, but no... instead, some towels were brought out and the spill'd beer was refilled.\n\nAh, low-maintenance, inexpensive, and easy.  Like me.  Er, I mean, me likes.\n______________________________\n...day-long drunken girls!!  Saw a trio of lunchtime lushes who I would again run into at Jack's [http://www.yelp.com/biz/jacks-bar-and-lounge-san-jose#hrid:wnsy1oKhvtlF2kFGtnOYfw] later that night.", "name": "Chili's", "rating": 3}, {"index": 277, "review": "I come here every once in a while when I'm in the mood for some greasy, salty food and a cold beer on tap.  The food is consistently so-so, the service depends on which section you're sitting in.  Your best bet is to sit at the bar.  That way, you get your drinks refilled fast and you can watch TV instead of listening to your date drone on and on about the latest tech stuff.\n\nI really wish they'd replace that Widmer crap with a different beer!   And if you're looking for something healthy on the menu, you'll need to get back in the car and head to a different restaurant.", "name": "Chili's", "rating": 3}, {"index": 278, "review": "I went here for their \"Tip-A-Cop\" fund raiser day for the special Olympics. Seating was fast as well as service. It took about 10 minutes for our food to be brought out (there were about 6 of us). So overall a very good dinning experience. \n\noh and service was friendly and quick. I tried the Chicken ranch sandwich and it was perfect. Mild and well cooked.", "name": "Chili's", "rating": 4}, {"index": 279, "review": "love this place. i've had great food every single time. each entree is very filling and large portions!\ni got the turkey sandwich combo that came with fries and a salad. yummy and healthy salad that i get to choose how much dressing i want. the fries were ok. the sandwich was only half a sandwich and seems healthy but it was rather high in calories.\nlast time, i think i had their cheese fries with bacon. it was ok.\nanother time, i had steak with loaded mashed potatoes, broccolis, and a garlic toast. the steak was light on taste, it needs more sauce.", "name": "Chili's", "rating": 4}, {"index": 280, "review": "\"I want my baby back, baby back, baby back *chilis, baby back ribs*  BARBEQUE SAUCE\"\n\nCan you believe it's been about 10 years since that jingle came out?  Thanks N'SYNC for making it so catchy.\n\nAs I was eating here, I was thinking of a commercial they should shoot.  Bear with me here.\n\nScene: There is a sign for auditions.  You hear some female groups singing the previously mentioned jingle.  They're borking, blah.  It then cuts to the judges, amazingly N'SYNC.  they call in the next group.\n\nOK, so I can't think of any amazing female group (Spice girls, Destiny's child...) but let's just say Danity Kane walks in.  They start singing the song like they mean it; dancing all seductive like, practically moaning the song, close up of their 'come-hither eyes'.  you know the deal.  that audrey is hot btw.  she's the shorter one.\n\nthen the camera slowly pans across the judging table.  you see joey, chris, jc. and justin (yes, I'm ashamed to admit I know their first names) all drooling over the girls.  they're mezmorized and say 'yeah.... this is great'.  Then Lance is at the end of the table, face down eating the ribs and he says 'yeah, they are great'\n\nit's funny, you know, cuz the ribs are that good.  and lance, well, you know...\n\nAlrighty.  For an appetizer, we had the fries with cheese, bacon, and jalepenos.  I didn't order it, so I forgot what they were called.  They were tasty though, kinda like loaded skins, but fries instead.  I ordered the sliders with a side of fries.  The sliders were good, but the onion strings that came with them were a little soggy.  The service was a little slow on the refills, but they caught up once all the food came out.\n\nFor dessert, the team ordered the molten lava cake (appropriate because they work for Magma).  There was one with white cake and another with chocolate cake.  Both delicious.\n\nif chili's ever was to produce my commercial, i wouldn't need to be paid.  I'll take a lifetime pass to any chilis.  Thanks mr/mrs. vp of marketing.", "name": "Chili's", "rating": 4}, {"index": 281, "review": "Chili's used to be a decent place to get a good burger, or wings but its time has definitely passed. \n\nUnfortunately, my 6-year old loves the place, so every so often we indulge her -- she gets the Kraft Macaroni and Cheese, which is exactly as advertised -- its the same stuff you make at home for 99 cents. \n\nI've danced all around the menu looking for something decent, but I surrender. Other than the molten chocolate cake, everything here is exceptionally mediocre. \n\nAnd, for a place that tries to be sort-of Mex, their tequila selection is embarrassing.", "name": "Chili's", "rating": 2}, {"index": 282, "review": "I like to come to Chillis for the honey chipotle chicken crispers, the sotheasern eggrolls, and the molten lava cake. Thats about it though. The food is really not good for you so I don't come here often but every once in awhile it calls to me. mmmmm.", "name": "Chili's", "rating": 3}, {"index": 283, "review": "Something about Chili's has me going back all the time.  Not necessarily because the food is amazing, but something about their food is comforting to my stomach. It's great when you're craving some fattening and quick fare.  Also, I personally prefer Chili's over Applebee's or any of the other chain restaurants that are sort of at the same level as Chili's.  Hey, sometimes you just need a cheaper meal or somewhere chill to just get some grub with a friend.\n\nThe drinks here aren't bad either.  The Margaritas are huge!  Usually I would give Chili's 3 stars since I've usually gotten good service.  However, I came in yesterday with a friend and our server just wasn't that great.  I was surprised to notice that the hostesses were opening doors for incoming and leaving customers.. Nice touch.", "name": "Chili's", "rating": 2}, {"index": 284, "review": "YOU GOT RID OF YOUR BROCCOLI CHEESE SOUP!!!! NO GOOD CHILIS, NO GOOD! It was the best I have ever found, on a food pedestal really and now I am gravely disappointed!", "name": "Chili's", "rating": 2}, {"index": 285, "review": "This is my second visit to this location. The first time was during lunch on a Monday afternoon so it wasn't busy. Second time was on a Friday. It was a madhouse. We came around 6:30 and the place was packed. Thankfully, someone in our party got there early and had a table waiting for us, so we just walked right in. \n\nAnyway, I just wanted to comment on a few disappointing menu changes. In the appetizer section, they no longer have the spinach and artichoke dip, fried cheese, or the Chili's equivalent to Outback's \"Awesome Blossom\". I don't think they have the bottomless tostada chips and salsa anymore either, I didn't see it on the menu. They haven't had their new menus made yet, so we were ordering things and kept getting shot down. They NOW have buffalo chicken quesadillas, buffalo shrimp, honey chipotle chicken, onion strings, and a few other things I can't remember.   \n\nService was a bit spotty. Our server went on his 'dinner break' never to be seen again, and our new server was a bit slow in the essentials like bringing out refills and clean plates and utensils. It's all good though, no hard feelings cuz she didn't really make much money off our table since all we ordered were sodas and appetizers. I'll give this a 3 because it was average service, but I'd come back again.", "name": "Chili's", "rating": 3}, {"index": 286, "review": "I go to this Chili's at least once a month.  I love their ribs, steaks, and these days...  the guiltless grill(still gotta watch the sodium though).  Also, in comparison to other Chili's restaurants in the area, their meals seem to taste much better!\n\n One thing about this place that bothers me is that even though the place is quite empty when I go, I don't really get much service throughout the meal.  I constantly see the service staff chatting on the side while I want to order, want a refill, or want to pay.  The staff is usually VERY friendly, but tend to ignore the needs of their guests.", "name": "Chili's", "rating": 3}, {"index": 287, "review": "My husband and I are great fans of Chili's and with 3 Chili's restaurants near by we couldn't be happier. Food is always good quality and the staff is friendly and prompt. We have never had an issue but when we noticed others do so we see them quickly and effectively resolved. We love Chili's :)", "name": "Chili's", "rating": 4}, {"index": 288, "review": "Been here a few times in the past few months and so far the only employee I was satisfied with was Erica. She was nice, took our oder down correctly and quick, my family and I never had to ask for refills she always made sure our cups were filled. The last time we ate there though, service was pretty slow and I think the food was bad or something, both my kids and another family threw up with in just an hour of leaving the place. Later that night when I warmed up my left-overs my daughter's pizza smelled like rotten cheese, which why I was guessing that they threw up from the food they ate.", "name": "Chili's", "rating": 3}, {"index": 289, "review": "This 4 star is to our server, Justin. \n\nJustin -- thanks for taking care of us and ordering all the drinks we wanted & the food to soak up our liquor. I didn't realize that my friend & I spent 4 hours on a Friday night at Chili's b/c we were chatting the night away. Also, thanks for the special service. You're awesome!\n\nI hope you serve us again after a rough day at work.", "name": "Chili's", "rating": 4}, {"index": 290, "review": "Usually pretty good and a standby for dinner.  Serve is usually friendly and fast and the food is decently good. My boyfriend loves the big mouth bites, and I like the chicken crispers with honey mustard. I also love Love LOVE their chicken enchalida soup. OMG it is sssssssssooooooooooooo good. Perfect flavor and creaminess. And mmm mmm mmm mango margaritas. Usually I would give it a four star, but read on.....\n\nSadly tonight was pretty bad. I ordered the chicken tacos. Everything was just luke warm and what the HECK is that on my taco?! Stuck to the outside of my tortilla is a piece of ground sausage. WTF?! Gross! At this point I stop eating my lukewarm tacos and eat my lukewarm beans, which are tasty, even if they are, I repeat, lukewarm. I also picked some fries off my boyfriends plate, which are only slightly warmer then my food and are just average tasting, but he loves them. I'll still be back since it provides a usually pretty good meal and a decent price.", "name": "Chili's", "rating": 3}, {"index": 291, "review": "We went to Chilli's tonight and it took over an hour for our order to be taken.  When a drink was ordered it was either forgotten, or 20 mintues late.  We had to ask repeatedly  to have  our water glasses refilled.  I had to go find my own box for left overs.  We had called ahead because we had a party of 26, but they set up a table for only 20 so part of our group had to sit by themselves.( there was room to add tables which was not  done).  The bill although we were told the whole group would be together, came in 3 parts, with the meals mixed up betwween the several tickets.  There was not any order to how they were listed on the seperate bills.  When our order was taken some of the food came out cold, and some too hot.  The we had to find someone to even give us the bill.  \nThe service was bad, we were ignored, the food was less then good, Chili's please try harder I have eaten at your store in south San Jose which is always busy and always has good servcie.", "name": "Chili's", "rating": 1}, {"index": 292, "review": "Nothing spectacular about the food here- but if you are hungry and not feeling MC D's, then Chili's will hit the spot. The chicken fried steak dinner with mashed potatoes, corn on the cobb, and garlic toast is BOMB! I could only eat a quarter of it because the portion was so large! Not bad for $9.99. My daughter ordered a burger from the kids menu and it was as large as an adult burger! I liked the fact that our family of four ate for under $30.00. We ordered our food through take out, but our food was hot and fresh. I was amazed at how crispy the chicken fried steak stayed on the trip home. They got our order right, and service was great. On certain nights, this is enough for me! I'm easy to please!", "name": "Chili's", "rating": 3}, {"index": 293, "review": "First of all I want to state I am a huge fan of Chili's.  This particular location though just wasn't up there in ratings like my other two favs are.  \nReason....I think the cook was having an off day.  My fav dish is the chicken crispers country style.  I got a plate that looked like a mix of the original crispers and the country style.  Which I would have let slide if it didn't appear that the food was cooked so long or sat under a warmer for too long that it was tough to bite into.  To prove my point I showed our server how difficult it was to pull the meat apart. So I got a second plate that was about 50% better.  Only 3 of the pieces appeared to cooked too long and 2 were good enough to eat.  I actually wondered if the other 3 piece came off of the original plate.  Food wise...I will stick with my regular Chili's on the other side of town.\n\nThe food should have only been given a 1 star but I had to give 3 for two reasons.  One, we got seated immediately @ 5:30 PM on Valentines Day.  Two, despite the barely decent dish the server really tried to make things right but he's not the cook so he could only so much.", "name": "Chili's", "rating": 3}, {"index": 294, "review": "It's always funny when people give these big chain restaurants bad reviews. Come on guys, what do you expect? \n\nI'm still giving this place 4 stars. Why? Well, I can't help it. I've been here twice since it opened about a month back and have had GREAT experiences both times. Maybe we were just really lucky.\n\nI've tried two different burgers (both times I just ate the toasted bread -- yum and took the pattie home), the baby back ribs (which were eh..) and the steak fajiltas (with lots of grilled onions, yum!). \n\nThe four stars are: \n- cuz they don't skimp on the strawberry lemonade refills. I don't even have to finish my glass before they ask if I want another. My record is four glasses.  \n- cuz when I'm hungry after 10pm, I don't have to choose between getting dressed up to go to the lounges/bars in downtown SJ or \"slumming it\" at Denny's. \n- cuz both times they've had GREAT service. I didn't have to wait (once at 7pm on a Saturday, once at 9:30pm on a Friday) to get a seat. Plus, they have \"call ahead\" seating. \n- cuz they're so close to home. There's nothing like the convenience of having somewhere to eat that's so close.", "name": "Chili's", "rating": 4}, {"index": 295, "review": "I LOVE this place!! The steak fajitas, chips n salsa with a delicious strawberry daquiri! Yummy! Oh n I can't forget the awesome artichoke dip!! The service is sort of hit or miss, but for the most part its ok.", "name": "Chili's", "rating": 4}, {"index": 296, "review": "What can you expect from Chili's? Not too much. I always leave feeling pudgy and uncomfortably full; stomach full of grease. I've learned to stick to the cheeseburgers, because every other time I stray, I end up feeling really unsatisfied and angry I decided on this place to eat. In my most recent trip, I got the smokehouse burger without bacon. I really liked the sauce -- I'm normally not a fan of bbq sauce, but it was slightly sweeter and had a different twist. The onion ring strips were also a nice touch (although weary at first), because it added a nice texture and the flavoring was pretty subtle. The burger was juicy, it was definitely better than places like Peggy Sue's. I also had a frozen mango-strawberry margarita with my food. I couldn't really taste the mango, but I definitely could taste the tequila. It wasn't bad.", "name": "Chili's", "rating": 3}, {"index": 297, "review": "I've been to Chili's many many times. With a full bar how can you go wrong with an after work drink? My favorite is the Presidente Margarita. They give you the shaker so you can refill your glass. The glasses are never big enough for me!! \n\nI usually order the fajita quesdillas or a burger. Tonight I decided to go with the honey BBQ baby back ribs. HELLO TO MY NEW FAVORITE!!! They were perfectly done plenty of meat on the bone and still tender. It wasn't drowning in BBQ but there was still enough to need a wet nap afterward. It comes with 2 sides and I'm now a fan of their mashed potatoes as well. \n\nWe went on a Friday night probably in the 7-8pm window and were seated right away. The service was good. Nothing exceptional. Our waiter was a bit soft spoken  but was always around when we needed something. Its a nice place to kick back and have a margartia and some good food.", "name": "Chili's", "rating": 4}, {"index": 298, "review": "So I didn't actually get to eat here but I did try to call in a phone order and I sat on hold for over 12 minutes.  I know times are tough but if you don't want my business just tell me when you pick up the phone.  I ended up spending my money at the Chevy's next door!  What bad customer service!", "name": "Chili's", "rating": 1}, {"index": 299, "review": "I almost always get ribs here and frequently get them lukewarm.  Generally, the service and decent and they have plenty of self seating if you don't want to wait for a dining room table.\n\nFood isn't great but it's a great choice if you can't think of any other place to eat.  It's basic and comfortable, but nothing more.", "name": "Chili's", "rating": 3}, {"index": 300, "review": "I come here now and then and usually sit at the self service tables. Service, i.e. waiter/waitress.. is hit or miss.. some nights the person greets you like within seconds sitting down even though its a busy night..  other times you have to wait minutes when theres only 2 or 3 other tables occupied...\n\nI come here basically for one dish and one dish only..honey chipotle chicken crispers.. if you have no idea what to get and get this one..  at the end if you have room for desert order a chewy chocolate chip paradise..", "name": "Chili's", "rating": 3}, {"index": 301, "review": "The Coleman Ave. Chili's has friendly employees and our order is consistently right.  I have certain nutritional restrictions and don't have a problem ordering here and having it come back right almost every time.  If there is a mistake, they fix it without attitude.", "name": "Chili's", "rating": 4}, {"index": 302, "review": "Came here last night with friends after work. We got here at 10:20 and I felt really bad because they close at 10:30 which I didn't know since the Chili's I work at closes at 11. The service was alright. You could totally tell the server was ready to get out of there. Our food didn't take too long but the server was nowhere to be found most of the time. We tipped him well just because we felt bad for coming in so late, not for his \"great\" service. He messed up my friend's salad and took forever to grab simple things like ranch and iced tea. Again, I think he was just ready to go home, so I would go back to see if the service is any better earlier in the day.", "name": "Chili's", "rating": 3}, {"index": 303, "review": "Why is everyone hatin? lol Chilis is pretty good. \n\nI love their chips and salsa and my BF always gets the queso which I'm not to fond of. Their burgers are delicious and their quesadillas are good. I like their Caesar Salad but with their chipotle ranch dressing. And its a LOT of food! \n\nThis location is really clean and its not ever that busy. I went last weekend to watch a sharks game at the bar and waited 10 minutes for a booth. Overall I really like this Chili's.", "name": "Chili's", "rating": 5}, {"index": 304, "review": "I went here last week, hoping to get great service and good food. Err. I think not. The service was terrible. Once we got there we were greeted by the host who was chit-chatting outside and seated us 10 mins. later. We were just standing in waiting for somebody to seat us, there weren't any other servers around or even a lot of guest, so I don't get how this is so much trouble. Our server seemed really nice in the beginning always being attentive, but once it was time to get out bill it took forever for her to come back. I timed her and we were waiting for our bill for 20 mins. And she was doing the same as the host,  talking. Wow you can talk on you break or your lunch. What if I had to be somewhere, I was seriously about to walk out without even paying. This is was the worst restaurant experience ever!!", "name": "Chili's", "rating": 1}, {"index": 305, "review": "favorite local haunt, miss nate\nphoned in order at 1218, told it would be ready 10 -15 minutes\nwaited ten minutes and drove  over to pick up my to go order\nwent in, no record ,  then paper found . asked why order was \nplaced staff responded IDK\nnot sufficient, do you want to wait\nno thanks\nand left", "name": "Chili's", "rating": 2}, {"index": 306, "review": "By far the worst Chili's I've ever been to! I work in the same shopping center and usually some of my coworkers and I will come here for lunch or order to-go. Sitting down for lunch, they usually know we're here on lunch and in some what of a time crunch, yet they still take forever. To-go orders suck! I usually call ahead and yet when I come to pick up my food im standing around 5-10 minutes waiting for someone to notice me and ask if I need help. Never anyone there at the to-go counter and if there is a sign that says go to Bartenders about to-go orders, they are usually so rude! They need someone there at that counter all times of the day or a bell or something to let them know people are waiting! Today I decided to go in and just order there for to-go and the sign said go to bar about orders, the bartender and other staff were just all standing around talking and laughing, the bald bartender just kept glancing at me as I was reading the menu and never acknowledged me, stood around a few more minutes, got a few more glances and still no acknowledgement! Threw the menu on the table and left! Never will I order here again!", "name": "Chili's", "rating": 1}, {"index": 307, "review": "We were famished after being in the sun for a few hours and didnt want to travel far, so we went to the fail-proof plan of getting something at Coleman Market Center.\n\nWe chose Chili's over Chevy's because, well, i dont know why, probably because i Asked my friend, \"where would you rather go, Chili's or Chevy;s\"\n\nHe said chili's probably because that was the first placed mentioned.\n\nAnyhow, they are pretty busy for a friday evening and the hostess was cool enough to let us know that there was an empty booth by the bar, awesome!  Since i love having a view of the tv's to monitor whatever game i am missing from not being at home.... party of 4, good company, people around the bar area having a good times, lots of laughs and drinks flowing, good vibes....\n\n3 of us got the triple dipper - 3 apps for 9.99 - good price, 3 dipping sauces, man o man, i wasted all the ab and core work i did earlier in the day....\n\nIts been awhile since all of us had gotten together, so there was more focus on conversation, catching up on this and that - so the focus wasnt on the food but everything was fine, no one complained about their food, no one was overly pleased....\n\n\"I don't always drink beer, but when i do, i prefer dos equis\"\n\ndid you know that the most interesting man in the world has never lost a sock?\n\nThat was the last thing i heard before walking in, and yes, i ended up having 2 dos equis, hoping that my beard would fill in over night...", "name": "Chili's", "rating": 3}, {"index": 308, "review": "Cleaner and better looking than any of the older Chili's of course.\n\nI can't stay I'm too fond of this type of food but it's good when you want something better than fast food. \n\nTry their lettuce wraps with chicken and chestnuts. Yummy and low carb!\n\nMy boyfriend loves their sample where you can pick 3 items. It doesn't look that good on a plate and reminds of me Denny's. But fried food is what he likes..ew. Southwestern eggrolls are okay but everything is just fried! I cringe thinking about it.\n\nTheir drinks are yummy plus it's close to us so I guess it's alrite.", "name": "Chili's", "rating": 3}, {"index": 309, "review": "The sad part is that I do like Chili's.  I like the Americanized Mexican food.  I really do.  The have Fat Tire on tap, bottomless tortilla chips, good salads, good burgers, just some good, cheap and consistent food. \n\nI went here on opening weekend, and I would have given it -1 star.  Now that I have been there a few times, things have improved but there are still issues with both the seating and the arrangement of the place.\n\nIt feels like they forced an extra dozen tables into the place.  The bar is so cramped you think you're at a night club fighting for room to order a drink.  The in and out for the wait staff is also right here so you have people trying to carry food, bus tables, get a drink, find a seat, and talk all within the space of 40 square feet.  Also, the front door is facing Coleman, no where near where the patrons are parking.  \n\nI'm glad it's close, I'm glad it's here, I'm just not to glad on the interior of this particular location.", "name": "Chili's", "rating": 3}, {"index": 310, "review": "Our favorite Chili's!! Fast and friendly service every time we go. The other day we went and there was a couple british guys bartending and they were hilarious. hope they are working next time!", "name": "Chili's", "rating": 5}, {"index": 311, "review": "One of the worst experiences ever at a restaurant. My wife and I walked into Chili's and were offered seating right away as no one else was waiting.  The hostess took us to a 2-top table. We noticed at least 6 larger open tables- 3 4-top and 3 6-top.  We requested a 4-top. The hostess indicated that they were busy and could not accommodate this. I showed her the several open tables but she refused to seat us.  We walked out and went to Chevy's a few stores down. Chevy's was happy to seat us in a 4-top booth. Wondering how Chili's stays in business with such poor regard for its customers.", "name": "Chili's", "rating": 1}, {"index": 312, "review": "chili's is a family friendly restaurant! great food and its great for making that money stretch! you wont put a dent in your wallet! the enchallada soup is the bomb! and if you watching your calories...you can order \"guiltless\" style! the chips and salsa are the bomb~ they have great lunch specials as well as the 2 for $20 dinners! score!!!", "name": "Chili's", "rating": 5}, {"index": 313, "review": "went to chili's for lunch today with a couple of co-workers, food okay service was god awful don't know if the waiter didn't liked latina woman or what, we placed our order, order came out, didn't ask if we needed anything else I had to flag down another wait staff to get some hot sauce. but he sure did asked the table next to us and across from us if everything was good or if they needed anything.  our bill 36.00 tip A BIG FAT 0. I never had a problem there and if I do go again I'll make sure i won't get that joke of a waiter.", "name": "Chili's", "rating": 1}, {"index": 314, "review": "We were starving and decided to run into Chili's for lunch before heading into Target. I haven't been into a Chili's in a long time and the number of different entrees offered on the menu made it difficult to decide what to order. Eventually I chose the Southern bacon burger, it was pretty good though I wish they had seasoned the hamburger patty a little more. The only downside to my burger was the size, it was so big I couldn't fit it in my mouth and I ended up eating it with my fork and knife. Our server was friendly and kept my diet coke refills coming, no complaints there. I wouldn't go out of my way to eat here, but as a pre/post shopping stop this isn't a bad option.", "name": "Chili's", "rating": 3}, {"index": 315, "review": "can you say \"waiter. .there's a fucking COCKROACH in my dessert!!!!!\"\n\nCOCKROACH COCKROACH COCKROACH COCKROACH COCKROACH COCKROACH COCKROACH  COCKROACH\n\ndon't eat at this Chili!!!!!\n\nGot a dead fucking cockroach in my dessert this past sunday. .it was in the peanut toppings partially covered in carmel and chocolate syrup.\n\nI normally do not eat at Chilis because it's just not what I would consider as good food.. I was just using a giftcard I received.\n\nToo bad YELP doesn't have a \"CONTACT HEALTH DEPT\" as a rating.\n\nLucky for me, I know somone who is a Environmental Health Inspector. . .\n\nreported. . hopefully something will be done!", "name": "Chili's", "rating": 1}, {"index": 316, "review": "Came here for lunch hoping that it wouldnt be too busy. Man were we wrong. Thanks to  graduation season, this place was packed and the waiting list LONG. The hostess kept apologizing for the long wait, saying that it was hard to find a table for us, but I think the hostess forgot about us . We were a party of six, which compared to some of the other parties there, it wasnt that big.\n. Our appetizer came out last, from all the dishes that we orded... wth..? oh well..\ngot the soup and salad express lunch type meal hoping that it would come out quickly.. came out after the burgers and other dishes... \nthe food was good over all, just like most chilis...\nThe service was acceptable.. but not the best...", "name": "Chili's", "rating": 3}, {"index": 317, "review": "I added a star because I usually have at least two drinks when I come here.  I like bland, sugary, fatty, safe, american chain food once every couple weeks.\n\nBTW, that blue, fru-fru margarita glass is emasculating... ask for a mug.", "name": "Chili's", "rating": 4}, {"index": 318, "review": "The only thing good about this restaurant is the happy hour deals! The food is alright, but we mostly go there for cheap margaritas. \n\nOn one occasion, my boyfriend and I went in for dinner. We were seated and the chip guy brought us chips and salsa. We asked for water and the water NEVER came. No one checked on us for about 15-20 minutes. We watched as the waiters did their rounds to the nearby tables, skipping our table of course. We were just thinking that they were coming to our table next, but instead they just kept walking away. I finally got up and ask the guy at the bar if we can get some service. All he replied was \"oh really? no one came by\" when it was quite obvious no one did because he was standing there doing nothing right in front of our table. We waited another 10 minutes and still no waiter. Then we see one of the managers (I think or some one who worked there wearing slacks and a dress shirt) and the same bartender chatting away. The bartender took no action to get a waiter to our table. After about 25 minutes of no service, we get up and slam the menus in front of the manager standing by the bar and tell him that we waited for 15 minutes and they need to get it together. He looks at us surprised, doesn't say a word, and didn't offer to help us! So we walked out with our appetites lost and really pissed off. Previous to that last experience, the waiters/waitresses have been rude and many have attitudes with you when ordering. Since that experience, I have not returned to that restaurant. I don't think i'm missing much anyways..", "name": "Chili's", "rating": 1}, {"index": 319, "review": "I'm not a big fan of Chili's to begin with, but it's hard to agree on a restaurant that my fiance's parents will like, so we went to the one on Coleman ave recently to have dinner.  The service was pretty crappy that night - our waitress seemed really new, and we practically had to trip her to get her to refill our drinks and take her order.  It took at least 20 minutes - 30 minutes for us to get our food after received our appetizers, and our food was barely warm - I'm guessing she forgot about us, since she seemed a bit flustered and overwhelmed.  Then when it came to our tab, she got our tab confused with the next table, and it took half an hour for a couple of managers to get the tabs sorted out, and it took so long because she managed to split our tab instead of the other table's, and she put their cocktails on our tab (when we just had sodas).  Oy!", "name": "Chili's", "rating": 2}, {"index": 320, "review": "The food here isn't the best, but it's decent. Same goes for the service. When I come here I usually order fajitas or a burger just to be safe. If you're in the mood for a margarita, consider going to your local Chili's restaurant. Their top shelf margaritas are pretty damn good.", "name": "Chili's", "rating": 3}, {"index": 321, "review": "Chili's is consistent and you always know what you are going to get. I come here every once in a while. Usually when I can't think of any place else to go. As long as you get a server who is not a new-bee the experience is acceptable. There is just something to be said for consistency.", "name": "Chili's", "rating": 3}, {"index": 322, "review": "all i can say is...The ribs were fall off the bone excellent!!", "name": "Chili's", "rating": 5}, {"index": 323, "review": "Chilis is Chilis, what should I say?  I always order the peppercorn burger which is very salty but good.  On occasion the awesome blossom but it is only cooked well about 50% of the time.", "name": "Chili's", "rating": 3}, {"index": 324, "review": "Chilis is also one of my favorite places to go to that has variety. I went with my friend to this location and they sat us near the kitchen which i really dont like sitting by but didnt want to complain because the hostess already looked bitchy but whatever. The food was good as always. The service could of done better, our waiter never asked if we were doing okay or anything he only took our order than handed us the check, pfft!", "name": "Chili's", "rating": 3}, {"index": 325, "review": "Every time I dine here, I always get greeted and seated promptly by a host, and never have to wait long to place my order. My food always gets served in a timely manner, and it's always steaming hot! The wait staff always makes me comfortable, and checks up on me accordingly to make sure everything is okay. Chili's never fails to make my dining experience a pleasure!", "name": "Chili's", "rating": 5}, {"index": 326, "review": "cant believe chilis is out of their best appetitizer southwest eggrolls hopefully be back soon.  an order of eggrolls, several beers, and chocolate molten kake cant miss.", "name": "Chili's", "rating": 3}]