[{"index": 0, "review": "Overall good hot food. Nothing earth shattering though.\nWe went for their lunch buffet, which is either rice or noodles, plus two other sides  (from beef to chicken to tofu). Their walnut shrimp was pretty good. The beef and broccoli was too sweet. So I'd say too many dishes with sugar in them.\nYou can also order a la carte.\nWe were in and out in about five minutes. Be careful going here during the lunch hour rush. This place is surrounded by office buildings and gets busy as hell during it!\nNot sure we'll be back.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 1, "review": "Desperate for Chinese food in the North Santa Clara/San Jose area, this was the most reasonable place to try for the distance I was willing to travel. \n\nI walked in around 7-7:30pm (their closing time is 9pm) and everyone was already closing up. I looked at the selection and it was the most bizarre situation to look at. It was very obvious that for the 6-8 trays they had out, they scraped the portions to the center of the tray to somehow make it more appealing-- the meat colors were off, visibly dry texture, and clearly old. \n\nThe man could tell I was grossed out & ready to walk away, therefore he said I could order anything on the menu & they could make me a new portion in the back kitchen. \n\nCame home with my takeout and it was the most bland Chinese food I've ever tasted. I added a ton of soy sauce and chili oil just to have some taste to it, but really overall I'm disappointed in myself for even trying to eat it at all. \n\nMy takeaway is that I could have gone to Panda Express instead and been happier. Don't plan on returning ever again.", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 2, "review": "When I got there I had to double check they closed at 9pm because arrived there at 7:30pm and it looked like they were already shutting down. Half their menu wasn't available and what was ready looked like it had been sitting for hours. I understand making less food for less busy hours but if it gets to the point where it looks like you're closing, just reduce the open hours and close...\n\nPrice might seem low relative to the area, but the portions were so stingy that it actually made it fairly expensive.", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 3, "review": "I'm looking for a Chinese Fast Food replacement to Wong Kok .I thought UME Chinese Fast Food might be it ? WRONG !!!\n\nI rolled to Ume in my Work Whip to get Dinner . There's plenty of parking as Ume is located in a large strip mall. So I stashed my hip in the large Parking lot. \n\nI rolled in to Ume and looked at their Steam Table and was very disappointed . Not much of a selection and what was there looked a little old . \n\nThe Counterperson then told me I could order Ala carte  and they would cook my order fresh . \n\nSo I perused the Menu and ordered BBQ Pork Chow Fun to go. \n\nUme has a Good Size Dining area and a LCD TV for Entertainment . \n\nMy BBQ Pork Chow Fun  was ready in 15 minutes  . I looked at it and it was a Small Portion and they actually added Lettuce as a Filler !!!  LOL Who does that ??? Apparently Ume does !!! Very Disappointing !!!  It tasted ok . \n\nAverage Food at Best !! \n\nThis Baller On A Budget Wont be Back !!!", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 4, "review": "It's your typical Chinese fast food restaurant with the addition of a smoothie & boba tea menu (hence, the four star rating. One extra star for their effort in adding options you won't normally in a Chinese fast food restaurant).", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 5, "review": "I love Chinese food, and it's difficult to find a trustworthy and convenient establishment when you're commuting in the Bay Area. This is my usual chinese take out to go spot when I'm commuting back home from work, and their food is very tasty.....HOWEVER, after today I probably will never go back to this place, and here are my reasons....\n\n1. When I first stepped into the establishment I immediately had to use the restroom (I am totally aware of the rule of restrooms only being available for customers,) which is why I told the woman in the front that I intended to order something, after I use the bathroom. This led to her giving me a dirty look, and assume I was just going to walk out based on the look/vibe she gave me.\n\n2. Her attitude was not friendly at all. She looked as if she just wanted to close the shop and get everyone out of the establishment. I understand that employees work long hours, and are tired etc. but that does not excuse your behavior to be rude to loyal customers such as myself.\n\n3. When finally paying for my food, I gave her a $20 bill. She looked at me with suspicion, and when I asked her what the problem was, she replied with \"is this real?\" I responded with, \"I'm pretty sure, since I got it from the Bank of America across the street\". She then tries to debunk it by holding it in the air and marking it with pens and all these other legitimacy methods. At this point she is still not convinced, and another woman comes out from the back and asks what the problem was. The woman then says something about it being a counterfeit bill, and the woman from the back grabs the bill and immediately says it's real. She then rings me up and gives me my change. I AM VERY DISAPPOINTED WITH THE FACT THAT SHE DID NOT EVEN APOLOGIZE!\n\nIt is with great regret that I will most likely never return to this place ever again. Love the food, but this kind of treatment to customers is unacceptable.", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 6, "review": "great food! The beef and orange chicken are delicious! And people there is very nice.", "name": "Ume Chinese Fast Food", "rating": 5}, {"index": 7, "review": "Typical Chinese fast food, their food is sweet for some reason, even the kung pao chicken. \n\nLunch time food is probably better since this place is dead during dinner time  and the food doesn't turn over as fast\n\n\nI would only go here if I'm hungry and I'm too lazy to drive", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 8, "review": "The war won ton soup was excellent and the stuffed chicken is amazing, great staff fast and friendly", "name": "Ume Chinese Fast Food", "rating": 5}, {"index": 9, "review": "I tried the egg noodle soup. The BBQ pork was just a big blob of fat. There were hardly any egg noodles to eat. I went there after about 4 months just to see if things have changed. It has gotten worse. Least said the better. They are clueless on how to attract and keep their customers. Meh...", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 10, "review": "Never again..\n\nTheir broccoli beef gave me food poisoning 10 minutes after consuming it. I've been here plenty of other times and I've never had this problem.", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 11, "review": "This is my go to spot for work lunch break. Customer service is great however the food is mediocre. Its a great place if you want fast cheep Chinese food. Compared to other Chinese fast food places they don't really give you a lot of food but I guess that not the point when you are on lunch break and wanting to and wanting to be in a food coma. \n\nOver all this this place keeps my Chinese food cravings down. LOL and its not bad but not excellent. Its very clean from my experiences and I would recommend this place to my coworkers.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 12, "review": "Spicy and greasy food, very few women eat here.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 13, "review": "These people (the staff. owners?) are absolutely horrible!!! They are CHEAP to the \"nth degree\" and do not understand the concept of providing good customer service. I found them online and apparently they have an old menu (it's their actual menu in pdf.) The price online lists the 3 item combo for $6.95. When I arrive to pick up nothing was ready and she starts putting the orders together. I had ordered 2 combos, a 2 item and a 3 item. Further, the price becomes $9.50 instead of $6.95. Both orders come to @$19.00. I tell her that wasn't what I saw online and she immediately says \"no,no that is old menu.\" So instead of providing good customer service and apologizing and honoring what was online, she snaps back \"So do you want?\". I tell her \"no!\", and then she starts pouring the food out of the container back into the steam tray. I left, disgusted with the bad service only to remember I promised to buy my coworker lunch there. I went back to get his food (luckily his was still there in its container and not dumped back into the steam trays) and ended up ordering mine from a different restaurant in the same shopping center. When I deliver my coworker his food, he said on a scale of 1-10, it was barely a \"3\". He said it wasn't very good at all. He was hungry so he only ate part of it. His food looked extremely greasy and he said it definitely wasn't worth $10.00. Bad food, bad customer service - Not a good \"combo.\"", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 14, "review": "Most food taste the same. Lemon chicken, orange chicken etc. are waaaay too sour!\nCame here since there's no other Chinese restaurant around the area. Service is okay:/", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 15, "review": "SO OILY! \n\nI drained the oil with a spoon the used napkins to drain the rest.. (posted a picture). \n\nNo wonder you get sooooo nauseous after eating here.. \n\nSave yourself the days worth of feeling like shit. Skip Ume Chinese. \n\nOverall.. Worse than Panda Express. WAY WORSE!", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 16, "review": "My favorite salt and pepper shrimp EVER. also the ladies are the sweetest and always remember my order. For buffet style fast food they manage to make the food flavorful. I'm going to miss this place when my contract is over.", "name": "Ume Chinese Fast Food", "rating": 5}, {"index": 17, "review": "It's been over a year and I finally craved Chinese food so there I was placing an order so I can pick it up at lunch.  When I came to view the menu last week, I did not see chow fun (unless I'm blind) or anything vegetarian friendly so I walked out and got myself a slice of cheese pizza from Premier Pizza instead.  I'm a stubborn human being so I called last Thursday and asked if they can make me a tofu and onions chow fun - to my surprise they said they can.  \n\nChow fun is my favorite Chinese dish; I used to make it all the time but since I cut back on carbohydrates, I stopped making it.  Back when I was a child, I would eat beef chow fun w/ extra gravy and would dip Chinese donuts in the gravy.  I haven't done that in over 15 years.  Aahh nostalgia.\n\nI ordered ahead for carryout but when I came and saw a few vacant tables, I opened my to-go box and ate away right there.  The plus side when ordering carryout in advance, you get to go straight to the cash register vs. the line of folks waiting to pick their 2 or 3 item meal combination plates.\n\nCups for water is available and a soda fountain for unlimited refills should you prefer something carbonated.  There is a soy sauce bottle and a Sriracha bottle at each table.  Service was fast and friendly.  \n\nMy chow fun was very shiny (oily) but that's Chinese food so I'm not going to knock down any stars... there were about 5-6 squares of tofu (wish there were more) and plenty of green onions.  It wasn't saucy because I did not order it w/ extra gravy, the taste overall  was above mediocre; wasn't bland but not entirely flavorful and savory either.  \n\nI'll come back and some point to try their meal combination plates.  \n\nI'm so freakin' glad I'm back to being a carnivore.  Yesterday after a long day at work and a long evening at urgent care, I scarfed down a beef noodle soup and an ultimate cheeseburger in one sitting.  Yes, I was THAT hungry.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 18, "review": "OK! So I'm basing my 4 stars on my first visit to Ume's! I kept an open mind and \"yeah\" you can say I ignored the 1 and 2 star ratings I saw on Yelp and took my chances. My first impression when I walked is that this place was very clean, staff was friendly and they had a decent sized steam table. But today I'm after soup!\n    So I ordered the Wor Wonton soup for $7 and it only comes in one size \"BIG\"! It was a tad bigger than a large that you would get at Beef Noodle spot and talk about crammed with wontons, pork, chicken and veggies...I mean this thing was chore to take down. The main goal we all try to accomplish when we go out to eat is to get full and that I did. The broth was not bad and all the ingredients were pretty good. Now if you ask me would I go back again... I absolutely would until they prove me otherwise about my 4 star rating. Give it a try and see if you like what they have...you may be surprised as I was.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 19, "review": "This place deserves at least 3.5 stars. Tasty, nice and spicy Scheshwan style. I got Kung Lao chicken and mixed vegetables with chow me in. Wayyyy better than Panda Express and the portions seem larger too. I'll be back for sure !", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 20, "review": "I came to grab some take out for dinner around 6-7pm. They were pretty much out of everything but the place was empty. My husband wanted eggplant tofu.. didn't have it. Sweet and sour chicken??? Nope. I got him the fried fish instead with chow mein and beef with broccoli. While I ordered half chow mein and half fried rice, orange chicken, and szechuan beef. The portions were average comparable to Panda Express. The three item combo is $7.95. \n\nHere's why I am giving them such a low rating. My husband only got three pieces of fried fish. The chow mein was ok not great. The Szechuan beef was 30% beef and 70% veggies. Orange chicken was ok.. a little tough. \n\nOverall I'll probably drive a little further to have something a little more tasty. I wasn't impressed at all.", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 21, "review": "This place is so cheap . You pay good money for the food & the girls there barely serve you any food on your plate. I ordered the 4 combo plate & the girl barely gave me any food. WTF. . This place is not that great. Rather go to panda express.", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 22, "review": "Great middle-of-the-road Chinese restaurant with fresh food.  This a common stop for me.  Also, their catering is pretty good.  Today, I brought my leadership team here.  All people were happy with the food - except for dish that got mixed reviews.", "name": "Ume Chinese Fast Food", "rating": 5}, {"index": 23, "review": "Expect nothing more than general fast food. Taste OK, but extremely oily and unhealthy. The price is cheater than others in the plaza, which wouldn't be so popular at all if not close to so many offices. The main point for me to go there is it's quick, even faster than subway in lunch hours. But my recent experience there really sucks. When my dish's disappeared after I went out for a call, all their can say is that they don't know. I find it hard to believe that someone took my half eaten lunch plate and vanished. Maybe the staff cleaned my table was just too afraid to offer even an apology. All I know is the staff's laughing face make it clear that they don't give a damn about the customers' well being.", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 24, "review": "This place is near my new office. In walking around the strip mall where it's located, we decided on this place, which had a relatively long line. \n\nIt's as you'd expect of a Chinese restaurant with the usual entrees. It was pretty good! I got rice and two entrees for $9, which is decent for the area.\n\nI would recommend it and I'll be going back again!", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 25, "review": "Cheap fast food Chinese option, maybe boardering 2.5 since the quality isn't high. I tried the basil tofu and the salt and pepper shrimp. Before I ordered I did not notice the shrimp had the heads and shells on. So I was a little eh on that. The basil tofu was pretty good and the rice and noodles were nothing fancy but tasted fine. The good thing was I was able to get in and out pretty fast.\n\nParking is a nightmare in this plaza, so try to come early or take a later lunch.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 26, "review": "You might think I am liberal at reviews...No, I am not. I tend to review only the excellent ones or the Nasty ones, which I will get to some day. My Nasty reviews are rare, because I look up the reviews a lot before doing anything. My friends ask me for my opinion because they can go after buying or tasting stuff blindly. \nUme is my favorite fast food joint. It is NOT Mr. Chau. Mr. Chau lost it after early 2001. We cannot compare it. The rice is thick at Mr. Chau's and you'll get tired masticating it, sometimes the chicken like Orange chicken at Mr. Chau gets so chewy that I felt like I was eating scented rubber.\nUme makes the best Chow Fun Chicken (with Flat noodles). My other favorites are the Curry Chicken, Fried Fish and Prawns. I don't like ordinary noodles, so always end up eating fried rice.\nThe Lunch Bowl with rice noodles is also one of my favorites here. Those listed till now are my top favorites. The Kung pao and Black Bean Chicken are my second favorites. Beef broccoli looks good, but I don't eat it.\nBang for the buck really, not exquisite, but real tasty food that you won't get bored eating daily. Less oil and I don't get headaches :). \nGo Ume...the servers are so very friendly that they stuff more rice/noodles if you talk with them too much :) . I love the place!", "name": "Ume Chinese Fast Food", "rating": 5}, {"index": 27, "review": "I used to work in Santa Clara very close to Ume Chinese. So I used to be able to come here for lunch alot.  Since I work in Sunnyvale, it just too much of a drive.  But I do love the dishes. \n\nOrange Chicken - Super tastey\nBeef & Brocoloi - Crunchy brocolo & tasty soft beef meat\nChow mein - really good\nPork fried rice - yummy\n\nGo during lunch and this place will be packed with a line.  But, I keep coming back ! I have tried other fast food Chinese place and I like Ume the most.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 28, "review": "Really surprised by the positive reviews, just awful food.  Went after the lunch rush and everything seems to have been sitting around for hours.  No doubt the food must be better when fresh.\n\nPotsticker was hard crusted on top from drying out, but the filling was mushy and gross anyway so it didn't really matter.  Wrapper was very thick and unappealing.\n\nOrange chicken was heavily breaded and soggy.  Flavor was ok, but in the end the effect was ok flavored mush.\n\nAlso tried a beef stir fry dish, but the meat was tough and flavor was mostly salt.\n\nFried rice was completely bland and seemed a bit dried out.\n\nThrew it all away after a couple bites.  Cost was about 8 bucks for the two item plate with rice and a potsticker.", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 29, "review": "Oh no! I had to walk in and right back out after looking and the food on display. There were at least 3 flies buzzing over the trays of food behind the glass. If that ish is going on in plain slight, I don't even want to guess what is happening behind the scenes in the kitchen. I'll pass!", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 30, "review": "I got 2 items special which I selected the kung pao chicken and the prawns and the chow fun for the main dish.  The chicken was tough and lacked flavor.  The prawns were ok, but they only give you 3 prawns.  \n\nI'd have to say if you can, pass this and go Panda Express instead.  If not, just head over to Ranch 99 where the food is better and portions larger.  Next this place unless you're diabetic, your sugar levels are low, and you need to get your numbers up STAT!", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 31, "review": "Bad quality food. Stale vegetables. Service was good, but it didn't make up for the food quality.", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 32, "review": "This place is packed during lunch time hour from all the big businesses in the area, so avoid that! \n\nI've been here twice during my lunch break to get some quick chinese food too. that BBQ chicken they have is DA BOMB DOT COM!  A little on the salty side but it was still good. I think the owner of the place is usually in the back but she was able to help me this one day and she was real nice.\n\nThey give hefty portions and def. dont skimp on that so it's worth the price for that two item combo you're probably going to get.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 33, "review": "Decent chinese fast food. Price is reasonable. I tired Kung pao chicken with chow mein and it was good. Orange chicken is not good ..", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 34, "review": "This place is never busy. Come here anytime and you'll see them sitting down chillin. There orange chicken tasted like orange  jerky. hellllla chewy... I swear my jaw still hurts. This place won't last long. I went here about 6pm my food was probably sitting there since 6am. I won't be coming back for sure. If you are in the area I suggest subway next door haha", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 35, "review": "I love this place. Love their eggplant, flower style??. And owner is very friendly, patient.", "name": "Ume Chinese Fast Food", "rating": 5}, {"index": 36, "review": "cheap fast chinese food. nothing fancy but the food isnt bad at all in my opinion. \n\npeople are being too hard on this fast food chinese spot. its comparable if not better than panda express.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 37, "review": "The place is empty on the weekend so the food doesn't look fresh. I ordered soup to take out and it turned out Excellent  wonton soup!!!!!  Will come back for more.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 38, "review": "Im surprised by the decent rating.  I was staying at the Homewood Suites hotel on the same lot and I came by for an early dinner (5pm).  The food was so bad that I didnt finish it (and being a good chinese american, I ALWAYS finish my Chinese food).  I was praying for some Panda Express halfway though.  The orange chicken smelled like fish and the beef and broccoli is better left undescribed.   I think the problem was that the food was probably sitting out since the lunch rush, since the place was empty.  Avoid it during off times I guess?", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 39, "review": "I've been coming to this place for years, since 2003 back when I was working at Sun Micro Systems. The food was good and decent, however now I have to question their cleanliness after I found a baby roach in my water cup a few weeks ago. I took the cup to show the cashier and she said oh it was from the ice. Now I have to search for a different Chinese restaurant to go to because all I can think about is the roach in my cup!", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 40, "review": "My friends hate this place with a passion. I've lost friends for suggesting this place. There's one dish here that does it for me- it's a \"baked stuffed Chicken\" (with veggies inside) but I just call it a \"Chicken Log! (coz' it looks like one!) It's the greatest concoction known to man. (hence the 4 stars) Everything else here is nasty. \n\nFYI- don't eat the pot stickers, now I know what a tire tastes like.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 41, "review": "I stopped here because I wanted Chinese food... When I walked in I knew immediately that's not what I would be getting.\n\nThe portions are quite large and really cheap, but it doesn't really make up for the lack of flavor. After looking the food over, I finally decided on the mapo tofu and the spicy chicken. I'll admit this is a step up from Panda Express, but it still really isn't that great... I'll pass next time unless I'm in a pinch.", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 42, "review": "I agree with Elizabeth and mmmMM d. If you choose correctly, you can get not only one but TWO decent lunches for the price of one. A 2 item take-out is less than $7 but is freaking ginourmous and easily enough for two.\n\nFor my first time, I got the fried rice, BBQ chicken and Beef with Broccoli. The rice had more stuff in it than normal takeout buffets do (peas, carrots, etc) and was not bad for what it was.\n\nI was dreading the BBQ chicken (bone-less thighs) because even though it was not fried I just KNEW that it was going to be a salt-bomb. WRONG. The chicken was moist, well-seasoned without the overbearing saltiness that typically plague this kind of joint.\n\nThe Broccoli Beef was not overdone and, though uninspired, was not bad--again from what it could be.\n\nSo take this place for what it is: not authentic and good enough; choose well, and you could walk away with a real meal deal every day there.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 43, "review": "I love this place as a chinese take out. It's fast, relatively cheap, and the ladies are friendly. I like the flavor because it's not too salty and you can tell it's fresh, unlike Panda or Mr Chau's whose food looks like it's been there since yesterday. So, I come here for lunch almost weekly. :)\n\nI don't advise getting the \"wall\" items, i.e. the stuff listed on their walls and not pre-made, if you're in a hurry because they tend to take a while. But if you have time, the beef chow fun is not bad. \n\nI've even ordered trays for a company lunch, and the quality was just as good.", "name": "Ume Chinese Fast Food", "rating": 5}, {"index": 44, "review": "Gave this place a try 'coz Pho Viet was packed only to discover Ume served decent Chinese food with generous portions. The broccoli and beef chow fun was tasty and not oily. \n\nUme also offers a larger selection of entrée choices when compared to China Taste in the River Oaks corner. I am sure I will be back!", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 45, "review": "Cheap, fast, easy\n\nFood in their metal bins tends to get sad looking after the lunch rush, so I opted for something different.  A handwritten sign on their wall said \"Chinese chicken salad and soup combo $4.95\"\n\nPortions were small.  Salad was okay, chicken was a very thin layer wrapped in extra thick layers of fried batter.  The sauce wasn't a mustard sauce, but a light soy based sauce.  They have mustard packets though.\nThe hot and sour soup was surprisingly delicious.  It came with the black ear mushroom, bamboo shoots, slivers of firm tofu, pork and a little green onion.  I slurped and slurped....I could slurp my way to China, mind you.....til that container was squeaky clean.  \n\nFor a fast food chinese place, they got dang good soup.\n\nI think it's all about the timing when it comes to how fresh their food is.  You come around lunchtime, you'll get fresher food, but maybe after lunchtime, fresher soup?  Ahh...you win some, you lose some....", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 46, "review": "There's a lot of comparisons to Panda Express going on in the reviews. Personally, I think it's equivalent or worse. PE has really tasty (albeit salty) lo mein, while this place has really bland noodles. Probably the best dish at Ume is the Sesame Chicken when it's just been cooked ... otherwise everything is kind of slimy and bland.", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 47, "review": "I went here for lunch today and, as usual, the food is delicious.\n\nI have decided to up my ranking to 5 stars because I truly realized how AMAZING their eggplant is. Lightly fried, delicious sauce... effin' fantastic.\n\nDefinitely my favourite Chinese fast food!", "name": "Ume Chinese Fast Food", "rating": 5}, {"index": 48, "review": "I work at a school district and was at one of the sites that is located close to this place.  I hadn't eaten all morning and was STARVING by lunch time when a friend from the school took me here.  I LOVE Chinese food so I wanted to try it.  I got steamed rice, BBQ chicken and the orange chicken.  \n\nThe steamed rice was perfection and LOT'S of it!  The BBQ chicken was SO good, not too salty or too much sauce.  I ate the orange chicken because as I mentioned I was starving, but it wasn't the best.  Judging from other reviews, I guess it depends on what you choose.\n\nThe staff was way friendly and quick.  I was still full later that night, so I did get my fill.  I will NEVER eat at Panda Ewwwww-press again!", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 49, "review": "I use to come grab a bite to eat at Ume's a lot with my coworkers and husband. The food here is good for being a fast food restaurant. You can't really beat the price or service. \n\nI'm a fan and will be returning just not during lunch hour. It's busy and you feel rushed to eat & go back to work.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 50, "review": "I drive by this place everyday from work and decided to give it a try one day.  I ordered a 2 items togo, spicy chicken and lemon grass bbq chicken with chowmein.  To my surprise, the food was really tasty.  Way better than Panda Express.  The portion is quite big, it's enough to feed 2 people.  I will definitely go here to pick up quick dinners on days that I don't feel like cooking.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 51, "review": "I've been going here FOREVER. It's a local favorite for sure! Though that's certainly not because of the authentic Chinese food. ;) The main reason locals go here is because of the lightning speed with which you can get a HUGE load of cheap Chinese fast food. Anything fried is usually over-battered and over-cooked, so it's a little hard.\nBUT...the chow mein is usually pretty good. The curry chicken is very good, and I'm a fan of the bbq chicken. The soups are all good, too. \n \nFor all the foodies who like to complain...you pretty much know what you're getting by the second time you walk through the door, yet somehow the place is packed with return locals all the time. Go figure. The bottom line is that it's cheap, fast, decent Chinese fast food!", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 52, "review": "What more do you need?  Tasty food, good price.  At lunchtime, park on the street on Trimble or around back (it's actually closer).  The orange chicken is great and portions are large.  If you let them know you are getting just a 1-choice, they actually put MORE food in the container!  I go here at least once a week :-)", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 53, "review": "Average Chinese fast food, but still way better than Mr Chau's.  They do offer a large selection of items at their steam table.  Good selection for vegetarians ... basil tofu, Ma Po Tofu, eggplant w/hot garlic sauce.  Last visit I tried their combination chow fun and it was okay, a little light on the meat and don't recall seeing any beef in it (there were 2 small shrimps).  Wouldn't order it again.  Also, a small soup is extra $ with your lunch. \n\nOne item is $4.95, two is $6.25, and 3 is $7.45.\n\nOpen M-F 10:30am to 9pm, Sat 10:30am to 4pm, and closed on Sunday.\n\nHeed the warning of others, get there before noon or you will be in parking hell.\n\n*Update*  Tried their beef chow fun and chicken chow fun.  Same sauce, different meat.   Uninspired cooking.  I'm finished with my chow fun experimentation at this place.  Two thumbs down.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 54, "review": "I came in around 1:30 and I wanted something inexpensive for lunch so I'm not really expecting anything remarkable for under $6.  However, I was pleasantly surprised that UME serves Thai food as well.  I guess being next door to Thai Orchid, they might as well share a kitchen.  I've been to Orchid Thai and they're not the best in town...more like I'm desperate for some Thai food kind of thing.  But if you were expecting run of the mill Chinese and you get some Thai too that's definitely bonus to me.  Under $6 for 2 items (side and a main dish)...I got Pad See-Ew (less oilier and more flavorful than the restaurant next door) and grilled chicken on a stick (looked like ginger chicken...it was tasty and tender).   I'd go back again...definitely.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 55, "review": "Sadly has to be the worst chinese fast food i've ever had. The orange chicken tasted like it had no chicken. It was just big thick lumps of over cooked batter. I would wanna just take a bite off one piece but it was hard to take a bite off. My teeth and two fingers would play tug a war till it broke in the middle. I had the spicy beef and it was rubbery and overly chewy. Um 1 star for average chow mein and fried rice?\nWill not be coming back.", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 56, "review": "My friends ALWAYS want to come here during lunch....so I go with them....to be honest its not bad, but it's not great either. It's better to get a combo platter of 3 items, just to get 1 is quite a rip off. There's nothing really special about this place compared to other cheap chinese food places - however I will let you know it is far better than panda express. If you want a protein + carb splurge then you should come here. As noted before, parking is quite a pain during lunch rush hour.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 57, "review": "War Won Ton Soup!!! Full of shrimp and veggies!!!! I would always pass by this place and say the infamous phrase, \"I gotta try that place one of these days\". My bff used to work in that area and I met her there one day and wow!!!! Place gets packed and busy but the staff is always prompt with all orders. All with big ol' smiles and I know there are some regulars that go in there.. cause they are calling them out by name! HEY Janeen the usual? ;o) What I've tried is the regular lemon chicken, beef brocolli, all the others.. but the soup and the walnit prawns are the bomb!!!\n\nLunch time fav for me!!! \n;o)", "name": "Ume Chinese Fast Food", "rating": 5}, {"index": 58, "review": "for quick chinese craving fillers--- this place is ok if you have only an hour to kill for lunch. whenever this happens (maybe twice a year for me), i'd come here for orange chicken and fried rice. i do like the orange chicken because the pieces are crisp and saucy; and the pieces are sized right. not too humongous and dry as other places. I guess i like my orange chicken smaller in size coz they're cooked a little more crispy.\n\nthis location by the way needs more light. and i dunno. new paint on walls? it looks dark and dirty. i don't even want to imagine how the kitchen looks like.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 59, "review": "I give it 4 stars for a great lunchtime place.  Lots of tasty items on the steam table, and they can do many separate dishes plus many noodle options.  \n\nThey have the 1,2 or 3 item option.  Plenty of food and they are above average, IMHO, for overall taste. \n\nPrices are very reasonable. \n\nNice and friendly servers, just ask for drink refills.  If you are in the area, definitely worth a stop to check it out.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 60, "review": "I hate this place.  The location is so optimal and convenient that I always find myself there every 6 months.  Since the gaps between eating there are so long I forget why I hate it so much, so I give it another shot and I'm sooo dissapointed.  What is funny is that I order the same thing every time because it looks so appetizing. \n\nOrange Chicken & Fried Rice.  It is one of the first dishes in the fast food line and it looks so good yet tastes so crappy.  The pieces of chicken aren't cut in very uniform shapes so you have really huge pieces and really tiny pieces.  It is overcooked or they make the batches too large so it sits under the heat lamp too long because the meat is too tough.  The fried rice tastes bad, It just doesn't taste well cooked.\n\nWhat is so sad is that sometimes the line is out the door during lunchtime.", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 61, "review": "When I first went there a couple times last year, the food was fresh, hot and you got plenty of it.  Oh, it also tasted good because it was made right, without all the sweet gunk, (sauce) on everything.  \n\nLately however, (early 2009) I get there before the noon rush and find the food not yet HOT, (steam table issues) and its covered with a sweet sauce on everything that makes everything taste the same.\n\nI wish this place could keep up the quality of the food and service in spite of all their initial success!  \n\nBut like so many small companies that are successful for awhile, they loose site of why they became successful in the first place and become complacent about the customer and their service to that customer.", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 62, "review": "Above average fast food - great for working crowd since nearby.  It's not authentic chinese food, it's not restaurant food, it's just higher end fast food.  Prices are relatively good compared to other places nearby too.\n\nTHis plaza though is generally INSANE during lunch time.  Get here at 11:30-12:00 or past 1:15pm if you intend to eat here.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 63, "review": "The one star is for the location since there aren't many Chinese in the area. It would have got two if the lady behind the counter does not rob people. \n\nHow much do you think it will cost for a lunch two-item to go, if you want a separate container for the curry? More than 10 bucks. I probably can get two lunch boxes at Panda. \n\nOther than that, the food does not taste like Chinese. It is always salty, sweet and sour. Tons of MSG. You can barely find chicken in orange chicken or sesame chicken. The beef is rubbery like chewing my shoes. There is no expiration date on the bottled drinks they sell. I got upset stomach a few times. \n\nAfter given it so many chances, I have had enough. Definitely will NOT go back.", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 64, "review": "Stopped by a few times now, close to work, so what the heck.  I gotta' tell ya', it is not bad.  Think of Mr Chau's without the oil and cooked very nicely!  Now, it is not the most rocking Chinese food around, but it delivers on exaclty what it is supposed to be, a Chinese buffet, fast food.  Put into that context, works for me.  Lots of chickent dishes, not a whole lot of beef, so stay healthy!  As noted below and for anyone who knows the area, parking is absolute hassle, so be prepared.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 65, "review": "For fast reliable take out or dine in this is a great place.  It's literally 2 blocks from our office and even the non chinese food eaters love to order when we go, which is once per week.  For the same price as a deli sandwich down stairs that doesn't include a drink you can get huge amounts of food and great quality!", "name": "Ume Chinese Fast Food", "rating": 5}, {"index": 66, "review": "They have their good days and than they have their really bad days...today is one of them....the chow mien was too plain I had to pour alot of soy sauce in it. The orange chicken was so so...I also had the sezchaun beef and it was decent....a little too ruff. Overall is average...I think I like panda express better. I've tried the won-ton soup combo before and I think that was pretty good....2 stars for it be affordable and quick", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 67, "review": "Ok, the food is not nearly as bad as everyone has been saying. For what it is, it's ok. Sure the orange chicken has a lot of batter but they give you a lot to make up for it! The eggplant is really good, walnut shrimp is not bad for a fast food joint like this and service is efficient.\n\nFor the cheap price, I don't expect Panda Express.\nThe place is really busy during the week so at least I know the food is fresh.  I can do without the fried rice and just go for the chowmein next time.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 68, "review": "I wouldn't call it Chinese food, but it is ok for fast food.  I like that it has some healthy options.  A la carte stuff is better than buffet. I like that you can get fresh fruit as part of your buffet options though.  If you are going to throw caution out the window and eat something really bad for you - try orange chicken.", "name": "Ume Chinese Fast Food", "rating": 3}, {"index": 69, "review": "The one star is for the ladies behind the counter. They look like hard workers. I like that. What I didn't like is the food. I think they poured a gallon of MSG in everything! I usually just get thirsty and a little tired with a little MSG, but after lunch, I could not keep my eyes open!!! It felt like I downed a bottle of sleeping pills. ALL of my coworkers had the same effect!! That's too bad because I'm looking for a Chinese fast food around my work. :( So the search continues...", "name": "Ume Chinese Fast Food", "rating": 1}, {"index": 70, "review": "This is a good place to go for takeout at lunchtime.  Although they get busy, they are very efficient so you can get in and out pretty quickly.  It is cafeteria style, where you get in line and then pick one or two items from the buffet set-up behind the counter.  One item is 4.87, and two items are 6-something.  (including tax).  It comes with your choice of veggie fried rice or veggie chow mein.  You can also order soup if you ask.  Their food is fresh, and it's pretty good for fast food.  They even have fruit salad that's decent.  One problem is that if you don't know what you want, it's hard to see more than a few of the choices from the  line.  I'm vegetarian, and I usually get the basil tofu vegetable dish, which is very good.  They also have an eggplant dish and a spicy tofu dish that are veggie.  And fruit salad.  sometimes something else, I don't know.  You can take out or eat in.  Eat-in is nothing wonderful, but it's usually pretty clean and you don't feel like anyone's on top of you.  I've only been for lunch, so I don't know what it's like to order something or be there for dinner.", "name": "Ume Chinese Fast Food", "rating": 4}, {"index": 71, "review": "Decent food at a reasonable price. Great place to get take out. I usually get the curry chicken and ma po tofu. Neither are authentic by anyone's definition but taste just fine. You get a lot of food so if you're hungry, this place is for you.", "name": "Ume Chinese Fast Food", "rating": 2}, {"index": 72, "review": "expensive and nasty food!!! you eat here if you work around the area!!! if not don't even come here!!!  chinese food but the cheft is mexican and the owner is from thai land!!!", "name": "Ume Chinese Fast Food", "rating": 1}]