[{"index": 0, "review": "I came here to watch the Super Bowl and I loved how not crowded this place was. Don't get me wrong though, it was really busy. ALL the tables were full. The bartenders and regulars here are so friendly! There was literally someone handing out Girl Scout cookies for free. \n\nI wanted to try the quesadilla, but they had a BBQ menu that day. Ended up getting a burger and pulled pork nachos. The burger was pretty good, just wish there was cheese or some kind of sauce on it. I ended up digging into my hot sauce stash for it :) My favorite thing had to be the nachos! The plate was kind of small but the pulled pork was delicious! So SO moist! \n\n\nThey also had a variety of beers to try. Mango habanero cider was definitely my go to!\n\nI don't know if they do this often, but they had $3 beer can roulette. So worth it! I'm open to drinking anything though :)\n\n\nWill be back!", "name": "Taplands", "rating": 5}, {"index": 1, "review": "I thought I reviewed this already but apparently not. Anyways \n\nThis is my favorite bar! New beers on tap daily, AMAZING quesadillas, REALLY GOOD Pita appetizer, they have games you can check out like scrabble and battleship and literally whatever you want, the people who work there are also great and helpful.\n\nI come here every few weeks with friends because it's such a relaxed, chill environment.", "name": "Taplands", "rating": 5}, {"index": 2, "review": "Taplands is an awesome, chill beer bar in Santa Clara. They constantly get new beers, and they brew their own beers as well!\n\nYou can fill growlers with the beers they brew (according to CA law), and they pour you a half pint while you wait. The owner, Matt, is super friendly, knows his beer, and you can support your local California breweries by drinking here!\n\nPlenty of indoor and outdoor seating, parking on the street is easy, and there is never any traffic around here since it's far from the freeway :)", "name": "Taplands", "rating": 5}, {"index": 3, "review": "I wish I had this place near where I live. I love little local bars like this. Its definitely not a dive, but its not a fancy joint whatsoever either. \n\nThey will let you bring in outside grub as they just serve beer and wine (I think). All my friends and I had when we were here was beer. It's a really nice beer bar to say the least. They have a number of taps with a myriad of types and styles of beer.\n\nThe bartender/proprietor was a really nice guy and knew most of the folks by name. This made me realize what a friendly guy he was and where the success of his business was stemming from. Most of the patrons were regulars as well. I mean who wouldnt want to go to a place where everyone knows your name?\n\nThe outside seating area was really nice to chill in for a while. Someone had their dog out there as well. It was a pet friendly area and the bartender even came over and petted the dog a bit. \n\nLike most successful beer bars of late, they will toss you a lil sample or taster to verify what beer you want before you make your decision on a pint. The crowd is very friendly and everyone is chatting with everyone else.\n\nThe interior kinda reminded me of a coffee shop. A few sofas and deep chairs with a few high stools and tables with chairs.  Definitely an inviting fun and relaxed place to chill. \n\nIf I didnt live 400 miles away, id be there much more regularly. Awesome place to hang out.", "name": "Taplands", "rating": 5}, {"index": 4, "review": "Quick service, nice place, close to Santa Clara University. Good for lunch and easy bite. Was very tastfull!", "name": "Taplands", "rating": 4}, {"index": 5, "review": "Nice cute place to hang out with friends. The two times I was here was because Thursday Night Trivia was moved from Golden State Brewery to here. But they have food, and fun trivia and good beers. Definitely a nice place to unwind with friends after work :)", "name": "Taplands", "rating": 4}, {"index": 6, "review": "A good place to hang out, drink craftbeers, and watch sports. They usually have 25 craftbeers on tap, ranging blonde ale to stouts to sours/cider.  You can also ask for a small tasting before making a commitment.\n\nThe staffs are nice and happy (it's probably hard to be grumpy while working with tasty beers).  There are plenty of seats inside and out.  The place can get loud sometimes, given that it is close to a college campus.  But hey, can't blame people for having a blast!  Cheers!", "name": "Taplands", "rating": 5}, {"index": 7, "review": "Price: Every pint is roughly $6-9. They rotate the taps pretty frequently so I usually try something different every time I stop by.\n\nAmbiance: It is a mixture of rustic taproom with the convenience of all the different games playing on different screens + small beer garden out front. Checks all the boxes for a casual hangout spot. It's a bit small so you may have to wait for a seat to open up if you go at a busy time.\n\nOverall, I'd say this is worth stopping by if you're in the area and want to have a casual beer. The drink options are good, they have food to munch on, and the bartenders know their stuff so can give you good recommendations.", "name": "Taplands", "rating": 4}, {"index": 8, "review": "If you like beer, you will like Taplands. Money back guarantee. \n\nThis is a pretty small, hole in the wall-ish place, that gets crowded during sports games. In a shopping center among dentists and eateries. Indoor and outdoor seating - but limited amounts. \n\nThe menu includes a page with beers on tap and they also have bottles in a refrigerator case. Expect to pay around $7-10. \n\nI am a picky drinker. I love fruity drinks and hard ciders. If you like beer with hints of....beer, they got you covered too. I got a Mission Trail Peach Coast. The peach taste hit you a few seconds later, and it was not as sweet as I usually go for. \n\nI wish they had a more expansive food menu. With fries!! I need fries. They have more traditional fare (warm olives, charcuterie, paninis), but their food menu could use some work. \n\nAnyway, fun place to drink and chillax. Get on those fries, stat, guys!", "name": "Taplands", "rating": 4}, {"index": 9, "review": "I go to Taplands once or twice a month to catch up with friends. I remember when I first came here, I rekindled a relationship with an old friend of mine that I've lost contact with for over 7 years. She lives in Oregon but came to California to visit her grandparents. We just happen to be at right time at the right moment. It's truly an amazing experience. Everyone at Taplands is awesome.", "name": "Taplands", "rating": 5}, {"index": 10, "review": "If you enjoy craft beer, this is the spot for you!! They have a large selection of rotating taps of craft beer. Their bartenders are always knowledgeable of their wide selection, so let them know your preferences and ask for a recommendation if you're feeling indecisive. \n\nI am a sucker for clever design, and once I saw the hops-shaped hanging lights, I knew this place was gonna be legit. \n\nOrdering is easy, their rotating taps are listed on a printed menu or on their mounted screens. \n\nPricing is fairly typical - prices ranging due to ABV or size of the pour. \n\nI would say the ambiance is in between a brewery and a bar. They have a small couch area and a decent amount of seating indoors and outdoors. \n\nService is a little inconsistent. The bartenders are usually super helpful and friendly, but I might've just caught one on a busy night/grumpy moment. Oh well.. as long as they got my beers right, didn't bother me too much. \n\nOverall, great spot for craft brews. I've come here a few times now whenever I visit NorCal, and I always have a good time chilling, drinking, and catching up with friends. Check it out!", "name": "Taplands", "rating": 5}, {"index": 11, "review": "I loooooooooove me some Taplands.  I love me some bartenders that already know what I want/like to drink when they see me walk in the door. I love me some purse hooks underneath the bar. I love me some Pita Points with the dip. I love me some clean bathrooms and tables.  Indoor and outdoor seating is plentiful and if you dont want to sit, there is plenty room to stand.  Dog friendly on the patio, kid friendly too, but I probably would steer clear of toting your tot on a Friday or Saturday, if at all. \n\nThe beeeeer - Always different, always the best and always fresh.  You can get full pints of most beer, and half pours if you ask and always competitive pricing. The food -  The menu is more along the lines of appetizers and warm sandwiches, which are always tasty.  They also have chips for purchase to snack on, and soda and water available too. If nothing as far as food here strikes your fancy, you are allowed to bring in your own food. There are a few restaurants within walking distance. They also have a cold case FULL of bottles and cans to go.  Make sure you grab a 4-pack on your way out!! \n\nI love the vibe here... everyone is always friendly and funny and engaging.  Definitely my favorite!!\n\nMake sure you tip well... these folks LOVE what they do and deserve lots of love!", "name": "Taplands", "rating": 5}, {"index": 12, "review": "Good selection of beers on tap and friendly cool place to enjoy beer.  They have a good palate for beer so you can't go wrong here.", "name": "Taplands", "rating": 4}, {"index": 13, "review": "Gotta give Taplands an update! By adding another star :)\n\nBeen here a couple more times to get a better feel of this spot. Their service has most definitely improved with having more knowledgeable taptenders and staff! What I love is still their selections of beer! From kolsch's to stouts, you'll definitely find some beer on tap (or in their magical refrigerator) for everyone.\n\nThey're still working on their own brewing part. I came by a few weeks ago and was looking to get a growler for a friend. Unfortunately, they only sell growler's that are of their own brew. Makes sense. Except, they didn't have any that they could tap at that time. Everything else is still smooth and wonderful, from their wifi to diversity of seating choices, so I'm just waiting to get my hands on some of that Taplands beer!!", "name": "Taplands", "rating": 4}, {"index": 14, "review": "Best taphouse in the South Bay.  I've been a regular since they opened last year, and they always seem to have a new beer for me.  With 24 rotating taps, the carry a wide range of local brews.  You'll easily find something tasty with the help of their friendly bartenders.\n\nVery active on social media!  Check Instagram for event updates, Digital Pour mobile app for their active taplist, and Twitter for the latest tap updates :)", "name": "Taplands", "rating": 5}, {"index": 15, "review": "Good place to have a beer and watch sports. New beers everytime I come in. It's my first check in, but I've been here over 10 times. I like to watch baseball and hockey here.", "name": "Taplands", "rating": 5}, {"index": 16, "review": "Great beer selection and friendly staff with a nice mix of people coming in to grab a drink.   Wish they had a better food selection so docking 1 star.  Would come back!", "name": "Taplands", "rating": 4}, {"index": 17, "review": "A friend of mine told me about this place and the beer selection is pretty great, including the canned beers!  However, the staff is not so great.  The two guys that were working the night I went were complete douchebags, they ignored my girlfriend and I at the counter when we were ready to order, and they just had a bad attitude throughout the night making passive aggressive comments to us everytime we ordered a new beer (we didn't open a tab).  This venue is a bit of a drive for us, but that's okay because we won't be coming back.", "name": "Taplands", "rating": 3}, {"index": 18, "review": "Decent beer garden. Not a lot of personality inside or out but the patio is nice on a perfect Norcal afternoon. Good selection of beers, limited  selection of food. However, what we had (charcuterie plate, pita triangles) were a decent albeit light accompaniment to the beer (they also have three different sandwiches).\n\nIf this place was in Denver I'd give it three stars but for the location it is an above-average option if you're just looking for a beer, especially if you're not a fan of chains like Gordon Biersch or BJs. Just don't expect to have a nice meal here.", "name": "Taplands", "rating": 4}, {"index": 19, "review": "Wow. What a breath of fresh air after a bad experience at another craft beer place I went to the other day. After what happened last time, I realize I need to start learning more about beer. \n\nI was fortunate to sit next to a guy who's a regular here and also sell beer, helped explained more about beer and all the questions I had regarding it. I found out that I do love a lot of beer, especially IPA. When I thought about beer I don't like, I think of Guinness. That is a very acquired taste. It was great to learn a lot more about different types of beer. \n\nI ordered the combination cheese and charcuterie plate. It was Brie, fresh mozzarella, Soppressata, and olli calabrese I think.  I told them my love for prosciutto and since it wasn't on the chef selection, it wasn't on my plate. To my surprise, they brought out a small plate of it for me. Wow! +2 stars. \n\nService was excellent and the female who worked there really know her beer. She's works in sales for Mission Trail which I end up having to try one of their beer. \n\nI had the something galaxy, duck duck juice, and mission trail die hard. All were tasty.  \n\nLove the ambiance and vibe there. Most are layback and just wanting to enjoy some great beer. Definitely will be back.", "name": "Taplands", "rating": 5}, {"index": 20, "review": "Really loved the place. Very laid back atmosphere to chill out on a Friday night. Most often you will find ppl playing board games. We went late into the night so we could jus order beer. \n\nMake sure you be thr well before 9pm to order food. What's  cooler about this place  - you can bring in food from outside if you don't make it before 9pm.", "name": "Taplands", "rating": 4}, {"index": 21, "review": "Taplands has an excellent select of beer. However, I suggest you come on an empty stomach because their food is BOMB! Complements to the chef. He is always mixing it up. The curry is one of my favorite dishes and the quesadillas are nothing to miss either. Great service. Great atmosphere.", "name": "Taplands", "rating": 5}, {"index": 22, "review": "Nice food the service was little bit slow but that's okay \nI will definitely gonna come back", "name": "Taplands", "rating": 4}, {"index": 23, "review": "Taplands is a cool, unique bar that offers local brews. What I love about the place is the fact that it is very close to where I live, the place has a nice ambiance to hang out and watch sports, but most of all, the beers on tap are quite good. I usually get the pale ale type or blonde lager, but from time to time I go for the thickness and go darker...what can I say, I like the Guinness type beers. Heck, I love beers period! \n\nThe staff is quite nice, the bartenders tend to your needs without being too naggy. I wish the place is a bit bigger, more food selection, and closes later, but it is an upcoming bar, so I think those things will happen overtime. I don't think they will be out any time soon, so come on by and have a beer or two!", "name": "Taplands", "rating": 4}, {"index": 24, "review": "Great craft beer and food selection and the staff is always looking to enhance the experience.", "name": "Taplands", "rating": 4}, {"index": 25, "review": "Another day at work. Came here on a friends suggestion. I like the ambient, good selection of bears, relaxing music. The bar tender was also nice and friendly. Local place to hang out.", "name": "Taplands", "rating": 5}, {"index": 26, "review": "Wow. Taplands is amazing. Pleasant bartenders, great beer selection, and huge cheese plates!\n\nFriends and I were just planning to kill a little bit of time, and happened to stop by here. The place isn't too large, and I'm sure it would have been better in terms of space had it not been raining (there was some patio seating outside...), but there are some great taps from within California and outside - I had a cold brew coffee stout, which was delish. My friend's Nitro porter was even better, though - so smooth.\n\nWhat really got me was their cheese plate. I was wondering why it costed more than the prosciutto, then it came to our couch/table, and then I knew. They give really decent portions - ours had brie, mozzarella, goat cheese, and blue cheese, with raisins, walnuts and bread. All of the cheeses were fantastic, and they even gave us more bread when we asked, since there was still more cheese on our plate.\n\nWould definitely come here again - gotta try some more of the beers!", "name": "Taplands", "rating": 5}, {"index": 27, "review": "I honestly cannot say enough good things about this place, my only real hesitation in writing this review is tipping people off about my favorite spot! Everything from the ever-changing, diverse selection on tap and to-go cases, to the delicious small plates and panini, to the friendly and knowledgeable staff - cement this establishment as the shining star of Santa Clara. \n\nPrices are more than fair, the vibe both indoors and out is welcoming and enjoyable. Matt, the owner, is an A+ human being, as are the rest of the beertenders. Not sure what you might like? Just ask! Unlike other beer bars in the south bay, you won't get the soup nazi treatment for not having your order ready or the side eye for asking for a sample to help you decide. The world needs more places like Taplands; I consider myself lucky to have you in my backyard!", "name": "Taplands", "rating": 5}, {"index": 28, "review": "Great beer bar in the South Bay.  Our bartender was awesome, letting us sample different brews before deciding on one and providing great recommendations as well.\n\nSeating can be limited inside when things get busy, but the outdoor tables are kept toasty under heat lamps during the winter.\n\nDraft list focuses primarily on local brews with many limited releases from even Sacramento joining in on the party.\n\nWould definitely come back!", "name": "Taplands", "rating": 4}, {"index": 29, "review": "I really liked the atmosphere, the staff was very friendly and welcoming, outside sitting was super cute and cozy.\nThe staff helped us to choose the beer that we liked.\nWe ordered a combination plate as a snack of cheese and meat unfortunately the pecans were a little old and the quality of the food was not that great. Unless everything else was fantastic and it's a very cozy and casual place to spend an evening with a friend", "name": "Taplands", "rating": 4}, {"index": 30, "review": "Came here on a Friday night around 930 for a couple of beers. It was surprisingly not that busy and easy to grab some seats at the bar. There were 2 guys working and they attended me promptly, and made sure that every time our drinks started to get low to see if we needed another beer, super awesome! \n\nThey had some great beers on tap, one of my favs is the New Belgium Heavy Melon, similar to Hell or High watermelon but better. \n\nThe only downfall is the lack of ciders. Sometimes a girl feels like something sweet. \n\nFYI if you're coming to eat, the kitchen closes around 9, so don't come hungry or your only choice is chips. \n\nOverall great place, easy parking, clean place and nice people! I will be back!", "name": "Taplands", "rating": 4}, {"index": 31, "review": "Best brewery in South Bay without a doubt. I wont classify myself as a regular but this is one place I`m proud to take my friends from the city or from other states. They have a great selection of taps. For all the beer connoisseurs, I would definitely recommend the unique Sid`s Serrano Pale Ale. I haven`t tasted anything remotely awesome as this one.\n\nI have generally been here to have a relaxing cold brew. This place has a super chill vibe especially in the patio area. Also, you can buy a 6 or 12 pack from their fridge which is super awesome. \n\nDefinite recommend to anybody who loves to chill out with a great beer.", "name": "Taplands", "rating": 5}, {"index": 32, "review": "Lots of beer options and tasty sandwiches. Also, Ashton is an absolute sweetheart behind the bar. He was very patient with us letting us try various beers and sharing his knowledge in regards to what was on top. We will come back just to visit Ashton. Great spot to ride bikes to and enjoy the game. Awesome find!", "name": "Taplands", "rating": 4}, {"index": 33, "review": "Great casual vibe with a wonderful beer selection.  Good variety of beer styles on tap with a steady rotation - always something new to try.", "name": "Taplands", "rating": 5}, {"index": 34, "review": "Ok so I've been coming here for the last year. I was actually there on their second day of opening and at first I wasn't sure if I liked or hated the place. But I gotta say this HS my go to spot in SAnta Clara and living a short 10 min walk away doesn't help. \n\nBeers I give a 8 out of 10, I've been really impressed with there fridge recently but it has also Been lacking some days, I'm sure it gets cleats out over the weekend. \n\nFood is pretty damn good!!! Every pressed sandwich I've had and I've had them all is damn good! The meat and cheese boards are great as well.\n\nOverall it's a great spot with great people who love beer.", "name": "Taplands", "rating": 4}, {"index": 35, "review": "Great place for a chilled beer considering the heat outside! Tried their Plum Jerk and Mango IPA. Both were great! Totally recommend this place", "name": "Taplands", "rating": 4}, {"index": 36, "review": "Love this place. Great place to get craft beer and an awesome place to watch a game. The place is pretty chill and is always a good time. It's located right next to Santa Clara University the crowd and environment here are always fun.", "name": "Taplands", "rating": 5}, {"index": 37, "review": "Wonderful beer selection, provide information on their tap & bottled beers, the minimalist ambiance is pleasant too; HOWEVER, some of their staff is pretentious & rude.\nAt first, I thought they might have been having an 'off night', but no. Ive been back a few times & I get the same 'strained service'. The guys behind the bar indeed have their favorite customers and have no qualms showing it. This is fine. \nAll I ask is for the dudes keep in mind: 1) they are working with the public; 2) they're in the 'service industry'; 3) you help male, and yes, even *Female Patrons!*", "name": "Taplands", "rating": 1}, {"index": 38, "review": "With its relatively close proximity to SCU, I had low expectations for a friday night. Much to my delight, this was not the dreaded friday night frat party i had anticipated!\n\nI arrived around 7 PM and there was available seating inside and out (it was still nice end of Sept). We snagged a table and added some extra chairs since there were 6 of us.\n\nI really like the diversity of the beers and the fact that you can order in a smaller size than a pint. Helps when you need to drive home after.\n\nWe also ordered some snacks like the pita and dips and charcuterie plate.\n\nPrices are extremely reasonable, I will go back in a heartbeat!\nPS the giants beat the dodgers 9-3 while i was here, so that's 2x the win points for Taplands ;)", "name": "Taplands", "rating": 5}, {"index": 39, "review": "What's there not to like , outdoor seating great beers on tap  tv for sports with munchies \nA++", "name": "Taplands", "rating": 5}, {"index": 40, "review": "It is about time a non-sketchy bar pops up in this neighborhood! Not only do they have beers on tap and sell speciality beers but they also have food! Good food! Healthy ish food! Paninis, salads & cheese plates! I hope they offer burgers and soups later. No happy hour yet but they will eventually. Reminds me of the breweries in the East Bay and West Sac so much needed here in the South Bay. I can totally see this becoming that neighborhood spot from tv shows like Cheers (for you old timers) or How I Met Your Mother (for you netflixers). \n\nAs for recommendations, I had the Die Hard Cider (AAAAmazing) and my partner had the Ovila Abbey Ale (Sierra Nevada). Totally worth checking it out but not if you are the Bud Light kinda folk. Just sayin!", "name": "Taplands", "rating": 5}, {"index": 41, "review": "Taplands was a solid choice for our group on an early Saturday afternoon. It was fairly empty at 5 pm, but slowly got more and more crowded as the night went on. The staff is friendly, the seating is ample, AND there are tables outside, which is a win.\n\nThe prices are reasonable, they have a large variety of beers, and are generous with their samplers (although they don't offer flights, which was a bummer). A very easy place to kill a few hours and enjoy a few local, quality brews!", "name": "Taplands", "rating": 4}, {"index": 42, "review": "Cool spot, lots of good beers on tap and sports on the tele! That's all I need to be happy :) \n\nStaff is very knowledgeable, and they carry some good local breweries - Hermitage, Red Branch, etc. \n\n5/5, would recommend, will be back.", "name": "Taplands", "rating": 5}, {"index": 43, "review": "This is a nice little bar tucked away in a shopping square. You might miss it if you drive past too quickly -  just look for the large \"Toppings Restaurant\" sign and Taplands is next door. They've got some tables,  a couch and bar seating but it wouldn't be the best spot for a large group (no more than 5-6 people).  \n\nThey had a good variety of beers on tap and ciders so you're sure to find something you like. My friend and I also got a cheese plate to try. We asked for no Bleu cheese on our plate and they were nice enough to give us extra of the other cheeses. The plate comes with goat cheese mousse, so delish! Definitely worth trying and a steal at just $8 for the plate. Loved the fig jam that came with it too. \n\nThey've got TVs up at the bar as well so you can catch a game. Definitely a good spot to check out if you just want to kick back with a brew!", "name": "Taplands", "rating": 4}, {"index": 44, "review": "I really like this place.\n\nI proposed to my girlfriend upstairs and let them know we would be coming in afterwards. There reserved us a couple of tables outside on a beautiful day! There were also cool enough to put in tap my fiancés favorite beer Duchesse De Bourgogne. They had a number of special bottles in fridges as well.\n\nThe group also really like their meat and cheese plate (the dutch-crunch-like bread is really good!). I think the favorite item was this creamy goat cheese.\n\nYup, definitely going to be a regular here.", "name": "Taplands", "rating": 5}, {"index": 45, "review": "Choices were good as we had a diverse crew with us. They had a variety of beers to fit multiple taste buds. The environment was nice- TVs with sports, bar tables and decent music. Indoor and outdoor seating and hip bartenders.\n\n\nIf you're looking for a wide variety of IPA's you had about 4 to choose from. Approximately 15 total taps. In the middle of the city off the beaten path.", "name": "Taplands", "rating": 4}, {"index": 46, "review": "If you love craft beer, and/or want to learn more about craft beer, this is the spot! Great selection, good people (staff and customers)--a great place to relax and have a beer.", "name": "Taplands", "rating": 5}, {"index": 47, "review": "My boyfriend found this cool spot for us to go to after the football game. It was our first time in San Jose and this was the closest place near the stadium. They have a good amount of beers on tap. It was a Sunday evening so they weren't that busy so it was nice to unwind before going to the airport. The owner and the staff were super friendly. Nice spot to go with a group of friends to grab a few beers and hang out.", "name": "Taplands", "rating": 5}, {"index": 48, "review": "Good selection of beers and a good mix of indoor/outdoor space for seating. Didn't try the food, just the beer. Only downer was there was only a single person behind the bar on the day that I checked it out. Otherwise, not a bad spot to grab a beer.", "name": "Taplands", "rating": 4}, {"index": 49, "review": "Not a bad place. Kind of a hip vibe but it's a good place for anyone to stop off and try a new brew. Prices are not that bad either. I'll visit again. Service was good and there is plenty of parking there.", "name": "Taplands", "rating": 4}, {"index": 50, "review": "I think this place was 4+ stars for me for a while, but I was there this week and found out they BREW THEIR OWN BEER.\n\nSolid. \n\nI've been coming here pretty frequently since I've decided it was time to provide moral support for my brethren who are still studying for the CA Bar. We love beer, so naturally this place was a huge hit. They have a phenomenal beer list, always something new, and the bartenders are fun!\n\nNow that I've been a few times, they know me, as well as the kinds of beers I like to order, so sometimes they will just toss me a taster of something new and ask me what I think of it. They also use digitalpour so you can check in all you want on untappd and get that glory (gamified drinking, who would have thought)!\n\nIt's too bad they close at 10pm although I've outstayed my welcome and left at close to 11 before chatting with friends and closing up the bar. Superb!", "name": "Taplands", "rating": 5}, {"index": 51, "review": "I stopped by Taplands after dinner with a group of friends one night. It can be intimidating for a group of girls walking in to a pub/bar but everyone there was so friendly! There were a few guys who looked like regulars or they worked there and they were very quick to give up their seats at the bar for us. They didn't pressure us in making a choice right away but helped us decide by asking what we like to drink. \n\nAfter seeing a table available outside we made our move. There aren't really any other places open in the area at night so you don't have to worry about being too loud.\n\nThis is a great place if you're catching up with a few friends or just want to enjoy some good beer. I would definitely come again when I'm in the area.", "name": "Taplands", "rating": 5}, {"index": 52, "review": "Kick ass taproom! The beer selection is great, and I love their cheese platter! Whenever I'm in the area this is a must stop place. Look for Julia, the Beer Hag™, as she's always there.", "name": "Taplands", "rating": 5}, {"index": 53, "review": "Taplands is a cool spot if you're looking for somewhere chill to hang out that's not crazy loud, but still has TV's available. They are located in more of a residential area, and have tables available in addition to the bar/counter area. I liked their wide variety of beers on tap, especially since they had a few stout/porter options available. They allow you to get samples, so I tried a couple of beers before settling on a Stout (http://www.yelp.com/biz_photos/taplands-santa-clara?select=wjj_cHE7C3BOySyjAZU5QQ), which was good. The bartenders are nice here and helpful, and they also have a small menu of snacks in case you want something to munch on. I would come back if I was just looking for a casual place to hang out with friends, and/or if I saw a beer I wanted on tap. Parking is pretty easy since there is street parking available and a lot nearby.", "name": "Taplands", "rating": 4}, {"index": 54, "review": "Two thumbs up. This place recently opened up a block away from the Santa Clara campus, and if you're a beer loving student like myself, you'll really appreciate being able to come here for a pint and taking advantage of the free wifi while you work on writing a paper. I recommend their Duchesse Sour Red - delicious. They also serve food, which is the icing on top of the cake. I recommend getting a charcuterie and cheese combo as a light snack. Super yummy. And they have an Escape Room right upstairs, which is even better. One of these days, I'll have to get a couple of drinks in me and then go try and make my way out through the obstacles.", "name": "Taplands", "rating": 5}, {"index": 55, "review": "Great place to hang out and drink some beer! =)  Staff were very alert and checked up on us!", "name": "Taplands", "rating": 5}, {"index": 56, "review": "Not that good to hangout. Very small place. Beer was okayish. Wouldn't go there again.", "name": "Taplands", "rating": 2}, {"index": 57, "review": "Love this new spot near SCU!  Why wasn't this here when I was attending.  Anyways I still live close enough and this is a great space to come out to.  Located in a quieter part of Santa Clara, this bar has a really nice feel to it and offers some great beers and bites.  \n\nFor such a small place, they offer quite a bit of beers on tap.  They seem to rotate out pretty frequently too which is great to try something new.  As for the food, I tried the cheese plate that came with some meat, bread and mustard.  It was the $12 one.  For the price, I was really surprised at how much you got!  Very generous portions.  \n\nOverall, this place is fantastic.  There's plenty of parking in the back.  The place got pretty full on a Friday after work, but I think besides that it doesn't get too crowded.  Can't wait to come back!", "name": "Taplands", "rating": 5}, {"index": 58, "review": "Great place, the beers change daily but there is an app to see what is going on. Dale is great and helps a lot when I am trying new beers.", "name": "Taplands", "rating": 4}, {"index": 59, "review": "When I was in San Antonio, Texas, there were at least 4 craft beer bars, I was very disappointed when I moved back and couldn't find one in SV, until Taplands showed up in my Yelp search. \n\nWe were here on Sunday, during the day, it was very quiet, although the owner said it is packed when Dubs and Sharks were playing. \n\nVery clean and comfortable area to enjoy some local craft beers. Highly recommend it.", "name": "Taplands", "rating": 5}, {"index": 60, "review": "Great place to grab a beer and try some new selections.  They have plenty of variety on tap and I have really enjoyed the East Coast IPAs they've had lately.  They do serve some appetizers from the kitchen - and if you are going to use the tables outside, the owner (Matt) is okay with you bringing your own food. We've had several little celebration get togethers at Taplands and they have been a lot of fun. Also fun place to just to grab a beer with my wife.  Good vibe! Highly recommended!", "name": "Taplands", "rating": 5}, {"index": 61, "review": "I went here because it was listed as a Sports Bar on google.\nNot so much. Giants (pre-season) game, and NCAA \"elite 8\" were going on. They chose college softball and some old documentary about Dusty Baker on their TV's.\nThe manager was doing the bar, and didn't know their beers. One of the customers had to help out.\n(NOTE: I was there back in Mar. 2017)", "name": "Taplands", "rating": 3}, {"index": 62, "review": "Thank God for this neighborhood bar. I'm so glad this place is just around the corner from my condo! What a relief it is to have a clean, modern bar that serves up some craft brew! This place is just my style. Since it has opened, it has really gotten busier as time has gone. I'm assuming word of mouth has gotten more visitors! I love the IPAs that are served here, and the bartenders seem pretty knowledgeable about the beers and breweries. On game days, Taplands is rather packed, and I find myself walking in and walking out due to how busy they are! On top of beer, I've had the cheese plate and sandwiches -- yum! This place could use a couple more TVs, but other than that, I love coming here :) On warm summer nights, it's nice to bike here, lock your bike to the bike racks right outside, and have a brew (or two, or three)! Great job Taplands!", "name": "Taplands", "rating": 4}, {"index": 63, "review": "A VERY welcomed addition to the neighborhood...and craft beer community. They have a great tap and bottle selection, featuring many local breweries like Hermitage, Golden State, and Red Branch. \n\n#DrinkLocal\n\nService is on point too. If you have any questions or are looking for recommendations, they got your back. Parking is also usually a breeze -- which is a huge plus in my book. Excited to frequent this place on the regular.", "name": "Taplands", "rating": 5}, {"index": 64, "review": "This is our go-to favorite place! Sometimes we come in just to get a 'Traditional' sandwich (and of course end up with a beer, as well) because they're so good!\n\nThe rotating taps pretty much always have something for everybody's taste, although there's often a larger selection of IPA's than anything else. I've discovered some amazing beers that I wouldn't have gotten in the store. \n\nThe staff is awesome and knowledgeable, they're always helping us try new things and find what we like. \n\nYou really can't go wrong here!", "name": "Taplands", "rating": 5}, {"index": 65, "review": "A co-worker found this place and a bunch of us decided to come here after work. It's fairly new. But seems like a chill place to hang out. We were able to snag the couch in the corner. They don't really have a Happy Hour but everything is pretty reasonable - not super pricey. They have about 15-20 beers on tap, I think. They let me try one or two before I ordered a whole pint. I ended up having a black current wheat beer and the citras gose. Both were a little bit fruity which is what I like. I think they rotate taps so they should have something new when you go. They also have a small menu of food. I was having dinner later so I didn't try any of the charcuterie plate and the grilled pita that my coworkers ordered. It looked pretty good - just some snacks while you're enjoying some beers. It's not too far from work or home so I could see coming back.", "name": "Taplands", "rating": 4}, {"index": 66, "review": "Talk about delicious!! The bartender was a sweetheart and let us try of fair share of yummy beers and while the menu was short, what we had obviously had lots of thought and love poured into it. Great selection of beer, awesome environment, and tasty food. My boyfriend and I will definitely be coming back.", "name": "Taplands", "rating": 5}, {"index": 67, "review": "OK, so I initially rated this place 2 1/2 to 3 stars. It says I was last for 10 months ago, and I finally went back last Saturday night. I really do want to like this place, but unfortunately my experience was pretty much the same. The bartenders I feel are rude and that I was imposing on their conversation with their \"friends\".  Not sure if they're extreme beer snobs or what, but something's up their you know what. Seriously need to review what good customer service is.\n\nI rate this place 2 1/2 to 3 stars. Beer and food are good, service for sure needs improvement.  One of the bartenders apparently didn't know wtf he was doing and served people who got there after me, on not 1 but 2 separate occasions.  The other bartender told me to make sure the number was visible for food even after I told him the first time the wind kept blowing the number down, apparently he doesn't know what wind is.  Was really excited for this place but really wanted to walk out when initially ignored.", "name": "Taplands", "rating": 1}, {"index": 68, "review": "This place is the shit.  The whole staff is amazing. You can't go wrong with either Dale, Chris, Izzy, Jill or Matt the owner.  Then you have Art the chef in the back making food.  The beer, the beer is soooo good.  They have 24 beers on tap plus dozens of bottles to chose from.  Say hi to them for me", "name": "Taplands", "rating": 5}, {"index": 69, "review": "Great beer selection at reasonable prices, with many local selections.\n\nAttentive and friendly staff, knowledgeable but no beer snobs in this bunch\n\nNot much in the food department but they do have a small menu of cheeses, charcuterie and paninis. I'm pretty sure I saw some menus for a pizza delivery places on the bar so maybe they allow to order in?\n\nNeighborhood feel with aid-back clientele, a mix of locals and students.\n\nAnd it's a great location. Actually it's very close to my church. Pray hard, play harder?\n\nOverall this is a great spot and a good addition to the area.", "name": "Taplands", "rating": 5}, {"index": 70, "review": "YAAAAAAS! finally a place with 25 beers on tap and a beer fridge.  there is something for everyone here! the bartenders are pretty nice and will talk to you as well! The place gets pretty packed quickly so be sure to get there early to get seats.  I like how there is an outdoor patio as well as seats inside, plus bar seats.  This place is awesome,  I regret not coming here earlier.", "name": "Taplands", "rating": 5}, {"index": 71, "review": "great beer selection.\n\ngreat local business.\n\ngreat options for beer hounds.\n\nmellow.\n\ngreat establishment.\n\ni wish matt all the best going forward!", "name": "Taplands", "rating": 5}, {"index": 72, "review": "Great ambience, delicious ciders, and good prices. They also have fantastic cheese and meat platters. I was so excited when this place opened because they're right by my house and it's the perfect spot to relax and unwind after a long day at work.", "name": "Taplands", "rating": 5}, {"index": 73, "review": "Stepped in for a quick beer before our flight. Good choice of venue! Decent range of beverages.", "name": "Taplands", "rating": 4}, {"index": 74, "review": "This place is okay, no shining star if you have ever been to great beer bars. Food... go find another place; small foo foo portions and wayyyy too fancy for ... A BEER BAR! Jesus H, where is the pub fair? Beer selection was ok. Atmosphere.... was this a Quiznos or togos at one time? Oh and what's with all your corny kegs in the hallway? Trying to compensate perhaps?\nWon't be back but I gave it 3 just to be fair.", "name": "Taplands", "rating": 3}, {"index": 75, "review": "Taplands...Great beer selection, great bar food and friendly atmosphere. Sunday when I was here wasn't too busy. Only neg is tv was dominated by basketball (not my thing). I will be back & hope you Yelpers will try it too.", "name": "Taplands", "rating": 4}, {"index": 76, "review": "A+. Sit at the bar. Sit on the couch. Sit in the heated patio...it's all good.  They represented for SF Beer Week with a special Drake's coffee IPA and plenty of breakfasty beers.  Friendly people, good and generously portioned food. I'm torn--I want to help them with a good rating but keep them secret!", "name": "Taplands", "rating": 5}, {"index": 77, "review": "It's good. There's a relaxed atmosphere and the beers are fun. The list is well curated, but not every bar tender seemed up to speed on the full list. Decent value and ample parking", "name": "Taplands", "rating": 4}, {"index": 78, "review": "Nice little bar in Santa Clara. We went there for afternoon drinks and sat outside on the patio. The drinks were good and not too pricey. I'd definitely go back there for drinks another time.", "name": "Taplands", "rating": 4}, {"index": 79, "review": "I really wanted to like this place. We came on Friday night after work and instantly liked the feel of the place. Easy street parking, outdoor seating, lots of craft beer choices, and a nice look. \n\nThey had 3 paninis along with other snacks (olives, pita, cheese and meat plate). But out of the 3 choices they had on the menu they only had the ingredients for one. For 7 on a Friday night, that seems like poor planning. We didn't end up eating there because the spicy turkey was the only thing available and I can't do spicy things. Trying to order anything takes awhile. There were only 2 guys working and without a designated place to order you can be standing around until they notice you, one word of advice, be aggressive and noticeable! I waited in line for 10 minutes just to close out my tab.\n\nWe aren't giving up on this place just yet, I'll update my review if anything changes.", "name": "Taplands", "rating": 2}, {"index": 80, "review": "I had lunch and brews with my co-workers at this local neighborhood-style brewery. We shared an assortment of charcutterie, cheese plate and paninis - Italian, Vegi Tapenade and Kiln Fire Turkey. The snacks and sandwiches were tasty. My co-workers had brews on tap while I had the Red Branch Black Cherry Cider which was tart, not too sweet and light.", "name": "Taplands", "rating": 4}, {"index": 81, "review": "Nice ambience, great selection of beers. \nI had the great california stout and loved it.\n\nSeating is extremely limited though. Not suitable for large groups.", "name": "Taplands", "rating": 5}, {"index": 82, "review": "Came here w/ some friends for a chill/relaxing Friday night. The place was filled around 9 pm and the only open spots were by the far end of the bar (though the place wasn't uncomfortably crowded ie when you're standing shoulder to shoulder w/ someone). Everyone there seemed to be having a good time enjoying their beers. Definitely was a chill/relaxed environment (no one was getting wild or stumbling around). Great selection of craft beers on tap (that apparently change pretty often). Didn't get to try the food, but will definitely come back", "name": "Taplands", "rating": 4}, {"index": 83, "review": "A great beer place with good food and good people. An awesome neighborhood hang out. I plan events here with my craft beer Meetup pretty often.", "name": "Taplands", "rating": 5}, {"index": 84, "review": "Stopped by Tapland with a friend for after work drinks. First impression upon walking in was \"mmmmm looks pretty cool\".  It's a good clean place with a super cool wood style bar. I really like the section at the end of the bar you can order your drinks and take em outside, Instead of fighting your way through the bar stools. \nWe ordered a couple different Altamont IPAs both good brews. \nWas hoping for more than one Tapland brew on tap. Hopefully that will change soon. \nWe ordered a Panini it was ok, nothing I couldn't do at home. \nThe service was polite and business like. \nOver all a cool place, but sorry to say nothing really stands out about Tapland.  \n3.5 stars\n\nGo and Check em out for yourself for sure.", "name": "Taplands", "rating": 4}, {"index": 85, "review": "Rudest bartender ever. We went here because the patio allows dogs and the weather was nice, but this bartender ruined the experience and I will never waste my business here again.  She was patronizing and argumentative for no apparent reason.  We weren't drunk, weren't some college kids with a fake ID, and were very patient with the incredibly slow service for the middle of the afternoon.  Even so, I almost walked out of the bar in the middle of the experience because this woman was incredibly unprofessional and petty.  DO NOT waste your time here.", "name": "Taplands", "rating": 1}, {"index": 86, "review": "Ok, I've waited a while to write this review because I've been burned by honeymoon periods before. This place is awesome. I wish it was next door to my house. Then again, that would definitely lead to liver failure or divorce, both not ideal...\n\nGreat beer selection. Actual natural light - which was a little confusing at first, but now I love it (especially as I'm having a lunch beer). Limited food selection, but it's solidly good food. Only complaint is that they sometimes run out of food menu selections, but I think that will get better as the traffic evens out.\n\nTo quote Clueless (yes, I realize I'm admitting that  liked that movie.):\n\"Two very enthusiastic thumbs up! Fine holiday fun!\"", "name": "Taplands", "rating": 5}, {"index": 87, "review": "Went to Taplands for a work Happy Hour.  The ambiance is sparse and little more than a bar with a few side tables and 2 couches.  \n\nHowever, there are TVs for sports games, and beer, good beer. \n\nThere was a variety of beers on tap, easily 20+, all craft beers, including sours, my favorite. \n\nWe ordered the charcuterie and cheese plate and the pita appetizer.   The charcuterie plate was pretty standard, but the Pita appetizer was awesome, all three dipping sauces were better than equivalents I've had at many restaurants, especially the aioli.", "name": "Taplands", "rating": 5}, {"index": 88, "review": "Taplands is exactly the kind of bar I'd hope to own and become a regular if I still lived in the area.  While not a large space, it provides adults a change of pace from the Hut, Seniore's, and Wicked Chicken if they want a craft beer, something to eat, and to catch local sports.\n\nBeing able to support breweries from as close as Golden State Brewing up the street in Santa Clara to some of my other favorites from around the state (Knee Deep, North Coast, Modern Times) was great to have a local pub for non-undergrads.\n\nI will say that:\n\n- I love spicy, but the provolone and turkey sandwich would be too spicy for most people.  \n- The price of most beers and non-charcuterie is cost prohibitive to spending the day there or having more than 1-2 drinks for people on a non tech salary.\n- Menu could serve to add a couple more low cost or different items or allow for outside delivery (e.g. nachos, poutine, etc.)\n- Most of the seating is not comfortable enough to spend more than an hour or so sitting\n- May want to offer a sampler menu to get greenhorns more knowledgeable on most offerings or the variety of ciders offered \n\nI know they're new and the owner is extremely knowledgeable and trying to do too much around the shop, but my server lost track of people's tabs, hard of hearing (poured me the wrong drink), and wasn't very knowledgeable on the offerings.  I look forward to going back when they're better organized.", "name": "Taplands", "rating": 4}, {"index": 89, "review": "Excellent local taproom!!!  Rotating taps, great beer, great atmosphere!!! My favorite place to enjoy great craft beer!!! The entire team is incredible!!!", "name": "Taplands", "rating": 5}, {"index": 90, "review": ".sorry this was meant for halford brew pub . taplands has very nice people and a OK selection what santa clara needs.trying to delete the bad review", "name": "Taplands", "rating": 4}, {"index": 91, "review": "Variety of beers on tap from local breweries and more choices bottled in fridges. Nice decor and helpful folks at the bar. Didn't check out the food options but saw a few people eating sandwiches. Will definitely come back again", "name": "Taplands", "rating": 5}, {"index": 92, "review": "Awsome spot to get a good beer. not a crapy beer in this place if you want cheep beer go down the street and the college kids stay away", "name": "Taplands", "rating": 5}, {"index": 93, "review": "Taplands is your go to neighborhood brew spot that has a friendly staff, great selection and delicious snacks. Chris is a great server, the owner was very present and friendly, both will help you pick a beer that hits all the right taste buds!", "name": "Taplands", "rating": 5}, {"index": 94, "review": "Can't say enough about this awesome new beer bar. Fantastic draft beer selection, really cool and knowledgeable staff and good prices. The space is cool and the vibe is great. Love it. Can't wait to come back again and again! \n\nUpdate: this place is actually getting better, which I didn't think was possible. So friendly, such high quality beer, and free parking everywhere. Rad!", "name": "Taplands", "rating": 5}, {"index": 95, "review": "Did I not write a review a year ago when they first opened? I guess not! I remember when they first opened and I chatted with Matt about his menu, my first impressions, and our snowy hometowns. A year later, Taplands is doing great and I enjoy lunch here, on a Thursday or Friday, about 3 times a month. Nice people, convenient (for me) location, good beer selection, and a killer cheese plate for 12 bucks. Sit at the bar, if you can, and ask about the beers. The staff loves talking about BEER (and cider!)", "name": "Taplands", "rating": 5}, {"index": 96, "review": "The owner is a great guy and took lots of time to talk about the different beers and shared lots of samples! Patio and some cool electronic beer menus on the horizon!", "name": "Taplands", "rating": 5}, {"index": 97, "review": "Just opened and already one of my favorite places!  They have a great on-tap selection of craft beers, they brew their own, the staff is friendly, and a nice non-dive well-lite atmosphere.  And it's within walking distance!", "name": "Taplands", "rating": 5}, {"index": 98, "review": "Feeling like Cheers, in that Matt learns your name and remembers.  I almost gave 4 stars because they are now on winter hours, but the guy is running a business, not a social club.  \n\nAlways interesting selection of beers, leaning heavily towards IPAs (the downside of living in Hipster central) but there is usually a solid sour, a funky wild yeast (think Belgian) and something else unusual on the list.  I like to stop in for a panini sandwich and a pint or two.  \n\nIf you need to, check the beer selection on line before you go, but I like to just take a chance and let Matt point me to the right tap.", "name": "Taplands", "rating": 5}, {"index": 99, "review": "They have very tasty cider's and the menu turns over fairly regularly. Nice addition to Santa Clara!", "name": "Taplands", "rating": 4}, {"index": 100, "review": "Great selection of beer, delicious paninis, and the Mama Bear's Oven Baked cookies are so good! Great place to watch the game and decompress after a long day. Highly recommended.", "name": "Taplands", "rating": 5}, {"index": 101, "review": "Great collection of local beer. Gotta try 'em all!\nNice little place for a perfect peaceful Friday hangout.", "name": "Taplands", "rating": 5}, {"index": 102, "review": "Nice tap selection. Menu on paper and on a TV board. Listed beers coming soon. Asked about one of them and they had it in stock so they served it up.  The Owner, Matt, is very friendly and loves to talk to his guests. Rest of the staff follow his example and are very attentive. You can tell that their goal is to make your experience an enjoyable one.  Makes it a personable and welcoming environment. We only planned on having 1 beer but ended up staying for a few beers and 3 hours.\nWarm olive and pita chip Appetizers were tasty. We ended up ordering a 2nd serving.  Enjoyed the conversations with several people of different age groups. I can see this becoming one of our regular spots. We spent a nice afternoon with Taplands crew and patrons.", "name": "Taplands", "rating": 5}, {"index": 103, "review": "Nice place to unwind in the Santa Clara area.  It has decent indoor seating and an outdoor patio (looked like it was pet friendly).  I'm assuming their tap list rotates since they had a lot of beers I haven't seen anywhere else, and a few I have (if you get a chance to get Rasputin on nitro, it will change your life).  They also have a bottles in a fridge and some finger foods if you're in the mood.  Will definitely visit again.", "name": "Taplands", "rating": 4}, {"index": 104, "review": "Nice place if you are a beer fan.. This place is always crowded. so don't be surprised if you don't get a place to sit or stand even on a weekday.", "name": "Taplands", "rating": 4}, {"index": 105, "review": "Awesome little spot that offers local brews~", "name": "Taplands", "rating": 4}, {"index": 106, "review": "Nothing like it nearby, and it has a bunch of beer to try! It's close to campus, and it's classy enough not to be littered with bumbling fools. It wasn't too shabby grabbing tables for the 5 of us, but when other friends came, it got a little tight. The staff was incredibly helpful in answering questions. Will definitely go again.", "name": "Taplands", "rating": 5}, {"index": 107, "review": "Update!\n\nI just found out that I was charged 4 times for my beer!  My credit card was swiped, said it didn't go through so the bartender tried it again.  Still said it didn't go through so I gave my debit card.  Again, the bartender said it didn't go through so he tried it a fourth time.  This time he said it went through.  I check my bank accounts today and find that I was charged twice on my credit card and twice on my debit card.  My wife and I's $14 beers cost us $56!", "name": "Taplands", "rating": 1}, {"index": 108, "review": "Introduced to this place by my coworker and happy he did. Great beer selection and wonderful service. We came last night and the crowd was pretty chill. Matt knows his craft beers and suggests options based on your taste. You know a place cares about their customers when their own patrons buy 3 extra large pizzas for the entire bar. I actually have friends who have found this place on their own and enjoy it as much as I do. Will definitely be back. Great job Taplands!", "name": "Taplands", "rating": 5}, {"index": 109, "review": "Its alright nothing special i rather go golden state brew much better over there this place okay", "name": "Taplands", "rating": 3}, {"index": 110, "review": "Good beer. Decent place to hang with friends.the bartender is very friendly and has helpful recommendations.", "name": "Taplands", "rating": 4}, {"index": 111, "review": "Great selection of beers and charcuterie right in old Santa Clara. Great place to hang out.", "name": "Taplands", "rating": 4}, {"index": 112, "review": "Great place to enjoy a good variety of brews!  We had heard about the opening of this new place but only just got out this weekend.  We had the opportunity to taste across the spectrum of brews and enjoyed each and every one.  The Tortuga was my favorite for its hoppiness.  The stour on tap was buttery and filled with flavor.  I even liked the white chocolate tasting stout on tap.  I think there was something on tap for every type of beer drinker.\n\nWe also enjoyed the small selection of food.  We got the Spicy Turkey Panini.  It is definitely spicy!  But I like spicy and had a beer at the ready to cool it down.;-)  They have not opened the outside seating yet but I saw them working on it when I was there and look forward to sitting outside during the summer nights upcoming.\n\nAll in all I love the new local brewery and will be back to support it!", "name": "Taplands", "rating": 5}, {"index": 113, "review": "Solid variety on tap, great staff and good location.  Glad I found this place", "name": "Taplands", "rating": 5}, {"index": 114, "review": "I'm a SCU alumni who stayed in the neighborhood, and this is exactly what the community needed. The beer selection includes great local brews, and the staff is beyond friendly. Looking forward to frequenting this spot.", "name": "Taplands", "rating": 5}, {"index": 115, "review": "Good beer selection but something is wrong with their lines. Both beers I tried (IPAs) were uncharacteristically low in carbonation. As I looked around the place I didn't see one beer with decent head/foam. A friend validated my concern and he was there a month before me!  Fix the taps and I'll be back.", "name": "Taplands", "rating": 3}, {"index": 116, "review": "It's a nice neighborhood spot but the service is selective. We came here to watch the 1st qtr of a Warriors game before going to another event. After the first 5 min there we noticed how were being treated a different way than the others there. And the service was slow, we ordered a cheese plate and it took over 20 minutes. There was only 1 person preparing and bringing out the food.", "name": "Taplands", "rating": 2}, {"index": 117, "review": "Lovely place. Great beer. Great owners. Super fun and relaxy. They have their own brews but a great selection of micros and growlers too.", "name": "Taplands", "rating": 5}, {"index": 118, "review": "Just our kind of place. Many brews on tap, including their own. Friendly owners, comfortable tap room and bar seating. Not fake hip nor a dive bar. A great stop after work or on the way to dinner. This is an outstanding addition to the Old Quad, Santa Clara University neighborhood.", "name": "Taplands", "rating": 5}, {"index": 119, "review": "Awesome spot! They have 25 unique and tasty beers on tap (including their own). Great spot! I'll be back!", "name": "Taplands", "rating": 5}, {"index": 120, "review": "Great spot to have in Santa Clara. Local, family owned/run and great decor with a really decent selection of craft brews on tap and in the fridge for take-home.", "name": "Taplands", "rating": 5}, {"index": 121, "review": "Arrived as they opened for the first time.  Beer and service was awesome - and it's dangerously within walking distance.    Thanks Taplands!", "name": "Taplands", "rating": 5}, {"index": 122, "review": "Dropped by for a beer and was really impressed. Huge selection of very interesting beers that I have never had before. Easily the best beer selection in Santa Clara (Silicon Valley needs more places like this).", "name": "Taplands", "rating": 5}, {"index": 123, "review": "This place is great! To be clear: their focus is serving tasty beer to their clientele. The beer is good. And if you don't like the first beer you try, they will not count pennies serving you more samples until you find the next beer you really like.", "name": "Taplands", "rating": 5}, {"index": 124, "review": "Good variety of brews and the panini's were excellent! Matt the owner was knowledgeable and personable. Great bar!", "name": "Taplands", "rating": 4}, {"index": 125, "review": "Taplands is a great spot for the beer connoisseur. The owner are a great guy and their beer selection is solid and always changing by the week. I am becoming a regular as it's a nice relaxed vibe to enjoy a couple cold ones. I highly recommend checking this spot out.", "name": "Taplands", "rating": 5}, {"index": 126, "review": "Great selection of beers (including my favorite IPA's) and a very solid atmosphere. If you like craft beers, this is the spot to hit up, drink a few and relax!", "name": "Taplands", "rating": 5}, {"index": 127, "review": "I organized a corporate team-building event for 30 people in the area and we met up at Taplands for food and drinks before/after the event.  I had the pleasure of working with the owner Matt to set everything up. He is a great guy, flexible and provided great options and suggestions for our event.\n\nTaplands has a great atmosphere, friendly staff, extensive selection of beer, wine, and non-alcohol drinks.  People in my group were very impressed with the list of beer - it had something for everyone.\n\nWhether you are watching the big game, meeting up with a friend, planning a group outing or just looking for a great IPA - I highly recommend Taplands!", "name": "Taplands", "rating": 5}, {"index": 128, "review": "Taplands is awesome! There really isn't very many places around this area with a primary focus on beer. Taplands does a great job at catering to all craft beer drinkers with the variety of selections they have not only on tap but in bottles. As far as atmosphere its not a massive place so it can get busy at times but they just added a new outdoor patio with plenty of seating, its been a great new addition for the summertime. Ive been here a bunch and really enjoy talking beer with the owner Matt and the manager Chris, super knowledgeable guys. Their beers that are brewed in house are great, they really have a homebrew taste to their beers which is great because honestly where can you get that around here? All in all I really love coming here and have had many great nights here! Keep up the good work guys!!", "name": "Taplands", "rating": 5}, {"index": 129, "review": "My new favorite place to have a beer! Loved the Morning Time stout, and hoping they add some brown ales soon. Also the meat tray was very good!!", "name": "Taplands", "rating": 4}, {"index": 130, "review": "Really love taplands. Very friendly staff, excellent selection of rotating taps. Not the liveliest of venues but definitely a great place to come with some friends to try some new beers and play a board game or card games (BYO games).", "name": "Taplands", "rating": 5}, {"index": 131, "review": "Great variety, good food portions, and super clean. Great place for mid day break or drinks with friends. Very welcoming.", "name": "Taplands", "rating": 5}, {"index": 132, "review": "Very friendly service.  Great micro beer selection.  Kiln fire turkey panini was excellent.  I love this place.", "name": "Taplands", "rating": 5}, {"index": 133, "review": "Great new taproom in Santa Clara. Matt makes sure all 24 taps dispense a wide variety of great tasting craft brews. Love the friendly, neighborhood vibe. Go grab a pint, learn about beer, and make a friend.", "name": "Taplands", "rating": 5}, {"index": 134, "review": "Great selection of beer, friendly staff. Lots of beers to choose from. It's nice that they let you taste a sample before investing in a beer. Taps change often which is great for \"beer enthusiasts.\"", "name": "Taplands", "rating": 5}, {"index": 135, "review": "This is the coolest family owned brewery! The owner is awesome and the whole crew is amazing. Great beers and great bites. Definitely a place to come hang and make friends.", "name": "Taplands", "rating": 5}, {"index": 136, "review": "Nice place owner operated. I enjoy tasting beer and this is a great place to try something good and different.", "name": "Taplands", "rating": 4}, {"index": 137, "review": "Awesome new taproom with 24 taps of craft brew and bottles as well. Dog friendly outdoor seating soon. They also feature their own brews but tonight only one. Friendly service with a chill atmosphere. Reclaimed wood accents. The wife reports clean restrooms. Located on a major bike lane. Parking was easy in the evening.", "name": "Taplands", "rating": 5}, {"index": 138, "review": "I had a sour from Bear Republic and it was AMAZING. I am a huge sour beer fan and this was by far, the best!", "name": "Taplands", "rating": 5}, {"index": 139, "review": "A new place for great craft beer. Light and airy inside with friendly employees. This a my new go to place for good beer! Highly recommended.", "name": "Taplands", "rating": 5}, {"index": 140, "review": "Barely 4 months since opening, this is already hands down the destination pub for beer geeks and the craft curious in the South Bay. Well curated, rapidly rotating tap list. No loser beers wasting tap space. Friendly vibe, streetside covered patio. A couple of screens showing sports but good not-too-loud music will be playing, so conversation is more than possible. Not a huge space and the secret is out, so plan accordingly.", "name": "Taplands", "rating": 5}, {"index": 141, "review": "This new neighborhood gem has 24 rotating taps and the diverse spectrum of beer styles will keep any beer drinker satisfied. The menu is simple but tasty and has options for meat eaters and vegetarians alike. A cool layout with outdoor seating in the works. One of my new favorites!", "name": "Taplands", "rating": 5}, {"index": 142, "review": "cool place, brand nee, great local beer selection and a chill corner location with a clean and breezy atmosphere.", "name": "Taplands", "rating": 5}, {"index": 143, "review": "Went in here with my buddy a few weeks after it opened. We both enjoyed the conversation we had with the owner who was very personable. Great beer selection and great paninis. Definitely planning to go back soon!", "name": "Taplands", "rating": 5}, {"index": 144, "review": "Yay! A wonderful place to sample a variety of beers! Our arugula salad was fantastic, as well. So glad to have a place to stop when we visit my sister in law!", "name": "Taplands", "rating": 5}, {"index": 145, "review": "Great place, nice staff, good brews, I had the Johnny Mac Wry Red, which was light and nice!", "name": "Taplands", "rating": 5}, {"index": 146, "review": "First time at Taplands, large group that all love beer. Stood at bar waiting for service for a long time. Next round same. Watched the two bartenders talk for several minutes as we stood there. Decent beer selection. Cost more than most other places both in San Jose and mountain view. Not bothering to go again", "name": "Taplands", "rating": 1}, {"index": 147, "review": "Amazing selection, great atmosphere, and an extremely nice, polite, and knowledgeable owner.  It was a pleasure to talk to him, and I look forward to making this my new go-to spot.  If you like beer, you would be hard-pressed to find a better selection.", "name": "Taplands", "rating": 5}, {"index": 148, "review": "Great beer - a good selection of microbrews plus some excellent ones brewed in-house. I didn't get a chance to try the food. Nice clean, modern decor. I'm planning to go back regularly.", "name": "Taplands", "rating": 5}]