[{"index": 0, "review": "This is my go to neighborhood store for any last minute groceries and to get some good cuts of meat, poultry and fish.\nThey have fresh cheese, salsas and picos that I always buy to make nachos. \nThere is a good selection of fresh produce at a reasonable rate.\nThey have some bakery stuff as well out of which I have tried the bread which is nice.\nAll in all, even if its a small store, it has most things one would need.\nThe staff is good and helpful.", "name": "Arteagas Food Center", "rating": 5}, {"index": 1, "review": "Small little Store as other reviewer's have noted but it has all the essentials to be the perfect neighborhood store. \nIt's part of the same small chain of Mexican grocery stores sprinkled around San Jose. \nThe vegetables are super fresh and love the huge meat sections that takes up an entire wall. They are a great stop for something you need to pick up quickly as well as all the specialty meats you may need. \nAlso love they have prepared Mexican dishes like cactus salad and of course salsas.", "name": "Arteagas Food Center", "rating": 5}, {"index": 2, "review": "I live in Santa Clara, walking distance from this Arteaga's location. My family and I always shopped the location in San Jose; when we heard this location was opening we were extatic, \"we thought no more driving to San Jose\" we gave it a try \nAnd we we're pleased until we noticed a new butcher who refuses to use gloves while handling meat to cheese to chicharrones. This has been several times already. Ofcourse I brought it up to management's attention and was addressed in front of me as \"this customer is saying you didn't wear gloves\" I dint appreciate being put on the spot like; I find this behavior unprofessional. I kept addressing the issue and no change. My family and I do not shop this location anymore. It's unsanitary  to handle raw meats and cheese by only wiping hand on apron. Frankly that's just gross.", "name": "Arteagas Food Center", "rating": 1}, {"index": 3, "review": "Awesome little grocery store! We live nearby and realized when we got back from Safeway that we forgot flour. Walked over to this place and was able to find some flour! Yay. \n\nIt's a small store but has all the essentials. The people are super friendly. Feels like a mom and pop shop. They have great looking fresh and marinated meat. Also lots of raw beans. They have  fresh produce, too!", "name": "Arteagas Food Center", "rating": 5}, {"index": 4, "review": "I love this cute little market. It sits across the street from a 7/11 but I would definitely go to Artegas instead. Always clean, the staff is helpful and kind. The guacamole is house made and delicious.  They have a good selection of salsas and cheeses. All around, good stuff. So happy they opened in our neighborhood.", "name": "Arteagas Food Center", "rating": 5}, {"index": 5, "review": "This is as good as it gets for the area, there is a another one called Buenos Amigos which is bigger. But I prefer this one, YES it is small but beats going to San Jose to a Mi Pueblo. I have purchased things to make salsa and also have bought meat from their carniceria.", "name": "Arteagas Food Center", "rating": 5}, {"index": 6, "review": "Awesome little market. It's seriously tiny but it should have you're usual Mexicana staples.\nGot some papaya, nopalitos, queso fresco, chayote, etc.\nIt's seriously clean and new. Just tiny.\nClose to home though, so very conveniently located.", "name": "Arteagas Food Center", "rating": 5}, {"index": 7, "review": "Compared to my usual Newark location I liked this one much less. Tiny overcrowded parking. Salsa Roja was kinda watery. But they do have the usual friendly and helpful staff. Sooo, A-OK rating.", "name": "Arteagas Food Center", "rating": 3}, {"index": 8, "review": "Too tiny for a grocery store, they have the same as a 7-eleven, and the prices are so high. The meat market display is very small as well..", "name": "Arteagas Food Center", "rating": 2}, {"index": 9, "review": "I've been to other Artega locations like in Salinas and San Jose, but this one has been the worst one I have ever been to. Although it is small I thought I'd try it out since I am a resident of Santa Clara and it is hard to come by Hispanic grocery store locations. This one is located on the corner of Scott Blvd and Monroe across the street from a chevron. It is so new I am the first person to review it, hence no specific address provided. I am very disappointed in the service I got here. I stopped here to buy \"Costillas de Puerco\" and Nopales so I could prepare this dish for dinner the following day. The produce people were very nice and welcoming but once I got to the carnecero or the \"wannabe butcher\" it was another story. There were two butchers at the time and one other huh in charge of the crema, queso, and other items. It took them a while to ask me if I needed any help. The cheese and Crema guy asked me if I needed anything but I needed Costillas so I waited for one of the other butchers to approach me so I could ask them for what j wanted. They started speaking in Spanish and talking \"Ishhhh\" thinking that I didn't speak Spanish and started laughing. I was like ok whatever they are not professional I can deal with that I am not that sensitive. So I let it go. Then when I was finally approached (side not there was no one in front of me) the smart ass who attended to me was sarcastic. I told him I didn't know how much I wanted and he looked at me like I was stupid. I asked him if I could see a pound and he showed it to me and it seemed to be around the right amount. I asked specifically if he could cut them in small pieces since they come in long rib strips. He looked at his fellow \"butcher\" and laughed like I was stupid to ask for this request. (What's the point of having a butcher if he can't do special requests, I mean I wasn't asking him to perform rocket science. He has a sharp knife so that was it would be easier for him to cut it then me because my home knives are not that sharp) anyway he acted like he did it. Took him like  10seconds as he turned around and I didn't even pay attention because by that time I was so frustrated I just wanted to pay and get out of there!!!!!! Btw this happened yesterday!!! Today when I got home from work to cook I pulled out the Costillas bag and began to add them to my pan and what do you know??? That lazy worker just threw them in the bag. Maybe made like 2 cuts of soft fat on the side but they were still in strips. I am fluent in both Spanish and English and I spoke to him in Spanish very clearly! So now maybe you can understand my frustration it took me extra time to cut them into small pieces. He could have just told me he was to lazy to do it and I would at least respected the fact that he was honest. It would have saved me the 10 minutes of me waiting and dealing with his sarcastic a**! Look I am a nurse if I do my job half a** someone could get hurt. So why do these clowns think it's ok to mess around and waste people's time! I am so frustrated because not only did he provide the worse service ever he thought he was mr funny guy while doing if and his co workers thought it was cute to! So learn from my mistakes. Don't get excited to see a Mexican grocery store and just go! They Suck id rather drive all the way to Sunnyvale and go to Chavez supermarket and pay more for the items then drive less than four blocks away from my house to get sh*tty a** service! Pheww I fell better know! I cook everyday and Artegas please get it together! I would have been a frequent a loyal customer! But you just lost a good customer! Although he is a butcher he should be professional and know what he is doing not act like a clown and still do a sh*tty Job!!!!", "name": "Arteagas Food Center", "rating": 1}, {"index": 10, "review": "Idk why the other reviewer was so mad. Everyone was really nice to me and the store is super cute. Got a fully loaded meat department and produce section. Now I don't have to go all the way to Safeway or sprouts for chicken. Yay!", "name": "Arteagas Food Center", "rating": 5}, {"index": 11, "review": "Its a nice pop up Mexican grocery store. I grew up in this area and my parents always had to drive to San Jose in order to get some carne, queso fresco, tortillas, all that good stuff so its finally nice to have a grocery store nearby. What I like about this place is that its clean and always seems to be well stocked. Also, they have some Mexican chucherias (junk food) that I had never seen before and my fat ass lovees that.", "name": "Arteagas Food Center", "rating": 5}]