[{"index": 0, "review": "This place is right down the street from my work so this place is great when I'm feeling a lil hungover at work. The beef pho is my go to. The broth is better than average and the meat is a decent amount. Service is good too.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 1, "review": "Had some take out. Good banh mi sandwiches. \n\nTried the pork which was the best one. The chicken was just a but too salty. Ordered a beef one, which ended up being a regular roast beef sandwich. \n\nOne star off for storing the bread in a open bag next to the bathroom.", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 2, "review": "The sandwiches are OK. Wouldn't recommend this place unless you work nearby and have no time for other options. The food is acceptable and service is alright most of the time.", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 3, "review": "Mom and Pop shop joint that serves simple VN soup and sandwiches. They also.serve american and Italian sandwiches. Sandwiches are.made fesh and taste deliscious. Staff also delivers uick service. I heard that the house specilty chicken curry are the best\nI'll try their curry dish next time.", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 4, "review": "Walking out of this place as I write up this review. I used to come here a lot since my work is right around the corner but the service sucks. \n\nWhen I previously went here, they had kids ringing up people. Nothing against the kids but dang, child labor! \n\nI ordered a Vietnamese sandwich and Vietnamese coffee. Took them 15 min to get my order ready and the people who ordered after me got their order first. I've ordered their Banh Mi before but this time the pork was just way too salty and they didn't even put it on the regular Banh Mi bun. They substituted the bread with a regular white loaf. Boo. Probably never coming back.", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 5, "review": "First off let me make this clear you do not answer the phone when starting what do you want how can you run a business with an attitude like that I will never come to this place again I hope this place shuts down...ZERO STARS FOR THIS DISRESPECTFUL PLACE", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 6, "review": "This place used to be a 3 star until they changed owners....\n\nI used to get a BLT here sometimes which used to be good. After they switched owners I got the worst BLT ever in my life. So I never ordered  it again.  I won't dare order another sandwich there again. Afraid of the quality.\nI went back for the specials they used to have. Those still taste great ! The chicken curry and the lemon grass chicken are very good. \n\nThe only bad thing is it costs more than it used to. They seemed to raise their priced for the same quality of food. \nI'll still come back for specials because it's soo close to my work and different from just an ordinary sandwich.", "name": "Lily Coffee & Sandwich", "rating": 2}, {"index": 7, "review": "Overpriced and extremely small portions.   I ordered a pork Vietnamese sandwich and a viet coffee and it came out to be $8.  O_O You got to be kidding me... Sandwich is pathetic.  It's on a really small baguette - the hard kind that tears up the roof of your mouth - and barely has any meat or veggies in it.  When you open the wrapper for the sandwich, you can't even see any meat or veggies sticking out of the tiny piece of bread! Saddest excuse for a banh mi ever...  Pork had a lot of fat pieces that I ended up eating anyways because I didn't want to just eat bread LOL :( As for the coffee, they don't fill it up all the way.  Can't comment on how strong it was as I don't usually drink it but needed a caffeine fix but it was very sweet.  \n\nOnly came here because I work in the area and food options are very limited but I definitely will not be returning.", "name": "Lily Coffee & Sandwich", "rating": 2}, {"index": 8, "review": "First time there with a coworker, oh wow, went to the restroom n once i turned the light on, cockroaches scattered everywhere !!!! No exaggeration, looked to my left n saw a few containers of ant/cockroach killer on the shelf....sandwich price was good, $3.99 but after seeing the roaches, i decided to not order anything at all as did my coworker !!", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 9, "review": "Came to Lily Coffee & Sandwich for a coffee. Not a good experience. I waited for 10 minutes and ended up with slightly warm coffee and no creamer. How can a place that advertises Coffee in their name not have creamer or milk?!! To top it off the place had a slight stench of raw meat. Very strange. Do not go here.", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 10, "review": "When you're hungry and don't have a lot of time you have two choices:  lunch truck or nearby cheap cafe.  Today I chose the latter.  \n\nI came across this little hole in the wall one day OMW to Togo's.  I decided to check it out.  Low and behold it was a little itty bitty Mom & Pops cafe where they serve sandwiches and some simple VN soups.  The VN sandwiches are not bad for $2.75, I had better but I certainly had worse.  The $4.50 Specialty sandwiches are price point better than Togo's and almost 1/2 price than Specialties down the street.  It ain't nothing fancy or anything, nor should you expect it to be for under $5.\n\nI like coming here because it's cheap, quick, and like supporting family-run businesses.  When you come here, you'll get rung up by the little 12-year old daughter and food will be brought out by her 10 year old brother.  The parents are in the back calling the school and making excuses of why they didn't show up for class today......and everyday.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 11, "review": "Only for quick stop for calories - options are sandwiches and handful of Vietnamese dishes. \n\nGot mediocre BBQ chicken sandwich for $5 - enormous loaf, slightly dry chicken, kind of funky fatty bacon, and ok tasting BBQ. \n\nDisappointed that a Vietnamese place would be out of spring rolls...", "name": "Lily Coffee & Sandwich", "rating": 2}, {"index": 12, "review": "Their lunch specials are worth it. I had the curry chicken with rice and bread and it was a huge portion. I probably could have gotten two meals out of it but I ate it all. Hee.\nService is friendly and they have a lot of options on their menu. I have gotten their chicken sandwich and it was really good. Would get it again. Much better selection than Togos which you could walk to from here.\nOutside seating available to so you can enjoy the day along with your food.\nI don't go our of my way to eat here but if I'm around, this is where I stop.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 13, "review": "This place runs out of things constantly, and never has bagels or muffins, even though they advertise that they do. I ordered a breakfast sandwich one time & they gave me a regular sandwich. Very disappointing", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 14, "review": "Ordered the grilled chicken sandwich, #13, good flavor but disappointed that it was not on a baguette rather it was a French roll. Plus side that they accepted debit card and plenty of parking before noon.", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 15, "review": "Good soup , good sandwiches, try there noodle soup and chiken tryaki sandwich.\nYammy", "name": "Lily Coffee & Sandwich", "rating": 5}, {"index": 16, "review": "I have been coming here for about 2 years, the service and the portions were (notice were) amazing, I used to go there for breakfast and lunch nearly every day. \n\nThe original owners sold the place to someone new; here are the new changes that I am aware of: \n\n1. Prices went up A LOT\na. Viet Coffee and a breakfast burrito is now $7.50 where it used to be 5.50\n\n2. Portions went DOWN a lot\na. Coffee is now serviced in a small cup and they leave room, about 3 inches from the top\nb. The burrito used to be big with plenty of portions, now you get 1 piece of bacon a tomato and a dash of scrambled eggs. \nc. The Viet Sandwiches  are now on a Baggett with no meat (or very little) and very little vegies\n\n3. Rude service\na. When you tell them that your order is not right they do not care and will not fix it, instead they say you can change it next time.\n\n4. When you order something, you will usually not get what you order.\na. I ordered a Viet coffee and a bagel with cream cheese what I got was a American SMALL coffee and a bagel with butter which cost me $5.75\n\n5.  You now have to spend $6 to use a credit card. However, doing so is blatantly against their merchant agreements with Visa, MasterCard, American Express and Discover - all of which said a minimum purchase amount is not allowed.\n\nMy old favorite place to go is now a place I refuse to go to, only reason I gave them a 1 star is because the girl that serves the counter is kind of cute.", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 17, "review": "Service just ok. Most of the items I wanted to order was no longer available, claimed they no longer make the dish. Food not that great, would not recommend this place to anyone.", "name": "Lily Coffee & Sandwich", "rating": 2}, {"index": 18, "review": "If you are looking for a good place to eat lunch but don't want to wrestle with the lunch crowd then check this place out. There is always a place to park in the little plaza.\n\nI have been coming here for two years, usually once a week. I always order the same thing, pho bo for here! The majority of their menu are sandwich's but they also have a small Vietnamese menu. They also have a daily special worth checking out too.", "name": "Lily Coffee & Sandwich", "rating": 5}, {"index": 19, "review": "I ate about a million calories last week.  I didn't do any groceries because my weekend was spent w/ him and his brother in downtown San Jose.  I had food for the little ones so I had little regards to what I was going to eat - literally.  \n\nNot in any particular order but last week I had: Philly steak omelet, a brownie, a stromboli, a cannol, Big Mac and fries, 1/2lb of beef brisket, 1/2lb of pulled pork, a peanut butter pie, a loaded grenade (baked potato stuffed w/ macaroni and cheese and jalapenos wrapped w/ bacon), a blueberry donut, a double chocolate brownie, and a short rib burrito.  I was thankful each morning after I jumped off the scale; I somehow maintained my weight.  Thank goodness for the gym and Insanity.\n\nI picked Lily Coffee and Sandwich for lunch last Thursday because a) I haven't been there and b) the $4.95 a sandwich enticed me.  I don't know how busy it gets but I came a little after 1 and it was still pretty packed.  You can get your order to-go or dine there as there are about 10-12 tables.  I failed to see the \"Today's Special\" sign because it's located at the counter where you order but on the floor... I mean you could see it right when you walk in if you are very observant but knowing me and my tendencies to be oblivious to my surroundings, I missed it entirely.  The special last Thursday was: cold noodle w/ chicken, carrot, cilantro, peanuts, fish sauce, onions, and an egg roll for $6.00  That is a very good deal for a chicken vermicelli bowl also known as \"bun\" in Vietnamese.  I would have gotten that but I had already ordered The BBQ Chicken sandwich: chicken, bacon, BBQ sauce, and cheddar cheese on a toasted roll.  \n\nThe lady at the counter is friendly but will seem short because she's just trying to get you to order, ring you up, and move onto the next person.  I received a shocked look when I asked her about the shredded chicken sandwich in Vietnamese. The wait was anywhere between 5-8 minutes which wasn't bad at all.  I decided to eat there but I got a lot of stares.  \"I eat by myself all the time so screw you\" was my attitude and look but honestly I was too focused on my meal and Yelp to bother w/ anything or anyone else.  \n\nThe roll was toasted perfectly.. slight crunch but did not fall apart w/ crumbs everywhere.  The chicken was dry and bland but I guess that was what the BBQ sauce is for.  The BBQ sauce was put on evenly throughout the entire roll.  The cheddar cheese did not fully melt otherwise it would have incorporated well w/ the dry chicken and BBQ sauce.  The bacon was delectable!  I think I would enjoy pickles and lettuce on that thing but I'm not complaining.  I was hungry and wanted something cheap for lunch and got it.  \n\nHere's the menu- \n\nBeverages:\n- regular coffee $1.25\n- single espresso $1.95\n- double espresso $3.00\n- capppuccino $2.50\n- double cappucinno $3.35\n- carmello $2.50\n- double carmello $3.50\n- mocha $2.50\n- double mocha $3.50\n- latte $2.50\n- hot chocolate $2.50\n- Vietnamese iced coffee $.50\n\nBreakfast:\n- bagel and cream cheese $1.75\n- muffin $1.50\n- breakfast burrito and breakfast sandwiches $2.76\n\nCold Lunch Sandwiches at $3.75 \n- roast beef\n- BLT\n- corned beef\n- ham\n- turkey\n- salami\n- cheese sandwich\n- chicken salad\n- tuna salad\n- egg salad\n\nSpecialty Hot Sandwiches at $4.50-$4.75\n- The Monterey\n- The Valley Vegetarian\n- The Gallo Special\n- The Grilled Chicken\n- Classic Italian\n- The Transition\n- The California\n- The BBQ Beef\n- The Triple Decker Club\n- The BBQ Chicken\n- Tuna Melt\n- Shredded Chicken\n\nSalads at $4.00-$5.00\n- classic green salad\n- Chinese chicken salad\n- chef's salad\n- cobb salad\n- chicken ceasar\n\nSoups at $6.00-$6.75\n- beef noodle soup \n- chicken noodle soup\n- seafood udon\n\nMisc. Items \n- spring roll $2.75\n- chicken mango $5.00\n- fruit $2.50\n\nThey do sell chips, candy, soda, fruits, and other packaged pastries.  If you want something inexpensive for lunch and a clean place to eat then this spot can satisfy. Parking is plentiful when I came but don't count on that when you go at noon when everyone in Silicon Valley is out having lunch.\n\nToday is day 2 of eating healthy.  I brought 1/4 of my BBQ pulled pork on Dutch Crunch for lunch and for dinner, 2 beef skewers.  I might have a Fiber One Chocolate Fudge Brownie as a snack later because when I came into work, a box was left on my desk!", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 20, "review": "Quick, Fast and Cheap, but not in a bad way. I have had many different types of sandwiches here and have yet to be disappointed. Definitely recommend to friends and co-workers.", "name": "Lily Coffee & Sandwich", "rating": 5}, {"index": 21, "review": "It's decent. Nothing too special. \n\nMy first visit here: Ordered the Chicken sandwich special. It came on sliced bread with lettuce, tomatoes and some chicken. Nothing too fancy - I could make a better sandwich at home. No sauce, pretty dry. \n\nI also ordered the spring rolls. Pretty decently priced - as so i thought. I got the spring rolls and they have 1 small shrimp, sliced down the middle to make it look like there's 2.. Good try - customers notice. Also came with avocados which was a nice change. \n\nService was friendly and very home like. There was the mom, which i assume was the owner, and several younger children taking the orders, making the sandwiches and cleaning up the place. She was attending to other tasks. \n\nWill I go back? Most probably, but it's not going to become a regular spot for me.", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 22, "review": "The only place to get a good enough breakfast noodle bowl around. It is open early, that the only reason I give it a three stars raiting.\n\nFood wise it is a 2-stars place as its best.\n\nPho is cold by default (you should ask to make it warmer) and broth tastes not good. It is an OK cheap pho, a 2 stars match.\n\nVietnamese sandwiches are made with not-so-good baguette. Stuffing is a bit on a oily side. It is adequate for its price, a 2 stars rating.\n\nBottom line: an OK early birds place, adequate for the price, eat here to often seems to be not very healthy choice. Some rare days when you just do not want to make a breakfast this place would save your morning.", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 23, "review": "In two short months, I've become the Duke of Lily's.  What keeps bringing me back?  If you've read my reviews, you already know that I'm very particular about banh mi (Vietnamese sandwiches).  \n\nWhen I was scouting office space, the first place that I ate at was a Vietnamese deli in front of an office park on De La Cruz.  I found it odd that they only had one kind of Vietnamese sandwich on the menu.  It had a thin layer of pate and tender pork with cilantro, sliced daikon and carrot inside of a delectable crispy French bread roll.  \n\nIt's a fairly standard formula for banh mi, but as Lee's Sandwiches has proven, a bread that doesn't give a whole lot (along with jagged edges) is not bread at all.  Fortunately Lily's gives plenty, and can be compacted by your incisors quite easily.  Believe me, I know 6x and counting.  \n\nAnother off-the menu occasionally on the special board is the lemongrass chicken banh mi.  It's quite good, but I wish they wouldn't shred the chicken so much.  I like the mom and pop feel of the family-owned business.  If I'm not mistaken, everyone in the staff is from the same family, down to the father, son and daughter.  It's quite friendly, and there are plenty of places to sit and park your car, unlike most restaurants in the area at lunch time.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 24, "review": "Bad food bad service I came there 5 time waiting for orders VietNamese sandwich long time sandwich they makes is so bad I never come back again because bad food and bad services", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 25, "review": "This place was great when it was just the parents & children running it, but now they have new people that seem very clue less. I was there today for lunch & order their chicken soup to go, when I got to the office I discovered they had only given me chicken, noodles & broth no veggies. When I called to ask  why they didn't include them with my soup the girl on the phone in a very rude way answered \" I don't know maybe we ran out  or we forgot you can get them next time,\" not even an apology. If I'm going to pay 7.50 for a soup I expect the whole meal not just partial. very very disappointed", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 26, "review": "This is exactly what this place advertises it to be.  A simple, cheap, quick, no frills, lunch spot.  Hole in the wall that's located in a small business parking lot, you definitely are not coming here for ambiance or anything fancy.  \n\nBeen on the hunt for good Vietnamese Sandwiches around my work area in Santa Clara and found this place through YELP.  Don't understand how it can be so difficult to find a good bahn mi shop in San Jose.    To me, hands down, Saigon Sandwich in SF is still undeniably the BEST bahn mi sandwich ever.  Anyway, I digress....\n\nOrdered the Vietnamese Chicken Sandwich ($3) and found it to be neither great nor bad.  Bread had a nice texture, crunchy on the outside, soft/chewy on the inside.  However the meat and what was in the sandwich was what I was not impressed with.  Chicken was flavorful but i found the sandwich to be dry and it did not have enough daikon/cilantro complimenting it.  This place will give you a quick fix if you are craving a Vietnamese sandwich but it'll be very short lived.\n\nCoworker ordered the beef pho for $6.75.  Portions seemed huge and broth came out piping hot (total plus for me).  Didn't get the opportunity to try it but she said the broth was a little salty but overall decent pho for the price.  Again, don't come in here with expectations.  You usually get what you pay for.", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 27, "review": "I've been frequenting Lily's Cafe since I began working in the area about a year ago. I always order the same two things....BBQ Pork Vietnamese Sandwich or the Pho Ga....I am never disappointed. The Pho is especially unique. I can't place my finger on it but there seems to be more ginger and herbs in the broth than I'm used too, I LIKE IT!\n\nLet's not forget Lily's array of drink choices and their awesome snack wall. Also, the adorable and random street coffee stand which serves as an extension of their front counter.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 28, "review": "I love Vietnamese food and I was in the mood for a Vietnamese coffee so I decided to come here. I had already seen a yelp review that showed a photo of a roach an ignored it.  I got the lemongrass chicken sandwich which was awful. The bread had a really funky smell that even my co workers noticed when  I opened it in the kitchen. The worst part was that while I waited for my sandwich I saw another dead roach. Their Vietnamese coffee was good but everything else was repulsive.", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 29, "review": "For a mom and pops cafe, I would have to say that they have the fastest service, and the most delicious and authentic vietnamese food in the area. I've only had their pho, but will def. come back to try their vermicelli noodles.  Watch out Lee's Sandwich! \n\nThis place is quite clean and sanitary. For the price, you can't get any better than this! \n\nTip: The Vietnamese coffee is best when the ice is melted. Yes, it is very syrupy if you chug the coffee before the ice melts.", "name": "Lily Coffee & Sandwich", "rating": 5}, {"index": 30, "review": "Best place for lunch if you're in the Santa Clara area! I love it here!  I was a bit skeptical at first but I was sick at work and pho just comforts me so I gave it a shot. Im so glad I did! It was better than most places I've tried. Yes it is family owned so please be more patient.  They are the most sweet people ever!  I love their pastrami and lemongrass chicken sandwich. Its a footlong for $5 and taste a million times better than Subway. They also have a wide variety of snacks and drinks.  I like the Vietnamese coffee and mocha here!  Neil actually learned out usual but sadly I dont work in that area anymore so I won't be a regular anymore but I highly recommend them to everyone!  They also take card so no worries if you don't have cash!  Yes you can enjoy a nice homemade lunch now in under 30 minutes,  you're welcome.", "name": "Lily Coffee & Sandwich", "rating": 5}, {"index": 31, "review": "Pretty awesome! Great prices, big portions, very fast service. Felt healthy, perfect place for lunch.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 32, "review": "The pho ga was surprisingly good. Full of flavor. The pork Vietnamese sandwich was just ok. The meat was too fatty, and there actually wasn' t that much in it. Great convenient place by my work and it isn't a hassle to park or order food.", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 33, "review": "I've only been here once and it looks like a hole in the wall; in fact it is a hole in the wall. The menu was limited, but this was the first coffee and sanwich place that actually had pho. Though there were only two choices (beef or chicken), it was still pretty cool. I'll come back again when I'm craving for Pho and doesn't really want to drive far from work.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 34, "review": "My boyfriend had his work training around here and went to Lily's almost every day. He raved about how good and cheap it was and finally took me to try it.\n\nI ordered a specialty sandwich for $4.50 and it was huge! I barely finished half of it.\n\nThis place has cheap food that is delivered quick and with big portions. 4 stars.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 35, "review": "Wowww I'm sooo lucky to have found this place.  It has great food for the price n quality... it's a really casual place that has great special everyday for only $6 i.e. pho, chicken curry with rice, spicy noodle soup (bun bo hue), vermicelli with bbq beef & eggroll (bun thit nuong cha gio), broken rice (com tam)...etc\n\nThe food is authentic Vietnamese food.. best in the area! You can also get the traditional Vietnamese sandwich here for only $3, they also serves the other type of sandwiches like what Eriks Delis offers. \n\nThe service is awesome and the food comes out almost immediately!  I would definitely stop by for lunch when I'm around the area.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 36, "review": "The sandwich's are good, so is the coffee. I haven't tried their pho yet, but I will. Prices are pretty good too.", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 37, "review": "A great place for a quick lunch. It's a family owned restaurant with a mom and pop feel. I've only ordered the Vietnamese sandwiches here, which are $3. The sandwiches comprise of toasted French bread, pickled vegetables, cilantro, jalapenos, and whatever meat you order. Each of these tastes fine, nothing superb, but never bad. Comparing to other sandwich places in Santa Clara, Lily's certainly trumps them.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 38, "review": "horrible service. they advertise on here they are open at 8.. on their door it says 830... i was there at 845 the door is locked and the lady is just staring at me not caring that im standing at their door.  i stand out for 5 min and she sees me but still does not care so i call and she answers and i ask her if she can please open the door i only want to order coffee and she says they are not ready to open no sorry nothing..she could at the very least open the doot and say something instead of just staring at me like im bothering her.. you would think that a small business would care about their customers but like other reviews say the new management is very rude and doesn't care about their customers... the pho place down the street tastes alot better too.. this place might be cheap but not that great..  they do not care about their customers do not support their business", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 39, "review": "Stop by checking out the restaurant.  The pork sandwich doesn't look like the posted picture at all.  Save your money and time and no come here, there is nothing special about their foods.", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 40, "review": "I remember going here, but nothing was memorable. Decent enough fare for the highly industrial area that it's in. Bahn-mi bread was a little tough/thick crusted, so if you don't like that, I would pass on this place. Spring rolls were adequate.", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 41, "review": "Been here a couple times during my best friends lunch time and so far its really good here. We usually just get pho and sit outside while they make it and they just take it outside for us. Food is good and employees are very friendly. It's hidden by all the offices that are around the area so it is a little hard to pin point exactly where it is, but still a nice place to go too.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 42, "review": "Now there are not many restaurants around this area but i have to say this would be the best one and it is real good and cheap. They have a real good Vietnamese pork sandwhich and a noodle sopu for only $4 and then theres is the Thursday Special, which is a huge plate with shrimp eggrolls some kind of noodles and hole bunch of food for only $6. I would recommend this place for lunch they bring the food out QUICK.Best of all you dont get the tiring feeling you usually feel after eating chinese food.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 43, "review": "Lily's is conveniently located around the corner from my work.  Love the sandwiches and daily specials they offer. Pho is just ok.  Staff (Mother-Lily, daughter and son) are very friendly and welcoming.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 44, "review": "This is a great little place: it has really good Pho for $6, Vietnamese sandwiches for $3 and a great Lemon Grass Chicken Vermicelli w/ eggroll dish on Thursdays for $6.", "name": "Lily Coffee & Sandwich", "rating": 5}, {"index": 45, "review": "Pho!!! It's the best thing on the menu. Get it to go and everything is wrapped up nicely... And the family/staff are super super friendly!", "name": "Lily Coffee & Sandwich", "rating": 5}, {"index": 46, "review": "love the Vietnamese sandwiches and the pho was great too.  got to have the viet coffee.  my favorite type.  I am not of Vietnamese culture, but took a Vietnamese friend there and he said he liked the sandwiches too.  soft French baguette with warm meat and fresh veggies.  clean place and prompt service.  great for lunch or snack.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 47, "review": "Very friendly, mom's & pop's kind of place. I'd go here for a cheap, quick, and tasty lunch.", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 48, "review": "I first noticed this cafe about six months ago.  After numerous times driving by it, I decided to stop by on my way home to see if they had Vietnamese sandwiches.  I was hoping they would have good ones so that I wouldn't have to drive across town for my fixes anymore.  And they did have Vietnamese sandwiches--sort of.  It was called \"Vietnamese Sandwich\" on the menu.  It was the only one among a menu of American/European sandwiches.  The sandwich was small, plain, and unprofessional.  It was something I would've made if I was a poor college student.  Even though it was only a few dollars, it was expensive.\n\nWhen I first walked in, I was a little disoriented, then disappointed.  I had expected an authentic Vietnamese cafe or at least one with a few basic Vietnamese specialties such as sweet sticky rice or mung bean rice cakes.  I was disappointed that aside from the partial Vietnamese menu, there was nothing else that indicated that the cafe was a Vietnamese restaurant.\n\nThe woman behind the counter impatiently waited for me to peruse the menu and evaluate the store.  I asked her what was in the Vietnamese sandwich.  She didn't understand me.  I asked her again in Vietnamese.  She brushed me off and told her 8ish-year-old daughter, in Vietnamese, to help me.  She didn't know what was in the sandwich, so her teenage brother came up to the counter.  He didn't know, either.  When I asked if it was the same as the ones at Lee Sandwiches.  He stuttered.  He asked his mom.  No one could tell me.  The situation was getting very uncomfortable.  I guess I'll just find out myself, I figured.  I whipped out my credit card, but since my transaction was under $5, they didn't want to accept it because they would be charged $0.25.  (By the way, requiring a minimum charge for credit card transactions is illegal.)  I didn't have any cash, so the 8-year-old girl offered to let me pay next time.  I asked if they had anything else Vietnamese that I could buy because I didn't want to pay for overpriced chips and soda.  Nope.  Eventually, the brother charged my card instead of stopping the order.  They should have a sign at the door that warns cashless consumers.\n\nMaybe I'll come back to check out their pho bowls, but I certainly won't be back for their Vietnamese sandwich.", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 49, "review": "I like  chicken curry. But service is really slow. We ask them to refuel soda server take forever. We wait almost 20 min.", "name": "Lily Coffee & Sandwich", "rating": 3}, {"index": 50, "review": "Great satay special sandwich! And very friendly people running the place :)", "name": "Lily Coffee & Sandwich", "rating": 4}, {"index": 51, "review": "Ordered a chicken vietnamese sandwich and the bread was burnt (to the point that I could not eat it ) . Also ordered a coffee and it was pure syrup. Used to love this place but if they are a little busy the service is horrible. Never going back to this place.", "name": "Lily Coffee & Sandwich", "rating": 1}, {"index": 52, "review": "I went there and ordered Pho. The soup came out very fast. The noodles looked like they'd been soaking in water for days.  There was barely any meat in there like your typical pho.So I decided just to try it anyways after so skeptical about the color of the noodles. My noodles were completely soggy. So I just sucked it up and ate it anyways. After about 5 bites, I saw a bug in my soup. I discreetly called the girl over to look at it and she saw what it was and took the bowl away. Then the guy working there, told me that it was the big kind of \"black pepper\" that they used loudly and rude. I told him, I'm not sure, what kind of black peppers have legs but I would like my money back. At first I was going to settle for something else, but when he rudely said it was a piece of black pepper out loud. I just wanted my money back! Do not dine here! I cook and have used all types of black peppers and never seen any black peppers with legs. I will never go there again. They're vietnamese coffee is not made right. Instead of using condense milk they used half/half. Not authentic Vietnamese food. If you want Pho, go to a restaurant that say's Pho.. And if you want a good vietnamese sandwich or coffee go to Lee's Sandwiches or a Vietnamese named sandwich place. Poor and Rude Service. Serves your food with a side of \"special black pepper\".", "name": "Lily Coffee & Sandwich", "rating": 1}]