[{"index": 0, "review": "The portion sizes are huge. The bread is soft and fresh from oven. \nTried the combination to get taste of all the meats. \nSave some room for the nutella crepe", "name": "Euro Grill", "rating": 5}, {"index": 1, "review": "Great food. Went there after more than a year. Really wanted to have sausages today, and this place came to mind. I had the combo, and it was super filling. In addition to the Cevapi, Sudzukice, and chicken skewers, I like the bread as well. Their red pepper sauce is a bit mild for me mainly because I have a high tolerance for spiciness (but that's just a nit, and it only applies to me).\n\nWill definitely come here again to try some of the other stuff on their menu.", "name": "Euro Grill", "rating": 5}, {"index": 2, "review": "The food is fantastic! Everything was delicious! We ordered the goulash soup, the combination meal, and the Nutella crepe. The goulash came with a side of bread, which was soft and tender and warm to die for. I was surprised how tasty the meat was in the combination. I typically am not fond of sausages, but this was so flavorful; I loved it.\n\nThe owner (?) even sent us home with extra bread with our leftovers which was so sweet. Honestly I would even come back just to eat that bread!\n\nIt's a pretty small space so it's probably not ideal for large groups. I feel bad but it seemed like it was just the owner running serving everyone.\n\nThere's one restroom which is large and clean. \n\nParking wasn't a problem, we came here on a Friday afternoon. There's a small parking lot, and there's also street parking available.\n\nEat here it's delicious!", "name": "Euro Grill", "rating": 5}, {"index": 3, "review": "Amazing food ...the cold platter appetizer was so good I finished the whole plate by my self .... the combination platter is a must ... Wil be back", "name": "Euro Grill", "rating": 5}, {"index": 4, "review": "I have eaten here so many times and the food quality here is still so great no matter how long I wait to revisit.\n\nGranted the menu is limited and the service can be a bit slow, but there seems to be only one person manning the front so it is understandable. The service is not unbearingly slow- dont worry . Love how they treat you as guests instead of people just dining there. They actually care :D Food is really cheap for the quality and quantity you get. \n\nMy go to is the mushroom appetizers and the cevapi or the combo [for when I feel like I can eat a horse]. The bestie loves the euro burger or the gyro. Food is extremely well seasoned and always leaves me full but good enough to come back for more. Wish they were closer to me T^T\n\nThe mushrooms tbh aren't that SPECIAL. I mean I feel most of their food is very...home-y. But for some reason I always get it. It essentially is mushrooms with sour cream [of the sort] , some cheese, and on a bed of rice with a little more cheese. It tastes rly yummy with the cevapi imo. Bestie agrees. lol. The mushrooms may not be shazamm worthy, but I think the cevapis are :) Pretty much just mini sausages that aren't dried out and have a nice little char on them [not burnt]. Srsly love how flavorful it is , and the deliciously chewy , hot bun it comes in (not sure if it is lepinja or burek?)..with the crunchiness of raw onions. epic. A simple but delicious meal. Can't say enough. \n\nAnyways I ordered 2 cevapis ($10 each) and a mushroom ($10) to go today and they said it would be ready in 15 so I said ok why not. When I got there, I guess they were getting increasingly busy so it ended up being ready in 20, not that big of a deal. The person manning the front today [usually is a lady] was suppper nice. He said mushrooms were on the house. TuT bless your lovely soul. i love mushrooms haha. Totally wasn't expecting that but I def will visit again- hopefully soon. I'm missing the flavor already :'(", "name": "Euro Grill", "rating": 5}, {"index": 5, "review": "Quaint no nonsense restaurant in a small strip mall.  Service is very friendly,  food is good, prices are very reasonable.  What else can you ask for in a restaurant!\n\nWe arrived at 6:30PM on a Saturday.  The restaurant was full and we did not have any reservation.  The hostess told us it would be around half and hour so we decided to wait.  As long as we have our order in by 7:30PM we would be OK (restaurant closes at 8PM). While we were waiting, another party arrived.  They too did not have reservation but decided to wait as well.  They have been to the restaurant 4 times already and love the food - good sign.\n\nWhat we ordered:\nGrill Stuffed mushroom - good, served on a bed of rice and cheese\nGyro: very flavorful, huge portion, comes with french fries\nSausage sandwich: very good\nCombination: good, give you a chance to try pretty much everything on the menu.  The chicken skewer was a tad dry\nGoulash: flavorful, huge portion, comes with rice, smashed potato and a whole lepina\n\nWe all enjoyed the food.  The bread tasted delicious and complemented the dishes well.   At the end of our meal, the waitress told us that she did not charge us for the mushroom because we were so patient with the wait.  What a nice surprise.  We are definite fans and will come back again.", "name": "Euro Grill", "rating": 5}, {"index": 6, "review": "This place is totally worth 5 stars!!! \nMy only complaint is that they always run out of Burek and they haven't had the meat burek for months now..... their cheese and spinach burek is delicious but their run out of it VERY quickly.\n\nBottom line though, they serve very tasty food here and the price is reasonable.... staff always been very nice and the owner is friendly and welcoming.\n\nBut please make more burek, my family and I live that stuff.", "name": "Euro Grill", "rating": 5}, {"index": 7, "review": "amazing - i've been to great restaurants in SF bay area, and nothing compares. the team is personal and intimate with you, ensuring you have a great time. My fave is cevapi and meat borek from the menu, but they also offer sarma and goulash sometimes. There is nothing to say I'm craving for their food. Thanks for feeding us.", "name": "Euro Grill", "rating": 5}, {"index": 8, "review": "Oh.My.Deliciousness. If there was ever a died-and-went-to-heaven moment, Euro Grill's Cevapi could be that. Ten mouth melting, succulent, moist fresh mini sausages served in equally delicious freshly baked Lepinja bread. Served with onion, sour cream and in-house prepared ajvar (bell pepper sauce).\n\nIt's a family owned restaurant. Quaint and clean. A dozen or so tables that fill up very quickly. Service is warm and friendly. Restaurant was clean. There is a euro market next door worth checking out.\n\nHow do you eat Cevapi? Dip the bread in little bit of sides and fork the sausages. Tip from the owner. Or, simply dig in your way!\n\nA must when in the area!", "name": "Euro Grill", "rating": 5}, {"index": 9, "review": "A small homie spot serving up tasty Balkan food! My boyfriend, who grew up in Croatia, was so happy to have found Euro Grill and be able to get a taste of home. The place is clean and it feels like you're eating at someone's home. It seems like a one man show running both front end and back end - he's very friendly - so just expect service to be a little slower than what you're used to. A good opportunity to practice your patience and all that mindfulness stuff you've been working on. I tried the Goulash today. The meat could be a little more tender, but the flavor was absolutely delicious. I had a small bite of my boyfriend's Cevapi (he refused to share lol), the litsemi-greasy toasted bread was so good! Tip: come early for lunch over the weekends. We arrived around noon and no one was in. But the place was packed 30min later. Hop over to the market after for some chocolate and other treats to take home!", "name": "Euro Grill", "rating": 5}, {"index": 10, "review": "Sausages..... Need I say more. Best Euro bread and sausage, everything else is good too!\n\nNice clean dining area. Great family owned business -SUPPORT YOUR LOCAL SMALL BUSINESSES!", "name": "Euro Grill", "rating": 4}, {"index": 11, "review": "This place has amazing cevapi, burek and pljeskavice. Highly recommended - definitely worth checking out if you're in the market for some Balkan food.", "name": "Euro Grill", "rating": 5}, {"index": 12, "review": "The kind of restaurant that you REALLY want to see succeed.  We and our son's family had a late lunch today and did not expect to see a packed restaurant at 2:30 on a Sunday afternoon. There's only one person manning the front;it's a fairly small restaurant with capacity of 30 or maybe 40.  AND he tried hard to accommodate all the customers.  I almost got up to help him clean the tables.  I did not do it in fear of offending him.  Everything we ordered was good & portion was substantial.  He even comped one of the entrees for the long wait, which we did not mind at all. I do not mind waiting when the server does his darnedest to make it work.\nThey serve the best garlic cheese bread in SF bay area.", "name": "Euro Grill", "rating": 5}, {"index": 13, "review": "The cevapi was juicy with lots of flavor. I also loved the excellent Turkish coffee; served in actual cup and saucer with sugar cubes and milk. The prices are very reasonable. I am taking one star off because they are not open for dinner most days of the week :(", "name": "Euro Grill", "rating": 4}, {"index": 14, "review": "When we came in (party of three), a person dressed like a patron eating near the door directed us to sit at a table with a \"reserved\" sign on it.  He didn't stand, but just waved us over.  Uncomfortably, we sat down, waiting for a menu, before the person indicated that they actually worked there, leading me to believe that the person was just off shift and covering for someone who had stepped away from the desk for a few seconds.\n\nThe server, dressed, if anything, less like an employee than the person who directed us to sit down (please take off your baseball cap), mumbled, and could not be clearly understood.  The goulash we wanted was unavailable, but we never could hear the reason why, so we tried the cevapi and the cold plate.  The menu is sufficiently short as to provide very few alternatives.\n\nThe cold plate arrived.  The cheese was a mild cheese that had sat a touch too long at room temperature, served with a good bread.  The meats included a smoked sausage that tasted like venison which we enjoyed and a medium sliced cured meat that needed trimming of gristle, making it unpleasant to chew, though when we got around the gristle, had an enjoyable taste.\n\nThe bread is a airy mild milk bread in a thicker flatbread form, roughly three quarters of an inch thick.  Reading, it appears to be a three rise bread, which was evident in the flavor.  The mildness refers to the flavor milk gives to breads.\n\nThe server failed to come by and refill our water, or check on us.  At one point, they walked around the room and filled water of other patrons without even glancing our way.\n\nThe cevapi is a caseless mild sausage served on the bread.  A side of sweet diced onion, a mild red sauce that has a bit of a chili taste, and sour cream were all that came with it.  While reasonable food, the poor service overcame other factors.", "name": "Euro Grill", "rating": 2}, {"index": 15, "review": "Small restaurant, simple menu with a sweet friendly server. The sausages we had were flavorful and the chicken noodle soup was filled with lots of chicken morsels, it came with a soft bun. First time trying Southern European food, and will come back for the crepes next time.", "name": "Euro Grill", "rating": 5}, {"index": 16, "review": "This was definitely the best restaurant I visited during my six weeks stay in San Jose and Santa Clara. The food is delicious, the restaurant is very clean, the waitress is extremely polite, the silent Ex-Yugoslavian music is classy and the prices are really good. They serve turkish coffee as well! I recommend the Euro-Burger (pljeskavica) or ćevapi.", "name": "Euro Grill", "rating": 5}, {"index": 17, "review": "Spectacular... I don't know how I can tell enough about the food I had today... \n\nCheese bread (burek) and chevapi... they were UNBELIVEABLE! I felt like I left the real world during my lunch... I really don't care whether it's a small restaurant and I got my food a little late. Guys...  you must absolutely go go Euro Grill and enjoy their great food!", "name": "Euro Grill", "rating": 5}, {"index": 18, "review": "It is definitely worth to drive from Pleasanton to get a good authentic lunch at Euro Grill. We ate here many times and always have positive experience. My family and I enjoyed cevapi meal (sausages in lepinja bread), combination platter and burek.\n\nBoth cheese and meat bureks (pies) were so tasty that we got 6 more cheese pieces to take home. \n\nCevapi dish is a \"must try\" specialty. To add, it goes very well with a plain kefir .\n\nAnd not to forget, palacinak dessert with Nutella is something to add at the end even when you are so full. Very tasty!\n\nBig plus to this place - everything is homemade, the cook is a real pro, staff is extremely nice and professional, excellent service.\n\nKeep in mind that Euro Grill gets really busy on the weekend due to its popularity, and it is suggested to make a reservation if you don't like to wait (we don't mind waiting to get delicious meal).\n\nI highly recommend this place !", "name": "Euro Grill", "rating": 5}, {"index": 19, "review": "We tried the Euro Grill  for the first time 2 days ago and the food was great, freshly cooked very tasty and well presented. We ordered cevapcici which was  grilled to perfection. Also , we had Burek with meat and with cheese. It tasted like homemade in Bosnia. For desert we had tufahije and Bosnian coffee. Everything was absolutely delicious. Both of the servers were from Bosnia and were very attentive. This place makes you feel you are somewhere in Bosnia, the restaurant is small but very cozy. Bosnian pop/rock music that was playing in the background  made me feel very nostalgic. Overall a great meal and great value we will certainly be going back. Thank you Euro Grill", "name": "Euro Grill", "rating": 5}, {"index": 20, "review": "Thank goodness for Yelp to leading me to this place!!! Was looking for a restaurant near my appointment and I would've never found this place on my own. From the outskirts of el Camino, you would miss this place in a blink. Small parking lot and two doors down they have a European market too that was never open as the restaurant was too busy. \n\nInside there's only a handful of tables and at 5 pm on a Saturday it was already half full. Really wanted to order the Burek but someone ordered the last one before us! Our waitress recommended the garlic cheese bread which even as a carb whore I was hesitant but we did. We also ordered their orange soda and a combination platter.\n\nThe garlic bread came out and it was sooooo simple but sooooo good. It came on their lepinja, their homemade pita bread which was so fluffy and delicious. Our combination platter finally came out and it was meat galore with another lepinja. Chicken was cooked perfectly but my favorite was the cevapi (homemade sausages) dip in sour cream and red pepper sauce and it was a party in my mouth! Although we were full from the garlic bread we thoroughly enjoyed the meal.\n\nWould definitely be back again n again, but docking a store for turtle slow service. Felt bad as I saw an old friend that put in an order to go right after us and they didn't get their food until after we were done, over an hour later!\n\nAlso my friend and I tried to go to the market after, and it still had the be back in 5 minutes sign on.", "name": "Euro Grill", "rating": 4}, {"index": 21, "review": "My 1st time trying a Cevapi (Sausage Sandwich) and it was delicious! This is a small, small place maybe seats 15-20 people ran by one man who does it all. I heard his wife also helps however she was not there when I went. I have never had Balkan food before but it is Great! I can't wait to try more.  The ingredients were fresh and the homemade bread was bomb! I will be back. They do take reservations so I would recommend if coming in during busy hours.", "name": "Euro Grill", "rating": 4}, {"index": 22, "review": "Wow! What a gem! A real hidden treasure. A friend from the Balkans introduced me to this place and I'm hooked.  We tried the crepes with the Rose hip jam. Winner. Burek (we got the cheese burek which was this amazing stuffed cheese pie). And then we had the Mac daddy! The cevapi, which are beef sausages with this amazing bread...served with onions, sour cream and a sweetish hot sauce (highly recommended.) word to the wise: this is a family owned and run place ... literally it is a husband/wife team and no one else. So service can be a little slow but they more than make it up with really caring about their customers. Also the coffee is highly recommended.", "name": "Euro Grill", "rating": 5}, {"index": 23, "review": "Very cute cafe with absolutely delicious Balkan food. We had cold cuts, combination meats, mediterranean salad and burek with spinach and cheese. Everything was super tasty, burek was out of this world. The service was fast, and the hosts super nice. The highlight if the meal: turkish coffee!!! Adding this place to our list of favorite restaurants in South Bay!", "name": "Euro Grill", "rating": 5}, {"index": 24, "review": "My buddy and I were driving down on El Camino Real right off Washington Street onto this driveway and came upon this place by accident. First of all we never had Balkan food so we had no idea what to order.  So we decided to order two combo platters and burek that's spinach wrapped in pastry crust with meat.  Secondly the service was very slow maybe 20 minutes at the most, but that was okay since we had the burek that was appetizing with the crispy crust and mince meat.  Our combo platter came in later with the cevapi minature sausages along with the euro burger and 1 chicken skewer not to mention the lepinja bread that itself was refreshing not stale or hard, but crispy and moist in flavor. They were all so delicious and the portion wasn't small if not more generous. They refilled our glass at least three times and the server maybe the wife and husband were so nice attentive and friendly.  Wouldn't mind coming back again. Prices are very reasonable. We liked the interior not small then again not so large.  Parking maybe hard to find so you may have to park on the side street. Final note they do have a store called Euro Market that specialized in Balkan canned goods, sausages, cheese, chocolate, dairy products, jams, chips and other items. Check out the owner he's super nice and gave us a free chocolate candy bars it's far better than Mars or Milky Way in taste and flavor almost all of his customers spoke Slavik their native language.  The store is very quaint and very well organized. Definitely a 5 in my book.", "name": "Euro Grill", "rating": 5}, {"index": 25, "review": "Its a mom and pop establishment and one that does a few things but does it well.\nCevapi is my goto dish. Sujuk is the meat pastry and its delicious. I liked their variation of the burger as well. Chicken noodle soup is pretty filling. Cold platter is a hit or miss.\nSo safe to say there are enough good choices to have a great meal.\n#HALAL", "name": "Euro Grill", "rating": 5}, {"index": 26, "review": "This really is a mom and pop shop. I believe it's one guy work in the kitchen, and the front of house is the wife. It's a really small shop, limited seating. It can get super busy at lunch, and I think it's hard for them to keep up. Food is good! Options are limited, and on the day I went to visit there were no gyros! Got the chicken kebabs, which was good. The pita looked really fresh and tasty, alas but no carbs for me! Stay away from the cheese stuffed mushroom, meh. The burger is HUGE  btw, and stuffed with protein.", "name": "Euro Grill", "rating": 3}, {"index": 27, "review": "Had a great lunch!  Food was fresh and yummy. The bread was outstanding, homemade and perfectly dense.  Friendly server.", "name": "Euro Grill", "rating": 5}, {"index": 28, "review": "I drove 30 mins from San Carlos and then 1 hour in a rain storm home to the coast. \n\nWe just died and went to heaven.!!!\n\nWARNING: Do not drive home with their Cevapi in the box on the passenger seat, not much makes it home. I took advice and put in the trunk, much safer but aroma was very difficult while driving !!\n\nThe restaurant is humble and spotless. The Cevapi were amazing, childhood memories flooding back. \n\nThe comment someone made below that they don't care or sloppy, sounds like a customer with a bad attitude. They could not be any nicer, especially when they deal with a dumb, dumb customer (me) would could not find the location and was circling the streets. The owner came down to wave me in, could not have been any nicer or more helpful. \n\nWill happily drive out of my way as I chewing my tongue this morning. \n\nWhat a find!", "name": "Euro Grill", "rating": 5}, {"index": 29, "review": "We really enjoyed our first foray into Balkan cuisine! I ordered the combination plate and hubby had the chicken skewers. Both of our dishes were seasoned and cooked to perfection... my fave part of the combination plate was the little sausages (cevapi). It tasted so yummy with the yogurt sauce and bread! OMG the bread is mouth watering amazing! So light, fluffy, and warm! The bread blew us away, we were expecting the usual flat pita bread but this was something special and different. It's all house-made as well. To finish it off (we were stuffed but forced ourselves to do it) we ordered the crepes. Warm and gooey, not too sweet surprisingly, and they were dusted with a peanut powder for texture. The bill was reasonable and service was kind, and prompt. We would definitely come here again when we're in the area and craving kebabs!", "name": "Euro Grill", "rating": 5}, {"index": 30, "review": "When I am not eating here, I dream of eating here.  I can never finish my meal there, and fortunately the left overs are as good as the day it is new.  (I have \"deconstructed\" gyros because of this) I love the owners as much as I love the food, they are so genuine. :-)\nI bought some Lepinja bread from the nearby store the other day and made French Toast out of a couple pieces, and it was just as amazing as can be imagined.", "name": "Euro Grill", "rating": 5}, {"index": 31, "review": "Cute, authentic. Did not realize there was such a Yugoslavian community, very cool! My lamb kabob was a very large portion and delicious. The market next door has lots of European chocolate!", "name": "Euro Grill", "rating": 4}, {"index": 32, "review": "Great service and quiet location. I have eaten here before and stop by the market when ever I get a chance .  Some of the best quality food available !!! Definitely check it out !", "name": "Euro Grill", "rating": 5}, {"index": 33, "review": "Few tips from a native: don't order fries, mushrooms or gyro. These are not our specialties. If you want authentic food order burek and jogurt (yogurt), ćevapi (diminutive ćevapčići), or pljeskavica. For a dessert opt for crepe. Cockta (soda) is a must try. Gulaš and sarma are a bit more involved recipes and are typically tastier in home setting, unlike ćevapi that nobody cooks at home from scratch. Not to say this place doesn't make it well, just take that into account.\n\nFor tards complaining about slow service: this is the freshest balkan food you will get in 400 mile vicinity.  Good food takes time. They start cooking when you order as ćevapi are eaten this way.  If you want premade, preservative filled meat McD is down the block.", "name": "Euro Grill", "rating": 5}, {"index": 34, "review": "Perfect cevapi best place to eat one of my favorite. Goulash is really very tasty and their burek with meat is my another favorite. Very cosy place and they are doing their business with full of passion as a family. Must go places to eat in bay area.", "name": "Euro Grill", "rating": 5}, {"index": 35, "review": "This is my favorite place in town... they got the best cevapi and burek! Try it you won't regret it... Coming back for sure", "name": "Euro Grill", "rating": 5}, {"index": 36, "review": "Whenever I am missing my old friend's mom's Bosnian food I come to this restaurant. It's a very small place but feels very home-y. The staff here is always nice. They are welcoming and willing to explain what each item on the menu is. So my favorite item on the menu is the Burek. I would describe the Burek as meat, cheese, or spinach and cheese stuffed croissants. So delicious as always! We also tried the cocta rose hip soda and orange soda. It tastes kind of like American soda, pretty good. We also got the combination and cevapi. Lots of sausages and bread. It was so yummy, from the bread to sausage to the sauce. Highly recommend this place for food, value, and culture.", "name": "Euro Grill", "rating": 5}, {"index": 37, "review": "If you've never tried Yugoslavian food then definitely give this a try, the foods all good but personally I only come for the cevapi! If you're balkan....the foods probably not AS amazing as your mama's food but sometimes you just need some cevapi in your life! Wish there was a bosnian restaurant in the east bay *sigh* but I'll gladly drive out for this deliciousness!", "name": "Euro Grill", "rating": 4}, {"index": 38, "review": "Sheesh what's up with cranky Mark M.  Everything he thought was bad I found charming. It appears to be a family owned business. Very authentic European Mediterranean style food and atmosphere. Good bread, yummy grilled chicken, fresh salads, good French fries, nice filled \"sandwiches\". We tried a cheese and a meat. Mild cheese but tasty. The meat was good too. I was in Santa Clara for a meeting and just happened upon the place. If I'm in the area again it will be where I eat!", "name": "Euro Grill", "rating": 4}, {"index": 39, "review": "Went here for the first time today after reading the reviews on Yelp. This is a small Bosnian food restaurant which looks like it is family run. \n\nThe restaurant which is easy to miss though it is on the main road has parking at the back. \n\nThey have a limited menu where we had the Chicken Skewers and the Beef soup. The food is fresh and very tasty while the quantity was ample for one person.", "name": "Euro Grill", "rating": 5}, {"index": 40, "review": "We were so lucky to find Euro Grill. We ordered the Gyros and it was spectacular.  A lovely small restaurant with amazing food.", "name": "Euro Grill", "rating": 5}, {"index": 41, "review": "Euro Grill offers tasty traditional balkans cuisine. Highly recommended if you would like to try some basic dishes from former Yugoslavia.", "name": "Euro Grill", "rating": 5}, {"index": 42, "review": "Great burek and cevapi! The place is small and the menu is limited, but the food is great! We didn't like the mushrooms much, but the cevapi with bread was awesome. The cheese burek was so fresh and delicious. And their soup and crepes looked good (did not try them this time but will next).", "name": "Euro Grill", "rating": 4}, {"index": 43, "review": "I've been here a few times, and only on the weekends, so parking was always empty.\n\nCafe is clean and neat inside, not so crowded and I really like that.\nWaitresses were very polite and caring, each time I've visited this place.\nI'm always asking a lot of questions before ordering my lunch, and they always answer patiently and kindly.\n\nI love their goulash with mashed potatoes.\nOh, it is so delicious! I cannot forget this beef, literally melting in my mouth. Each time I eat it, it feels like I'm back to my childhood, it's like homemade goulash made by mother.\n\nThis is a very great place to visit!", "name": "Euro Grill", "rating": 5}, {"index": 44, "review": "I love Euro Grill! Honestly If i could, I would give more stars, this place deserves it! Very friendly and warm atmosphere, and prices are fantastic! I would highly recommend the Cevapi, fresh bread and nice tasting sausages. My to-go place for sure.", "name": "Euro Grill", "rating": 5}, {"index": 45, "review": "Long time no see but still great food & music with memories...just to far from home to visit more often!", "name": "Euro Grill", "rating": 5}, {"index": 46, "review": "The food is phenomenal, my favorite dish there is authentic Bosnian dish Burek, fresh made every morning. Also love goulash, soup and crapes. Service is fantastic and place is so nice and cozy. Highly recommended!", "name": "Euro Grill", "rating": 5}, {"index": 47, "review": "Their food is SALTY. Head pounding, tongue shriveling salty. My sister thought so as well. \n\n1. Chicken soup - basically canned chicken soup. It's then understandable that the soup had high sodium content so I forgave them. But that didn't prepare us for what came next...\n2. Gyro - it's a huge portion! However, not only is the beef overly salted, the bread itself was also packed with sodium. I couldn't eat more than a few bites because it simply wasn't edible like that. \n\nSide note: They don't serve fries at the restaurant anymore. Bummer.\n\nOne extra star for the nice waitress. But don't waste your money here, it's not worth it.", "name": "Euro Grill", "rating": 2}, {"index": 48, "review": "Their Cevapi and the bread are exceptional!!!  Ever since I had micitei in a Romanian food festival, I've been looking for micitei. Finally I found Euro Grill. The Cevapi here  are so juicy and flavorful! I definitely go back to Euro Grill for Cevapi many times!", "name": "Euro Grill", "rating": 5}, {"index": 49, "review": "Love the home made food. The cevapi sandwich is very yummy with their homemade lepinja bread. The restaurant is family owned and they offer very earnest service. A unique experience from the usual food. I saw a family show up and the food arrived right away so call in your order early if you want to eat right away.", "name": "Euro Grill", "rating": 4}, {"index": 50, "review": "Great place had crepes and gyro the best.  The price is under $10 mostly. Burek is the most delicious I tried first time Bosnian ones so come and enjoy", "name": "Euro Grill", "rating": 5}, {"index": 51, "review": "It is a central Europe / Balkan cuisine, nothing Mediterranean about it.\nI guess you'll like it if you fancy meat, in ground / sausage form, served with no vegetables along with bread or fries.\n3 stars because I do like some vegetables with my food.\n\nIt is a small place, looks clean and inviting and service is good.\nFree parking but not many spots.", "name": "Euro Grill", "rating": 3}, {"index": 52, "review": "We had the combination platter and chicken noodle soup. Very good flavors! We all loved the soup, the chicken skewers and the sausages. Even the bread was very good. Oh! And end your meal with coffee, it's delicious.", "name": "Euro Grill", "rating": 5}, {"index": 53, "review": "I was pleasantly surprised by this gem in Santa Clara.\n\nFood is great, people are great! The type of food here is south eastern European. I got the Combination Platter, which includes two types of sausages and a chicken skewer and some sides. Highly recommended if you want to taste everything, and the portion size was good.\n\nAlso tried their nutella crepe, it was good as well.\n\nGo there!", "name": "Euro Grill", "rating": 5}, {"index": 54, "review": "Bosnian food -- that's new (to me)! \n\nI had the ćevapi -- \"ten ćevapčići sausages in a lepina served with sour cream, onions or ajvar.\" The ćevapčići are small sausages which are flavorful, spicy not hot, grilled. Delicious. But I liked the lepina even more. It's a large bun that seems to be freshly made in-house and charred on the hot grill. \n\nI loved this but it just comes with raw onions, sour cream, and an ok roasted red pepper sauce (the ajvar). I would have liked to see a Bosnian side dish. Looking at the rest of them menu, the sides are quite plain and cast as bit players. I would love to see a few vegetable sides or appetizers. Surely there must be something green in the Balkans!\n\nAt my second visit, I had the burek, meat (or spinach or cheese) baked in pastry. It was great -- flavorful, with a chewy-tender crust.\n\nIf you're a \"meat and starch\" type, you may be thrilled here, and I have to agree that the meat and baked elements were great. The breads and pastry all are made in-house and are very fresh. \n\nI see they have cabbage rolls and goulash; I want to try those. \n\nThe place is a converted house. Small but attractive, like someone's well-kept living room, bright and pleasant. It was very busy when we got there and the service was very good.", "name": "Euro Grill", "rating": 4}, {"index": 55, "review": "Greatest thing in the BAY \nBurker is a must, and Chevapi", "name": "Euro Grill", "rating": 5}, {"index": 56, "review": "definitely not worth more than 3*, very sloppy place. \n- the waitress doesn't care, she's very slow even to bring the menu or water...\n- stuffed mushrooms are... dry-grilled a bit burnt-bitter mushrooms with sour-cream on top. Half of them were black-burnt from the bottom. NOT tasty. Not worth 10$. I've always thought stuffing is something more solid than sour cream...\n-cevapi were descent (it's hard to spoil fatty meat), however there was a piece of hair in mine\n-lepnina of cevapi is not very good \n-kefir comes in plastic bottle and you need to ask for a glass specially. \n\n+ the interior is nice", "name": "Euro Grill", "rating": 3}, {"index": 57, "review": "Everyone here is great and so compassionate! The restaurant does close early on week days, but the store next to it doesn't close till late! You can get a lot of things from the Balkan regions, and it is a really nice taste of home. The only thing you're going to have to watch out for is your weight after eating so much good food!", "name": "Euro Grill", "rating": 5}, {"index": 58, "review": "Destined to try something new for lunch one day, my co-workers and I decided to venture out and try this place.  \n\nFirst of all, this place is not visible at all from El Camino at all even though the address is at 980.  You must turn into Washington St to find this hole in the wall.  The parking lot is extremely tight and so are the spaces so leave your Hummer at home.\n\nOnce inside, you swear  you stepped into a converted home.  A very nice Greek gentleman greets you and hands you their menu.  Since it was our first time, we look very perplexed so he allowed us to 1/2 spicy and 1/2 regular sausage sandwich on their homemade Lepina.  \n\nThen the waiting game began.  We looked behind us and there was only 1 other table behind us with 4 guys who haven't even got their food yet and another table with a couple who came in after us.  After 30 minutes no food for anyone still and I felt the burn as my stomach started digesting itself.  Finally after 50 minutes our food came out.  Again we were trying to figure out how to lather the sour cream and ajvar spread into the huge nooks and crannies of the super soft bread.  Three of the pores of the bread easily decimated the entire cup of the stuff.  Although good, the bread did not pair well with the round sausages as everything fell apart as you tried to eat it.\n\nThe sausages weren't anything to write home about.  It was very blah and tasted store bought.  Was definitely not worth the 50 minute wait nor the trek over here.  The only thing I can say is that it was cheap, but we all know cheap doesn't equal good.  \n\nNo plans on coming back nor do we have another 90 minutes to invest in a disappointing lunch.", "name": "Euro Grill", "rating": 2}, {"index": 59, "review": "Always amazing food. Today I had the Turkish coffee - so delicious, woke me up after the first sip \nNice personal too, very friendly and helpful. \nAnd always our mini trip ends at the Euro Market for some Romanian honey, flour and other goods.", "name": "Euro Grill", "rating": 5}, {"index": 60, "review": "This is the best Balkan food I have found outside of the Balkans. My wife and I have been looking for so long to replicate the tasty and delicious tastes of Cevapi and Lepina....well search no more. The food was delicious, perhaps even better than when we had it abroad. The Lepina is so soft, warm and fresh. They even have Cockta which I have not found anywhere else in the bay area. We received very warm service from Adisa (spelling?) whom was very thoughtful in her conversation with my wife and I. We will definitely spread the word of this place and return ourselves for more delicious food.", "name": "Euro Grill", "rating": 5}, {"index": 61, "review": "I came to here first time. I loved the food and service. Gyro is so tasty. Super-duper cafe", "name": "Euro Grill", "rating": 5}, {"index": 62, "review": "Amazing goulash, authentic and delicious. A friend had cevapi which he said was he best ever. What makes them both fantastic was the fresh baked bread. I'd eat here often, but I live in the NW and only come to the Bay Area on business every couple months. Definitely worth trying for lunch anytime.", "name": "Euro Grill", "rating": 5}, {"index": 63, "review": "I love chicken soup it's really delicious they need update business our everywhere.  Small place but really friendly and nice atmosphere. And please make more burek. I'm coming every week unfortunately I didn't eat burak yet.", "name": "Euro Grill", "rating": 5}, {"index": 64, "review": "Nothing's changed.  Food still yummy.  Service is friendly.  \n\nNote: even though address is El Camino, the parking lot entrance is on Washington.  My friend followed Google Maps and zoomed right pass it.  It's a small lot, but plenty of street parking on Washington.", "name": "Euro Grill", "rating": 5}, {"index": 65, "review": "The food is great and the personnel is awesome! The cevapi sandwich and burek are just the best in the region! This is perfect place for me and my family!", "name": "Euro Grill", "rating": 5}, {"index": 66, "review": "This place is amazing. It's in a small building complex and rehabbed office space so the layout isn't all that amazing, and the decor is very minimal. Place is super clean, and folks are friendly. There is a parking lot available. When mapping it out, Google will direct you to the \"back\". Just turn on Washington and pull into the little parking lot on your left (from El Camino Real). \n\nThe food is absolutely delicious at a great price. The homemade pita, meaty burek, goulash, and gyros are flavorful with just the right mix of spices and textures. \n\nThe service was pretty awesome too. Very friendly without being too imposing. Easy to ask for more water, and just enough visits back to ask if there was anything else we needed. Appreciated this with a newborn sleeping and not wanting to wake him up!", "name": "Euro Grill", "rating": 5}, {"index": 67, "review": "Not the best mediterranean restaurant, the food was Ok, they have self made bread which was not very good because inside of the bread was not well backed. I saw several costumers who did not eat their breads and let them in the plates.The fries were not tasty and It took long to get the food.", "name": "Euro Grill", "rating": 3}, {"index": 68, "review": "What can I say about this place that hasn't been said already, best sausage meats in the halal category in the bay . Spicy when u want it . Desert Nutella need I say more . Beware if ur counting calories . The good news is they make a nice fresh salad with feta cheese that will the envy of the table . Be ready to share whatever u order . It's that kind of place u want to try the whole menu . Black tea is a must and Turkish coffee not for armatures. Enjoy and try to get outside seating on a good day . Feels part of el Camino if that's ur thing .", "name": "Euro Grill", "rating": 5}, {"index": 69, "review": "I found this place via Yelp after an event nearby at SCU.  It is small, with a very friendly waiter/host.  The menu is somewhat limited but the food was really tasty and a great change of pace.  I fully agree with the many reviewers who called this a \"hidden gem\".  I was there with a party of 7, and everyone was really taken with it.  \n\nI had the combination plate, which was way too much food, but truly delicious.  Everyone liked what they got, from what I could tell.", "name": "Euro Grill", "rating": 5}, {"index": 70, "review": "This place has food that reminds me of Romanian dishes such as mici and zacuscă. Highly recommended if you're interested to try some Eastern European dishes.", "name": "Euro Grill", "rating": 5}, {"index": 71, "review": "I went here for the first time today and I was very pleased. The restaurant was small inside but very clean. The menu was pretty limited and consisted of rather simple dishes which is exactly what I wanted. I got the combination plate and Mediterranean salad which I shared. Everything tasted fresh, the meat was not dry or overlooked, and the homemade bread was killer! Definitely recommend if you're looking for something simple and easy but tasty!", "name": "Euro Grill", "rating": 5}, {"index": 72, "review": "I waited for well over 30 min for the spicy sausage sandwich. It was to come with sour cream, onions, etc. I got a dry sandwich with just sausage. Not happy. I will not be back.", "name": "Euro Grill", "rating": 1}, {"index": 73, "review": "Fantastic, fresh, homemade food for a great price. Wish we lived closer, everything was so good!", "name": "Euro Grill", "rating": 5}, {"index": 74, "review": "Total hidden gem.  The food was delicious, the bread was nice and soft, and the portions were huge.   Order the gyro, you won't be disappointed. \n\nSuch a quaint family owned restaurant.", "name": "Euro Grill", "rating": 5}, {"index": 75, "review": "A little hard to find the entrance but worth it (believe another reviewer helped us out by mentioning turning on Washington St. - - don't quote me on that, it's been a couple weeks).\n\nWe were feeling adventurous and decided to try a cuisine we never had before so we ended up at Euro Grill. Everything we had was delicious. Started of with the cold sampler plate with bread which was amazing and probably could have filled the two of us up if we hadn't been so hungry. \n\nWe also ordered goulash and a burger. Having never had goulash before, and with nothing to compare it to, I can only say that it was good...and it was REALLY good reheated the next day. Funny how that works sometimes. The burger was very good as well and had a very different taste and a bit of a different texture than regular burgers...like more fatty but not in a gross way. \n\nThe service was a bit slow and the waitress forgot about us a couple of times but it was her first day. However, the lady who we assumed was the owner went to the market a couple doors down to get some chilies for us since they didn't have any on hand. \n\nNice little place and will definitely be back when in the area!", "name": "Euro Grill", "rating": 5}, {"index": 76, "review": "Love this Bosnian spot. Great food, great people. Love the cevape, pita's are amazing. To top it of crepes are delicious and if you're European you'll love it with Nutella :)", "name": "Euro Grill", "rating": 5}, {"index": 77, "review": "Went looking for some Gyros, discovered a hidden gem!  Euro Grill is a fantastic family run business, incredibly savory food, cooked to perfection.  Huge portions (biggest Gyro I have very had).  Small number of tables - I'd recommend a reservation, even for lunch.  Place is so busy that you need to be prepared for a bit of a wait, but it is well worth it.", "name": "Euro Grill", "rating": 5}, {"index": 78, "review": "What a nice find ... Delicious meats, good portions, good cake. Located literally on the corner of El Camino and Washington and looks like it is part of a house. \n\nFOOD:\nCombination plate - A great way to sample their meats: Small burger patty, two kinds of sausage, chicken skewer. Really liked it all! Their bread is pretty good too. \n\nBurek - This is like a flaky pastry used as a sandwich and you can have it with cheese, meat, or spinach be cheese. We got the meat and it was delicious!\n\nChicken noodle soup - Good but nothing special. \n\nSERVICE:\nWait staff was nice and attentive (there were 3 other small groups having lunch). Brought out our food in a timely manner. Small dining area - maybe can seat up to 25-30 people. Looks like a family owned business and has been successful. They also own Euro Market next door with European food and treats. \n\nPARKING: \nThere is a small parking lot in the back and street parking. \n\nI would go back again!", "name": "Euro Grill", "rating": 4}, {"index": 79, "review": "Cevapi is the best, we could not try burek because they ran out of it. Come early for burek or call and reserve burek. Do not miss to try chicken soup, it is really delicious.. and also everything is halal", "name": "Euro Grill", "rating": 4}, {"index": 80, "review": "Nothing better than having a nice place to come to for some Ćevapi and hear people speaking Bosnian. I love this place!  Food is great!", "name": "Euro Grill", "rating": 5}, {"index": 81, "review": "Great service, great good. \n\nGot the combination plate, stuffed mushrooms, the yogurt drink, and followed with the Turkish coffee after the meal.\n\nAll were great: highly recommended !", "name": "Euro Grill", "rating": 5}, {"index": 82, "review": "OCCASION: The boyfriend and I wanted to eat dinner close to Santa Clara University for Easter Vigil Mass. I also wanted to a place that was not too expensive. Euro Grill was only about 4-6 blocks away from SCU. We walked about 0.5 miles to come to Euro Grill from Santa Clara University. We had to walk by frat houses. The walk wasn't too bad. \n\nENVIRONMENT: It is located in a small looking house. We almost missed it because it looked like a normal house! The only thing that gave it away was the very small parking lot. We didn't have parking problems because we parked at Santa Clara University. Inside Euro Grill, it was very small and very limited seating. The cash register is literally right next to the door. There is VERY LIMITED SEATING. Make sure to make a reservation if you are coming in a group bigger than 2. It was only me and my boyfriend and we made a reservation anyways. We got a big table for 4 because all the other small tables were taken. IT WAS CROWDED.\n\nFOOD: The thing that sucked about this place was that a lot of the food we wanted to try was already out. For example, the Burek, Cavapi, Goulash, Gyro sandwich, and so much more was out. We came on a Saturday night around 6PM. The waitress said those are the first to go out apparently. :( I was sad because I was really excited to try them. We got Palacinke crepe filled with nutella for dessert and it was really good. The boyfriend and I got the combination plate for the main meal and Grilled Stuffed mushrooms for appetizer. We shared everything. I loved the Grilled Stuff mushrooms! \n\nDRINKS: N/A, but my boyfriend got a Fruitcal drink and it was good. I had water. Water tasted good. \n\nPRICE: Inexpensive, but some of the appetizers were expensive for appetizers! Otherwise, everything was reasonably priced.\n\nCUSTOMER SERVICE: Customer service was OK. There was only one waitress out there. She was literally being the cash register person and the waitress serving for 15 people at the same time. It was too crazy for her. We got seated immediately but it took a while before she came to give us the menu. When we were eating, a group of 8 came in without a reservation, they had to sit separately because we took the only other table made for 4 (because when we came in, there were no other tables available except the table for 4). BASICALLY: MAKE A RESERVATION!\n\nOVERALL: Great place but make sure you come early in the day so that they don't run out of the things you want to eat. (The Burek, Cavapi, Goulash, Gyro sandwich) and make a reservation even if there's only 2 of you.", "name": "Euro Grill", "rating": 3}, {"index": 83, "review": "Wanted food before leaving San Jose for home. Stopped by this place because of the good reviews on Yelp. We got the combination. It was perfect for 2 people and had a little bit of everything. I really liked the euro patty and the cevapi along with the sour cream and ajvar. The spicy sausage and the chicken skewer were tasty as well. The amount feeds 2 well and leaves them without room for dessert. The owner brought us out a slice of cake each that her husband handmade. Flavors of cherry, honey and hazelnut. Yummy. Definitely coming back! Super scrumptious.", "name": "Euro Grill", "rating": 5}, {"index": 84, "review": "I don't know why it got 4.5 rating. It's not Mediterranean. It's more like junk food with little presentation. The taste is just salty. The spicy sausage is not spicy at all. The food is pretty much a hot dog.", "name": "Euro Grill", "rating": 1}, {"index": 85, "review": "Pretty glad I tried this place...Its a lil restaurant that apparently serves Yugoslavian fast/cafe food. None of the stuff is SUPER ethnic/weird tho so dont think ur gonna be trying something really strange...\n\nFood:\nCreamy Chicken Crepe- Cheesy Saucy deliciousness. Came out hot and the cheese/sauce was melted all over the crepe. Theres honestly not much more I can say bout this cept that it really hits the spot. I believe its bout 9 bux so its pricy but not overly pricy. Id def recommend the creamy chicken crepe if u stop by.\n\nGoulash- This is kinda a beef stew. It comes served next to these semi mashed potatoes. The potatoes hav a dallop o sour cream that really helps the flavor at least for me. It also comes with this big roll/slab o bread that kinda reminds me o sourdough cept way fluffier.... The bread is really good as its soft and it soaks up the soup really well. The dish goes really well together. Id dip the bread in the stew with the potatoes and get it all kinda together to get this beef stew mashed potato w/ sour cream sandwich concoction. While the dish was good, I wouldnt get it again cuz it reminds me too much of Chunky's canned beef vegetable soup. Its kinda so similar its not even funny lol. This dish was bout 9 bux as well but the portion is huge.\n\nOverall, I was fairly impressed by this place. Next time Im definitely gonna try more o the authentic/ethnic stuff. It seems the cevapi (Sausage sandwich) is the way to go. If ur lookin for sumthin a lil different u should check this place out.", "name": "Euro Grill", "rating": 4}, {"index": 86, "review": "Dragged my coworkers here for lunch and were stunned by the portion sizes. Two words - Food coma.  Location makes you feel like you're dining inside someone's living room / converted garage space. Service was fast and friendly and answered all our questions about the menu.  I had this big burger looking contraption that was loaded with delicious sausages and was promptly sedated the rest of the afternoon as a result.  Best to order the lunch platters, without all the bread, and share amongst your group to try a little bit of everything.", "name": "Euro Grill", "rating": 4}, {"index": 87, "review": "This place is a hidden gem. Having second thoughts if I wanna share this goodness with the rest of the universe. We had goulash and combination platter and everything was so yummy. The people working here are super friendly and talkative the ambience is relaxed and fun. Perfect place to hit after a day at the Amusement park. Portions are generous and homemade bread is really tasty too. We finished the bread before the meats, that's how good the bread was. Don't get me wrong the meats were super delicious as well. We even got one to take home with us. Definitely recommend this place if you wanna reasonable priced food that tastes great. If you want to get sarma or Burek my sure to call in advance and make reservation because they run out of it around 1pm.", "name": "Euro Grill", "rating": 5}, {"index": 88, "review": "This is the Authentic \"Hole in the Wall\" goodness that you have been searching for!  I've never had Serbian food before but the experience is well worth your time.  The food is flavorful, the restaurant is cool and inviting, and the owners are pleasant host and hostess.  If you're near Santa Clara University make it a point to stop by and enjoy the experience.", "name": "Euro Grill", "rating": 5}, {"index": 89, "review": "We didn't know the restaurant served Halal food. Found them on zabihah.com. We tried the Combination Platter, Gyro and Goulash. We really enjoy the food. The food is great and portion is big.", "name": "Euro Grill", "rating": 5}, {"index": 90, "review": "Food was great, big portions, combination plate is enough for two people\nThe staff were very friendly, we told the guy that we are on a road trip and the guy even gave us free golush for our dinner!\nOh, and make sure to try their cold platter", "name": "Euro Grill", "rating": 5}, {"index": 91, "review": "Very tasty food. Good portions and price. friendly owners. Would definitely recommend.", "name": "Euro Grill", "rating": 5}, {"index": 92, "review": "First time here which is shocking as I dont live too far away so was a bit surprised finding it on Yelp. I had the Goulash with real mashed potatoes which was just fantastic and a very nice portion, the homemade bread was delicious with the meal. I can't wait to go back and try some of the other entrees as I am betting they are all very tasty. I went in late for lunch so can't really say about it being busy but I got my meal very quickly.", "name": "Euro Grill", "rating": 5}, {"index": 93, "review": "Wow, this is a great Balkan food place. The food is sooo good. No need to go back to the Balkans (home) since this place is a like good home kitchen of your Baba. Try the meat plate and take your time. By the way,\nNot a good idea to show up here very hungry, if you know what I mean. Try this place and you will come back, trust me.", "name": "Euro Grill", "rating": 5}, {"index": 94, "review": "Balkan & Mediterranean food!  Unusual, handcrafted, very savory.  Felt like home cooking within a home ambiance.  Quiet, compact location.  Ample portions-- you won't go away hungry!", "name": "Euro Grill", "rating": 5}, {"index": 95, "review": "What can I say. I've been here twice and it seems that it is getting worse and worse. I love Čevapčiči (small sausages) and Pleskavice (patties) and Burek (puff pastry with meat, or Sirnica with cheese). Those were my main reasons for doing this 40 mile drive. But, not anymore. I'm really disappointed. Their menu is growing shorter and shorter and I have no idea why. Is it the lack of people who'd know how to make this type of food, or is it too much fuss for the owners and they just stopped doing certain foods?\n\nThe first time we got here I wanted to order Burek and Čevapčiči. They didn't have Burek, so I had a portion of Čevapčiči and was satisfied. They didn't have Kajmak (type of cheese) to go with the meat (you'll get it in any place that makes Čevapčiči in Europe and it's not hard to make at home), but I thought okay, maybe they ran out, so I had Ajvar instead (Yogurt/Sour Cream only goes well with Burek, not with Čevpačiči in my opinion). Meat was well prepared and tasty, so was the Lepinja bread that comes with it. No complaints there. \n\nSide note: People are complaining about the food being very salty... it's actually normal. If you're gonna try these foods in the Balkans (Croatia, Serbia, Bosnia,...), you'll have the same problem. It's just old school, that's how they're made, with a lot of salt. It's bad for you, yes, but nations down there grew up with that. Authentic as you might call it.\n\nOk, next. We came the second time. This time I really wanted to have Burek, but the owner said they don't have it. Again! Seriously?! They didn't run out, they simply don't have it. Then why does the menu say you have it, if you don't? Not to mention they stopped serving fries, Goulash and Sarme (cabbage rolls). I was told a few weeks later that they've changed the menu now, so they don't offer these things anymore. At least that. But it's too bad, cause Burek is just a part of their cuisine and it's such a shame they removed it from the menu.\n\nI really am disappointed. I know they probably have their regular clientele that comes and orders same things over and over, and that's fine, but they used to offer so much more and just stopped. You can still get certain items (frozen) next door in their store (Euro Shop), but it's not the same. Burek made from scratch is better than any frozen one.\n\nI don't think we're gonna give them a third try. It is a too long of a ride to come for something they obviously stopped making ages ago. And I can get good Čevapčiči and Pleskavice elsewhere.", "name": "Euro Grill", "rating": 2}, {"index": 96, "review": "Great hole in the wall...\n\nI had the chicken skewers/salad and it was a great portion, with nice blends of flavors.  The bread was interesting, like an english muffin.  The grilled veg/chicken was quite delicious.  If I am critical, there was borderline too much salt, oil employed in cooking, but the food really was great. \n\nThey seem to need more staff, but I know how hard it is to scale a small business with the right amount of staff, while keeping the expenses under control.  Be a little patient while waiting for your order...the people are very friendly!", "name": "Euro Grill", "rating": 5}, {"index": 97, "review": "On a business trip and stopped by here.  It was delicious! Got the Cavapi, amazing!", "name": "Euro Grill", "rating": 4}, {"index": 98, "review": "Let me first start this by saying that I flew across the country (Vermont to Cali) to enjoy the food here! Just kidding, I was in Cali for work but went out of my way to get to this place. \n\nYou see, real, authentic Bosnian food in the states is hard to come by so I will do just about anything to find it. And ding, ding- find it I did!\n\nThis place may be small, pretty boring decoration wise, and slightly out of the way, BUT- it is the real deal! Take it from a native Bosnian. The food that this restaurant serves is the kind of food you want to at least try.........and then devour! \n\nUpon entry, I was greeted by a young Bosnian who filled me in on the details. The place is family owned and operated. All the food is fresh and as good as it gets- unless you're planning on flying over to Bosnia, in which case, I am happy to be your guide (you will have to pay my travel expenses (:-p).  I ordered your standard Bosnian go to dish- a large Cevapi with sour cream-if you get it without, don't talk to me- along with a Cokta as a drink. The cevapi were among the best I have tried within the US and Canada. As a matter of fact, they tasted as good as they do in Bosnia. The large cevapi come with 10 pieces of meat and a pita bread- it's a huge serving! I proudly ate it all, and I would do it again in a heartbeat.  The meat not only tasted fresh and juicy but it also had the perfect mix of spices. The pita bread, which we call Lepina, was beyond heavenly and a star part of the meal! \n\nSo fly, drive, bike, swim, run, or walk- but get yourself to this place!", "name": "Euro Grill", "rating": 5}, {"index": 99, "review": "Food was great. Ordered the cevape, as definitely up to par to those I love back in Bosnia. \nQuite a hidden gem and it's wonderful to see people enjoying food from the Bosnian culture. \nOnly issue I found was how overwhelmed staff seemed to be, most likely understaffed which made the wait for food a little longer, but it is worth it. \nGreat work and keep it up!", "name": "Euro Grill", "rating": 4}, {"index": 100, "review": "MSG ALERT!   Went a few days ago for the first time.  Left here feeling an MSG headache and spaciness from gyro meat in sandwich?  If it wasn't MSG, it was some other additive.  Yes, they seem like a nice family business, but there should be warnings if there are food additives!  Won't return.", "name": "Euro Grill", "rating": 2}, {"index": 101, "review": "Great food !!!!! Love qevapi the best, highly recommended !!", "name": "Euro Grill", "rating": 5}, {"index": 102, "review": "The combo plate.. omg.  \n\nWe get nostalgic for Euro classics so we love that we can come to places like this and get our fix.\n\nThe menu is an interesting mix between things you'd expect at a Mediterranean place, but with some Euro surprises - kebabs, gyros, and burgers but also goulash and a meats sampler with sausage and cold cuts.  \n\nWe shared a combo sampler and it was huge!  Two, big and fluffy pieces of bread, lightly toasted, three different kinds of sausage, burger patty, and a delicious chicken kebab.  It comes with sour cream, roasted red pepper spread, and onions.  Lots of flavor. \n\nThe decor is nice and modern-ish, very clean.  There's a flat screen that had a recording on loop (might have been nice to have some music instead of the same two minute clip playing again and again).\n\nI've read reviews that the service is slow- I would say it's just more relaxed.  When we came in there wasn't a greeter or anything so we just sat down and it was no problem.  \n\nOverall good experience, we'll be back!", "name": "Euro Grill", "rating": 5}, {"index": 103, "review": "My wife and I were grabbing dinner before a Niner/Packer game and this place popped up! What a great surprise near Santa Clara University. We are vegetarians and we were able to have some great choices. The grilled stuffed mushrooms were delicious. The spinach and cheese pastry was also filling. We split the Greek salad as well. Great service, sweet place.", "name": "Euro Grill", "rating": 4}, {"index": 104, "review": "A friend and I each had the combination plate at dinner last night.  The food is fresh and delicious.   Reminds me of a meal I had in Mostar. The folks who work there are helpful.\nI would give it another star if there was a small salad or vegetable on the plate.", "name": "Euro Grill", "rating": 4}, {"index": 105, "review": "Nice family owned operation going on here. At lunchtime it can be a bit busy and sometimes slow but nonetheless the food is worth a few extra minutes.\n\nIt's kinda hard to fine because it's not exactly off El Camino but on the back side of the building with a small parking lot.\n\nI'd suggest the gyro or the sausage sandwich", "name": "Euro Grill", "rating": 4}, {"index": 106, "review": "First time be there. We had combination,Chicken soup and the dessert. Combination was so great. If you don't know how to order for the first time, combination will be a good choice. Homemade bread with chicken soup was also good. The price is also very reasonable.", "name": "Euro Grill", "rating": 5}, {"index": 107, "review": "The food was good but somehow something fell short of the mark. Was it the price vs quantity ratio or the fact that on a Sunday afternoon 4pm, the kefir and burek weren't available. In any case, their ambience felt like a restaurant converted from an apartment which was quite homely. I reserve my judgement for a (quite less) probable second time.", "name": "Euro Grill", "rating": 4}, {"index": 108, "review": "Best European/Mediterranean food I've had. The bread for really fresh and the lamb quite tender. And the crepes would melt in your mouth. Will probably try the goulash next time.", "name": "Euro Grill", "rating": 5}, {"index": 109, "review": "I really liked this place! There's a nice private lot for parking. The food is comforting and it's run out of a kind of home-y environment. \n\nThe food is well-priced. I had the goulash, garlic bread, and the nutella crepe/baklava and paid $12.50 (that's including a nice tip. The dessert was gratis, probably because we were a big group). Goulash was good and came with a basket of pita bread. The garlic bread was delicious, even though the portions arrived at varying degrees of heat. \n\nThe drawbacks? The restaurant filled with a kinda hazy smoke at one point and my clothes smelled like meat afterwards. The service is not super professional (college-age kid in a sweatshirt) and pretty slow. But it's a nice place to go to to relax and talk with friends.", "name": "Euro Grill", "rating": 4}, {"index": 110, "review": "My boyfriend and I absolutely love this place! The cheese and meat pies are so good, but get there early they run out fast. The gyros are probably my favorite and the best I've had since moving to the bay area! Since we've found it, we've eaten there four times in the past two weeks!", "name": "Euro Grill", "rating": 5}, {"index": 111, "review": "When I feel like having Ćevapi, a taste of the homeland, I come here! Their crepes are delicious too!!! This is the only Bosnian restaurant around, and that's what makes it so special.", "name": "Euro Grill", "rating": 5}, {"index": 112, "review": "2nd review\n...menu changed so asked...told under new mgmt. No goulash, no cabbage rolls, no fresh baked bread. Ok understand but then never came back to take order until we went to get him...one server,one front of house, asked for water 3x. Such a diff experience ..wont be back .", "name": "Euro Grill", "rating": 3}, {"index": 113, "review": "Who knew that Bosnian food was so delicious? The only down side is that I rarely go to Santa Clara, especially now with the owner-caused melt down of the Niners. Everything here is fresh, tasty & affordable. I will definitely be back.", "name": "Euro Grill", "rating": 4}, {"index": 114, "review": "I came here with two friends a couple of nights ago. I had the goulash and I loved it. The side dishes were mashed potatoes and rice (a lot of starch, I know, but I'm Asian, and we aren't afraid of starch-- especially rice!). The potatoes and rice are great for soaking up the goulash sauce. It isn't as spicy as other styles of goulash, but it has a great flavor. \n\nBoth my friends had gyros and they were very pleased. \n\nTry the rosehip soda. It's a refreshing change of flavor from most soft drinks. It's somewhat cola-like with a tartness (from the rosehips) that is different from just plain lemon.", "name": "Euro Grill", "rating": 5}, {"index": 115, "review": "i got taken here yesterday by my friend from Bosnia.\ni was slightly skittish as i'm not very familiar with the cuisine. \nshe ordered cevapi for me and i have to say, it was mind blowing! the sausage had a great flavor and the bread was incredible! (the bread really made it) super fresh and light.\n\ni'll need to go back another 4 times just to try the foods i saw others having.\n\nthe place is small, so make a reservation just to be polite to the staff if you're a larger party.\nthe staff is exceptionally friendly and accommodating. \n\ni need to take my wife here next week to spend the love this place dishes out.\nmy first Balkan experience and certainly not my last. good job guys!", "name": "Euro Grill", "rating": 4}, {"index": 116, "review": "Been here twice and I was not disappointed with the food. Very nice place, good service and food. Everything is well cooked.", "name": "Euro Grill", "rating": 4}, {"index": 117, "review": "Delicious food for when healthful eating if not your prime objective.  Very tasty, very filling, very nice waitstaff, all at a reasonable price.", "name": "Euro Grill", "rating": 4}, {"index": 118, "review": "Went around 5:30 pm on a Wednesday. Wasn't busy but waited a few minutes for someone to come to the front and take my order. Ordered their euro. Didn't take long to come out. The man working was very nice. The euro was enormous! Almost the size of my head. The lamb was tasty, wasn't drowned in yogurt, pita was soft and you knew it was fresh made. Will come again soon.", "name": "Euro Grill", "rating": 4}, {"index": 119, "review": "Great Bosnian food. Must try if you like food from Southeastern Europe or you want something different.", "name": "Euro Grill", "rating": 5}, {"index": 120, "review": "I really liked this restaurant. Despite good yelp reviews, it flies under the radar due to its location. I recommend the \"small\" portion of their flagship sausage/homemade bread dish!", "name": "Euro Grill", "rating": 5}, {"index": 121, "review": "A little gem hidden in a small strip mall in a less crowded area of Santa Clara.  The menu is small, but the food exquisite.\n\nMy companion and I ordered Chicken Skewers and Goulash to share between us.  The two Chicken Skewers came with a warm fluffy pita bread with a choice of french fries or green salad, sour cream and a delicious thick crushed pepper sauce.  I chose green salad.  The chicken was nicely grilled and flavorful, though I would prefer it to have slightly less salt.  The goulash was the best I've ever had --  well seasoned and not overly thick and too much tomato sauce like many others.  The beef was lean and very tender.  All servings were very generous.\n\nI believe this is a family run business.  A small restaurant with probably about 10 tables.  The servers were very pleasant and hospitable.\n\nI highly recommend this place.", "name": "Euro Grill", "rating": 5}, {"index": 122, "review": "HEADS UP!! Under new management. Sarma and goulash are no longer on the menu. Big sad face... Palacinke is still good but uhh no I can't believe it no more sarma or goulash :(", "name": "Euro Grill", "rating": 4}, {"index": 123, "review": "My husband and I had been to Euro Grill twice and the food was decent, but this review is on my third time when I visited with a friend today.  I got there at 11:15am, and the owner asked me right away if I was ready to order.  I told him I would wait for my friend, and asked if the Gyro Sandwich came with french fries because I think it did last time we came.  He said \"Does it say that anywhere on the menu?  It only comes with whatever it says.\"  He could have just said no in a polite manner but I was a little offended.  After my friend walked in, the owner said \"We can only serve you the pocket right away, or your order will have to wait for half an hour.\"  They had a big party coming in at noon and we were the only ones in the restaurant, so I asked if we could order anything else.  He said no, you have to wait if you want it.  \n\nThis was awful service.  There were only 2 of us, and we had 40 minutes until that big party arrived and he couldn't just make an order for us?  Sorry, but I really enjoyed your food in the past, now I wouldn't recommend this restaurant to any of my friends because the service is awful.  We ended up getting a spinach and cheese pocket which was only okay, not fabulous like the owner said it was.  \n\nOverall a bad experience here.", "name": "Euro Grill", "rating": 2}, {"index": 124, "review": "This is a small,  easy to miss little restaurant at the back of the small building complex on the corner of the street. When I walked in, at first I was afraid I had walked in on a private event. Almost all the tables were full but it was pretty quiet in there. The hostess was not at the front desk and all the guests looked at the new arrival standing in front of the door.  One of the guests kindly commented to me after a few moments and noticing how awkward I felt, that the owner was in the back and she would be out shortly. I stood there nervously for a few minutes more but when she came out she seated us right away and was really nice. She explained they were out of chicken skewers and meat pies (Bummer!) and told us a little bit about the drinks they had. We asked for water, and got bottled water and had to specify that we meant tap water. Other than that, everything was great.\n\nIt is not a huge menu - a couple of soups and salads and a handful of entrees and sodas and such. However, it was really good! My friend and I had the combo plate. Big mistake - in terms of how much left-overs we had! We should have split one Combo and ordered a salad or something. They were out of the chicken skewers so we got extra sausages.  I'm not complaining- it was delicious!  My boyfriend got the goulash. He must have liked it because he only shared one bite with me then proceeded to steal from my plate.  The meat was juicy and well seasoned and the portions were generous. I can't really judge authenticity, but it seemed like most of the other diners were Eastern European - and that is generally a good sign at an ethnic restaurant if the people who know what it is supposed to taste like go there, right? The prices are very reasonable, and we went home with plenty of left-overs for the next day .\n\nWe'll have to go back and try the other items on the menu.", "name": "Euro Grill", "rating": 4}, {"index": 125, "review": "Awesome restaurant!  If you like cheeseburgers, try the cevapi which is a Bosnian meat and bread dish that is delicious.", "name": "Euro Grill", "rating": 5}, {"index": 126, "review": "I only came here because my friends wanted to try this place out. Im not a fan of european cusine because I come from a more spicier background... I tried the cheese pastry they had it was just ok and had some fries. \n\nCustomer service was exceptional very nice and did a good job serving us. However, probably won't come back because I wasn't too impressed with the food.", "name": "Euro Grill", "rating": 3}, {"index": 127, "review": "This place is awesome. The food is so fresh. Just like the old country. The Cevaps are homemade. So is the bread and Ajvar. My newest regular place!", "name": "Euro Grill", "rating": 5}, {"index": 128, "review": "Loved the Cevapi! The guy there was very helpful & service was fast ! Tip: call ahead and check the hours they are open that day.", "name": "Euro Grill", "rating": 5}, {"index": 129, "review": "Not sure you can get better cevapi or goulash in the Bay Area. Incredible Bosnian fare. Brought me back with delightful memories. Highly recommend.", "name": "Euro Grill", "rating": 5}, {"index": 130, "review": "Being from the area (Balkans), I cannot  give this place less then 4 stars...To my knowledge this is the only food joint in the Bay Area that serves food from former Yugoslavia. You will find all of your usual fast food from the area (owners are from Bosnia) like cevapi u somunu, burek; and some Balkans domesticated dishes such as goulash, or staples like sarma. They also have a decent selection of sodas and juices from  (mostly) Slovenia....\n\nOn to the food....even though I don't live near South Bay I try to stop by here every time we are in the area. I almost always get the same thing-large portion of cevapi.  If you don't know what that is let me break it down... you get 10 delicious, fatty sausages in a bread called somun dipped in more fat...mmmmmmm. Being a Bosnian restaurant they stick to no-pork meat combination for cevapi. While I prefer combo of beef/veal/pork as you would encounter in Croatia or Serbia, I am happy that there is a place that even serves cevapi in this area. I also tried burek here which was ok but below average if compared to anything in ex-yu.\n\nNow on why 4 and not 5 stars...It seems like the interior has deteriorated lately.  The place is not as clean as it used to be and in the bathroom there are traces of algae around the sink (or another green unknown substance). Service is good but can be slow.\n\nAll in all great place to try if you never had Balkan food. Also a great place if you tried Balkan food abroad and want to go back....", "name": "Euro Grill", "rating": 4}, {"index": 131, "review": "the only word to describe our food is WOW.   Our food was brought to us quickly and was excellent. \nMy gyro was so good i can only describe it as melt in your mouth delicious. My husband had the cevapi and said they were excellent (and the real reason we drove the hour to get there) \n\nhighly recommended - cant wait to go back", "name": "Euro Grill", "rating": 5}, {"index": 132, "review": "We grabbed a number of items and loved them all. Combo plate, chicken soup and mushrooms were fabulous. Nice staff. We got there just before the rush and got the last pastry with spinach and cheese. Delicious!", "name": "Euro Grill", "rating": 5}, {"index": 133, "review": "OMG \nWaited so long. Almost walked out\nHad to find someone to let them know I was here and wanted to eat. \nIgnored by server who was obvious overwhelmed. When I did catch him he said at least 20 minutes wait for any food. \nHow can you run business like this\nI waited min. Because I really wanted to eat here.", "name": "Euro Grill", "rating": 3}, {"index": 134, "review": "Authentic food- a must visit for all locals! Owner is great :) cevapi and crepes are amazing.", "name": "Euro Grill", "rating": 5}, {"index": 135, "review": "Ok, like others said. The food is extra salty. I didn't really realize it until after I left and was drinking tons of water. The food is good though. Really liked the combination meat platter and the borek was my favorite. The borek was actually not very salty. It was perfect. Hands down my favorite thing there!!!! I will be back for the borek for sure and some beef sausage. The salad was nice and made with fresh ingredients as well. The owners are really nice and very hospitable. I will be back here for sure. Just got to make sure to drink a of water before and after. Maybe I can ask them to put less salt next time as well.", "name": "Euro Grill", "rating": 3}, {"index": 136, "review": "UNDER NEW MANAGEMENT - and it is NOT a good thing\n\nI returned here last week with a friend.  I ordered goulash and was dismayed to learn it is no longer offered.  The menu now pared down to just grilled meat with dry bread.  I ordered the mini sausage sandwich.  It took 30 minutes to come out of the kitchen!  And the place was not even full. \n\nIt is autumn, and next month, winter.  Who wants burgers and grilled sausages in cold weather?  Warm stews are comfort food during these two seasons. \n\nSadly, until the restaurant brings back their goulash and samra, they lost a customer.", "name": "Euro Grill", "rating": 3}, {"index": 137, "review": "They have an assorted menu of distinct specialty dishes and imported drinks you can't find anywhere else.\n\nService and food here is 5/5.  If you're into home-cooked Balkan(borderline Mediterranean) food, Euro Grill is for you.", "name": "Euro Grill", "rating": 5}, {"index": 138, "review": "We didn't realize it closed at 7:30, and that's about exactly when we arrived.  We walked in wondering why there was no one else there.  There were two men, and one hurried to the kitchen when we arrived - turns out he's the chef.  The other served as host and waiter.  He has a very thick accent and it was hard to understand him.\n\nFood: we had the combination ($10.99) and the chicken cream crepe ($8.99).  The combination is a 3 types of meats inside something that resembles a bun and comes with sour cream and onions.  The meat was good, somewhat oily but I guess that's expected.  The bun-thing was also oiled. The chicken crepe contained mushrooms, topped with sour cream and cheese.  It was good as well.  I wish they would have come with a side salad or something, but I think you have to order an entire salad separately.  Be warned that the food is very heavy!  My boyfriend was unable to eat more than 1/4 of the crepe dish because the heaviness made him nauseous.  Also be warned that if you just order water to drink, he automatically brings you bottled water ($1.49 each) and just the bottle, no glass.\n\nService: It was ok.  If we hadn't come in right at closing, I think the service would have been better.  He was quick to seat us and take our orders.  He realized it was kind of cold and told us he was turning on the heat.  The food came at an appropriate time.  In the middle of our meal he asked us if we wanted dessert, otherwise he was letting the cook go home.  He only checked on us once, at the beginning of our meal.  We waited for the check to come, but it did not.  We had to knock on the door in the back to get him to come out and give us the check.  \n\nAmbience:  After we sat down, he turned on ethnic music. The room is all ikea furniture and decorations.  It was fine, but my boyfriend felt we were sitting in someone's dining room.  Part of it was because the building looks like a house.  \n\nOverall, a somewhat awkward meal because we came in right at closing.  The food was good for me, not so much for my boyfriend.  I would come back, but my boyfriend won't.", "name": "Euro Grill", "rating": 4}, {"index": 139, "review": "My meat eating friend liked it, owner was super nice, but don't bring vegetarians. Basically all you have is the salad.", "name": "Euro Grill", "rating": 3}, {"index": 140, "review": "Delicious food, and very good quality for the price\n\nBe prepared for a large, fullfilling meal", "name": "Euro Grill", "rating": 5}, {"index": 141, "review": "I am from the middle east so i know my kebobs! This may be the best grilled meat i have ever had! Holy moly i cant wait to go back!\nAlso it is a run by a very nice family and the owners are very friendly and sometimes you see their kid running around; a very nice and wholesome family owned business. \nI cant wait to go back!\n\nH", "name": "Euro Grill", "rating": 5}, {"index": 142, "review": "Food was pretty good. The service could have been better, it was a packed house and only one person (her help had to leave earlier), but she was trying as hard as she could and was very apologetic. Definitely willing to go back and try again.", "name": "Euro Grill", "rating": 4}, {"index": 143, "review": "Love this hidden gem! The place is small so fills up fast. I've only gotten to try the gyro sandwich and the flavor is great! The only complaint I have is that the sandwich had too much yogurt sauce & was slowly falling apart as I was eating if. I would ask the yogurt sauce on the side next time. I also wish they have rice as an option but the bread was soft & yummy too. Will def be back!", "name": "Euro Grill", "rating": 4}, {"index": 144, "review": "This place is pretty small that you can easily miss it even with the GPS on. But it's definitely worth checking out. Came here for lunch and really enjoyed the food.\n1- It's Halal\n2- Very friendly (I think it was the owner doing all the serving during the day)\n3- A very unique taste of food (Bosnian I believe)\n\nI ordered the Combination Plate along with a Euro burger, but the manager then suggested swapping the burger for Goulash. His argument was the combination already comes with a lot of meat and includes a mini burger in it, while the goulash is a unique addition. I went with the suggestion and enjoyed it a lot. The goulash is like a homemade beef stew in a tomato sauce with carrots, along with rice and mashed potato for sides. It was delicious. I enjoyed dipping their unique bread into the sauce of the Goulash :-}\n\nThe combination plate is nice, but too much meat with the Goulash for 2 people. I'll definitely mix it up next time I come here.", "name": "Euro Grill", "rating": 5}, {"index": 145, "review": "This is one of those gems in Santa Clara that you need to visit. Unique food. Delicious grilled chicken and sausages.  Amazing homestyle cooking. Long wait, due to small staff. Be prepared, and dont complain.l, because its worth it! Mom and pop joint. I eat here 2 to 3 times a month.", "name": "Euro Grill", "rating": 5}, {"index": 146, "review": "5 stars for the food. This is the only place in the bay I know of that has Bosnian food. I grew up on cevapi so it's awesome to find a spot that has them.  The store next door (same owner) had a decent selection. \nA tip though,  if you want something specific, for me sirnica or any pita, call ahead and have them hold it for you since they sell out fast.", "name": "Euro Grill", "rating": 5}, {"index": 147, "review": "Everytime I've attempted to dine at Euro Grill, it was either closed or no one was available. But luckily the third time the bf and I went, it was open with someone attending the cashier. Score! It's a small little place that looks like a renovated office space. Nonethless, the service was great and the menu is simple. We ordered the mozzarella sticks, gyro, pljeskavica. Prices aren't too bad and the portions are huge! The gyro had so much meat and the pljeskavica was the biggest burger I've ever seen! The fries that came with the gyro were yummy as it was non-greasy/oily. The mozzarella sticks were yummy as well! \n\nGreat small dining alternative! The third time was truly the charm for us!", "name": "Euro Grill", "rating": 4}, {"index": 148, "review": "Went here for my little sister's graduation for dinner. The food was amazing! The service was really good, our server kept coming and checking on us. They also gave our entire party a complimentary dessert, some sort of crepe with nutella inside and topped with nuts, was really good. \n\nI got the golash, which was beef stew served with mashed potatoes, rice and Bosnian bread. It was really good.", "name": "Euro Grill", "rating": 5}, {"index": 149, "review": "We just stopped here for a quick dinner after a trip to Costco...  Yum!   New-to-me food.  I am a small person so a half portion of the sausage sandwich was perfect, I wish more places would do that for at least a menu item or two.   The sausage, the bread AND that tasty tasty red pepper tapenade together were a nice match, I would order it again.  I had a rosehip soda and a nutella crepe for dessert.  Reasonable prices, I would like to go back.  Appreciated that they served us with just 30 minutes before they closed.\n\nRestaurant is small, was very clean and with inviting decor.  Parking lot access from the side street, not El Camino.   Little European market nearby is I guess connected, will have to check it out when it's not so late.", "name": "Euro Grill", "rating": 5}, {"index": 150, "review": "The awesome homemade bread is what makes this place.  We got the combination which came with a lot of meat.  Could get an extra bread and share between two people.  Also got a borek which would have been better warmed up in the oven instead of microwave which made it soggy (-1 pt).", "name": "Euro Grill", "rating": 4}, {"index": 151, "review": "We got the Goulash, Sudzukice, and Gyro with fries. The fries were a little plain, but everything else was delicious, especially the Goulash! The bread was also quite nice, which is a rarity. The lady who gave us our food was also incredibly nice. Overall, this is a great little place with very reasonably priced dishes.", "name": "Euro Grill", "rating": 5}, {"index": 152, "review": "Terrific food, lovely ambiance, and hospitable staff. This is a true hidden gem.", "name": "Euro Grill", "rating": 5}, {"index": 153, "review": "Fabulous as always the crepes are dangerously delicious please don't order them or you will be hooked!!!", "name": "Euro Grill", "rating": 5}, {"index": 154, "review": "First visit for I and my friend. Had lunch today. Friend's idea. Entrance is from Washington. Parking was full; so parked on street. I ordered the Goulash and my friend ordered Cevapi. The Goulash was very bland and had hardly any salt. I tried a sausage; pretty standard. The place was packed; so looks like a popular eating place. However Balkan food is not for me.", "name": "Euro Grill", "rating": 3}, {"index": 155, "review": "Places like this are the reason that Yelp should have its reviews do an average of ratings over the last 6 months.\n\nI came here with my wife after reading tons of positive reviews and seeing pictures of delicious food. When we arrived, the place was dead and people seemed surprised to see customers. We sat down and I noticed that none of the items in the pictures that I wanted were on the menu. The menu now only has a few basic items. We ordered and started our long wait for our food. \n\nSince the food was taking so long, I had time to look deeper into the reviews. I noticed that someone had rated it with 2 stars and mentioned a change in management. That's when it all clicked. Every review placed before 9 months was amazing. Everything after 9 months prior was crap.\n\nThe food finally arrived and it was plain, salty, and greasy; Just like all the recent reviews have stated. I would not eating here again.\n\nThe only reason this place has a good score is because they are living off the back of the management before them. If the score was based on only the current management and state of this restaurant, it would be a 2 star restaurant at best.", "name": "Euro Grill", "rating": 1}, {"index": 156, "review": "Excellent food. I always get the combination plate. Very friendly and polite staff. Highly recommended!", "name": "Euro Grill", "rating": 5}, {"index": 157, "review": "The home made bread is nice and the goulash is good. The Gyro is ok.\nOverall it was a nice lunch for a decent price. \nLot's of meat to choose from.\nWhen I went for lunch there was only one waiter, and you have to look closely to spot the entrance in the back of a house.", "name": "Euro Grill", "rating": 4}, {"index": 158, "review": "Soooo good. I vowed to only taste the bread...but I was defeated. Goulash gets 2  thumbs up. I will definitely be back.", "name": "Euro Grill", "rating": 5}, {"index": 159, "review": "OMG, the bread!\n\nMy husband and I loved everything at this restaurant, but the grilled bread (lepinja) is The Stuff. I'd never had Balkan food before, but I'd describe it as similar to a cross between Turkish, Greek, and Austrian. Imagine grilled meaty sausages, juicy chunks of skewered chicken, and cabbage rolls. The dishes we ordered were served with a vegetable-based condiment that perfectly complemented the meat. We loved it so much that we went to the Euro Market next door and bought some afterwards.\n\nThe atmosphere is bright, clean, and cheerful. It reminds me of a cafe where you'd sit and linger. The guys who served us (who seemed like the owner) was friendly, efficient, and gave us some fries on the house for no discernible reason. Nice!\n\nWe're already planning to come back and buy some bags of the freshly based bread so we can try to recreate the experience at home.", "name": "Euro Grill", "rating": 5}, {"index": 160, "review": "Awesome, awesome, awesome place!\nHow many times can I say 'awesome' :)\nThe owner/server is super friendly, nice, and polite. The bread is home-made and fresh. \nIt was my first time here with my co-workers. I was the first one arrived and the place was just opened. I got to choose the table. I sat way back that got sunshine. Perfect spot!\nI got the gyro with bread. I really loved it. I was content!\nThe place was small, but it's really great for small groups to converse. \nI will definitely come back again for more delicious food and awesome service!", "name": "Euro Grill", "rating": 5}, {"index": 161, "review": "I've been there for a lunch and it was pretty good: the place is clean and it was almost empty on Friday 1 pm. The parking is a bit tight. \nThe service was good and I waited not more than 10 minutes to get my tasty goulash.", "name": "Euro Grill", "rating": 4}, {"index": 162, "review": "Great food with authentic balkan food (been there,done that). I highly recommend. Burek with meat is great. Additionally they have a shop with more or less same and more stuff that you can buy and do it yourself at home.", "name": "Euro Grill", "rating": 4}, {"index": 163, "review": "I went on a AAA date with Ann B and Anthony L the other day. I guess the owner manages both Euro Grill and the market next door, because even though we got there during business hours, the door was locked! Luckily, Anthony L has been here before, so we went to the market and asked the owner to open it up for us. Anthony L got his sausage sandwich, and Ann B and I shared the sampler plate. We also ordered stuffed mushrooms [I was craving them] and garlic bread.\n\nStuffed mushrooms&garlic bread came out first. Garlic bread was pretty good, but I like it crispier [it was a bit soggy]. I was surprised by the stuffed mushrooms... the cream cheese taste was a bit too overpowering for me. Oh well. Our main courses were pretty good, although I definitely had onion breath afterwards from the raw onions. I liked the bread! But yeah there was a LOT of meat... Ann B doesn't really like the taste of charred meat, but I don't mind it.\n\nPrices are pretty reasonable, and the owner is very nice. I may be back, but I don't think I'll ever really crave Euro Grill.", "name": "Euro Grill", "rating": 4}, {"index": 164, "review": "This place is authentic (mix of Balkan and Mediterranean food). The owner is a nice funny friendly authentic guy. Really glad we found this place and that it is in Santa Clara!\nFood is good - I would not say it is excellent... (My mom's food is the best :)). I found the meat tasty but a little chewy. The overall experience was nice. Feels like a family place: welcoming and convivial. \nTheir bread is excellent though! It looks like it is homemade.\nThere is a Euro market store next by and you can buy the bread there.\n\nAnyways.. it is a fun place to come on a Sunday with your family or friends - if you want to try specialties from South Eastern Europe.", "name": "Euro Grill", "rating": 4}, {"index": 165, "review": "The homemade bread is awesome. I can eat that alone or with any sauce that comes with the dishes here.\n\nEntree:\n- Euro burger is still the best. Loaded it with grilled mushrooms and onions. The patty is well spiced and juicy. \n- Beef stew is also decent. Taste like home cooking.\n\nDesserts: \n- Apple was great. I'm not a dessert person but I finished this one.\n- Crepe is nice.\n\nThe customer service is also good, but when they are busy, the service can become much slower and the quality of food can go down (lack of consistency).", "name": "Euro Grill", "rating": 4}, {"index": 166, "review": "I was really expecting a bistro style place offering tiny portions at high prices.  It's anything but that.  Great fresh bread, sausages, spiced up burger patty, and gyro meat.  Real home cooking.  I've never had this style of Mediterranean food.  Excellent crepe and great service.  Check out the market, too.", "name": "Euro Grill", "rating": 5}, {"index": 167, "review": "I used to live in the Balkans and am often homesick for proper food. Having recently moved to the Bay Area, I hoped to be surrounded by yumminess again. Euro Grill made me feel like I was eating at a nice place in Sarajevo.Heaven! \n\nThe burek is in the style of Sarajevo and it is heavenly. We had both the spinach and cheese and meat versions. Don't make me pick a favorite! Burek with a yogurt to drink is a meal of champions. I ordered burek as starters for us which we washed down with Cocka, a regional soda that is light and refreshing. Like most non-American sodas, it isn't a 1/4 as sweet. \n\nThe mixed meat plate was Balkan grill at its yummiest. The cream that it is served with made me want to beg for more. The lepinje (bread) was grilled, as it should be, and melted in my mouth. \n\nI can't wait till we go back (could be tomorrow!). Be sure to go to the market next door!\n\nPS: My boyfriend and I loved it so much that we're seriously considering having them cater our wedding!\n\nAfter seeing some complaints about gyros, I am forced to give my basic advice to \"ethnic\" restaurants: don't order food from outside the culture. I always shake my head when people order hamburgers at Mexican places and are disappointed. Same follows at Euro Grill.", "name": "Euro Grill", "rating": 5}, {"index": 168, "review": "Verdict: Fun place to go and try Balkan food (don't worry, I didn't know what that was either). \n\nAlso: It's right next to the Euro Market which is run by the same guy, if you want to check out some cool Balkan groceries! (Aka lots of nutella, sausage, etc.)\n\nThe Euro Grill recently opened, so when we went, there was no one there, although 2 or 3 people ordered food to go. The atmosphere is more like a cute cafe, only it serves hearty, meaty meals.\n\nWe ordered the meat combination which came with cevapi (sausage), spicy sausage, and a chicken skewer. It was delicious; who knew Balkan meat was so yummy (and greasy...). My favorite was the cevapi, which was tender and juicy. \n\nWe also got the Sarma, cabbage rolls stuffed with beef and rice. The cabbage was pickled and too sour for me, but I could see some people liking it :P\n\nAnywho, my favorite was the kifla bread our food came with. Think dinner roll only fluffier; I ate two of them and could have kept going if I hadn't been so full!!\n\nWe also got the crepe with nutella and ground peanuts on top. I died. Too good. Get it! We also tried some Balkan sodas...the Jupi (basically Fanta orange soda) and the Cockta (unfortunately named, it tasted like a strange mix of Coke and chocolate?)\n\nWow looking back we had quite the food adventure. Definitely a fun place to eat at, the owner is a cute old man who talks in a heavy accent and is very friendly :)", "name": "Euro Grill", "rating": 3}, {"index": 169, "review": "Goulash, Gryro, Cockta...can't find it this authentic and at this quality anywhere else.", "name": "Euro Grill", "rating": 5}, {"index": 170, "review": "Oh my gawd.  I'm in the vicinity about once a month and can't believe that I didn't have the instincts to try the food here until just recently.  I ordered a creamy chicken crepe which I thought was freakin' superb and I can't wait to try more of their dishes.  \n\nCome here for a casz luch or dinner and then stop off into the market (for desert) a couple doors down that has fantastic imported Belgium chocolates.\n\nDeem me as a new \"frequent\"", "name": "Euro Grill", "rating": 4}, {"index": 171, "review": "I love this place! The meat is cooked really well. The place is so clean. The soup is so great and big. The food is really healthy! Will definitely come again!", "name": "Euro Grill", "rating": 5}, {"index": 172, "review": "I had the mixed grill and my wife had pickled salad and stuffed mushrooms.  There was no room for desert,  Authentic food just like Baka Danica used to make.  We know this food.  If we lived closer we would be in here once a week.  Do not expect every item on the menu to be available every day.  But you can expect fresh, delicious food.  There is a nice, friendly, well stocked eastern european market two doors down in the same plaza.", "name": "Euro Grill", "rating": 5}, {"index": 173, "review": "Everyone was very friendly and food is so fresh and delicious! Recommend the crepes w/ Nutella !", "name": "Euro Grill", "rating": 5}, {"index": 174, "review": "This place is amazing. The most authentic Bosnian fold you'll find on the west coast. Eat the combination platter if you are a meat lover and you'll keep coming back", "name": "Euro Grill", "rating": 5}, {"index": 175, "review": "Best Balkan food I have been able to find in California! Plus I get to speak some Serbian/Bosnian with the waiters, so I'm happy! :)", "name": "Euro Grill", "rating": 5}, {"index": 176, "review": "I have to admit, I haven't taken the time to write a Yelp review in a while. To be honest, I haven't had a standout experience in quite some time. Today's lunch, however, prompted me to make some time to write about Euro Grill. I cannot recommend this place highly enough. For what it is, it easily earns its 5-stars. \n\nIt is a little difficult to find (park in the lot behind the building and the entrance is off the lot, NOT off the street. It is the first door past the stairs), but if you are persistent enough to track it down, you will be rewarded. \n\nIt is Balkan food... ranging from goulash to gyros and some interesting stuff in between. I had the goulash, the meat feel apart on my fork. I did get a bite of a friend's gyro and the lamb was seasoned perfectly. And the homemade bread. WOW. \n\nIt was a LOT of food, the portion sizes are generous and the prices are very reasonable (my goulash was only $8.99). Prepare to take food back to the office with you. There's no way you can eat a whole portion and not fall asleep during your afternoon meetings.\n\nThe service was great. The proprietor took great care of us. The space is very tasteful and clean. The other patrons in the place were all speaking Hungarian, so you know it's gotta be authentic.\n\nI love this place, will definitely be checking it out for dinner. I've worked within walking distance of Euro Grill for a year and a half and I am kicking myself for not having come here before today.", "name": "Euro Grill", "rating": 5}, {"index": 177, "review": "Great food, nice ambiance, friendly service. I particularly liked the stuffed mushrooms and goulash.  The bread was good too.  My GPS couldn't find the restaurant.  While the address is  El Camino, restaurant and parking are in the back of the building.", "name": "Euro Grill", "rating": 5}, {"index": 178, "review": "Meat felt like it had lots of soy-components in it. Not that cheap to justify the quality.", "name": "Euro Grill", "rating": 2}, {"index": 179, "review": "Had the cevapi & the meat pita/pie (not sure of the correct term) both were very good & fresh.  Fast service, clean place, & good food--can't ask for more!", "name": "Euro Grill", "rating": 4}, {"index": 180, "review": "Had to run to the Costco on Coleman, needed lunch, and saw the reviews for this place.  Very good find.\n\nFriendly owners, clean tables, good food, reasonable price and easy parking.", "name": "Euro Grill", "rating": 5}, {"index": 181, "review": "By far the best Bosnian food in the Bay Area! The hostess/waitress was really polite and very helpful. Definitely coming back and the food well it was really good. If your in the mood for meat this is the spot. Bomb ass crepe dessert make sure to have them make it with their own version of Nutella (imported)", "name": "Euro Grill", "rating": 4}, {"index": 182, "review": "Euro Grill is a fantastic gem of European grilled meats as the name implies. Fave is the mixed meat grill :)", "name": "Euro Grill", "rating": 5}, {"index": 183, "review": "I love Bosnian food. a special cevapi is my favorite one . owner is great.  food is awesome. place is little small but who care food is awesome. \n   Highly recommended. time to go and eat cevapi now :))", "name": "Euro Grill", "rating": 5}, {"index": 184, "review": "Cozy place with delicious Bosnian food.", "name": "Euro Grill", "rating": 4}, {"index": 185, "review": "Euro management and service were both nice and warm. Place was quiet, clean and welcoming. we ordered Cevapi (Sausages in a homemade bread (Lepinja) served with sour cream, onions and red pepper sauce) and Chicken Skewers (Two skewers with chicken, zucchini, bell peppers & onions served in homemade bread) although it took a while to get the (like cooking home) but both dishes were just delicious.", "name": "Euro Grill", "rating": 4}, {"index": 186, "review": "I really want to like this place.  It is right down the street from my house.  The owner is nice, the food is good, but the service is extreamly slow.  It is so slow I've quit coming here.  I feel bad leaving a 1 star review, but 40+min for a sausage is ridiculous.", "name": "Euro Grill", "rating": 1}, {"index": 187, "review": "mmm.. I would say this place got between 4 and 5 stars because the owner seems very busy and forget things but I can't get mad at him because he tries to do his best. We love their euro burger and the cevabi, their bread is super tasty. \nAnd of course we love to shop the euro market next door to get the goodies.", "name": "Euro Grill", "rating": 5}, {"index": 188, "review": "I just had the \"mini\" serving of the sausages sandwich, and oh my god that was amazing. I don't think I've had any sort of Slavic/Baltic food before, but I can't imagine anyone who would dislike this. The BREAD was the most amazing part. It's homemade, rich, moist... I don't know how else to describe it. I'm not that big of a bread person. But this was something special.\n\nSausages were excellently flavored and came with a side of red pepper sauce (not spicy), chopped onions, and thick sour cream. The \"mini\" portion was just a half sandwich, but this thing is rich so if you're trying to be at all health conscious it's probably best to get the mini.\n\nI'm plotting my return to this place!", "name": "Euro Grill", "rating": 5}, {"index": 189, "review": "I just came back from a trip to Eastern Europe about a month ago, and while there I had eaten all sorts of European foods like Goulash, Schnitzel, etc. When I came back I had a voracious craving for Goulash as it was one of my favorite meals when I visited Budapest. I decided to look around for a place that had it on their menu and found Euro Grill which was right by my work. I ordered a Goulash to go and went to pick it up. The restaurant is pretty small, but quaint. The staff there is super friendly. Since they were still working on my order the manager asked me to go over to their European grocery store which is right next door and wait for my order and browse around. I found some cool things there and the man working at the store was really friendly. Not only did they give me my order super quickly, but they also gave me free water and chocolate to take with me. The goulash was pretty good, not what I had in Budapest of course, but still pretty good. Its basically braised meat with carrots in a tomatoey sauce. It could be spicier for my liking, but I'm just surprised I found some around here. When I had got to the restaurant I saw a lot of people eating some sort of gyro looking sandwich, if I got back I would def try that. This is a definite must try if you want to taste European cuisine.", "name": "Euro Grill", "rating": 4}, {"index": 190, "review": "Wow!  Amazing food.  Best restaurant in Santa Clara for sure.  We ordered the combination plate and beef stew.   Everything on the combination plate ( small sausages, patty, chicken skewers, spicy sausages) was amazing.  Beef stew was good as well.  Dessert crepes was also delicious.  Very friendly service.  Love this place.", "name": "Euro Grill", "rating": 5}, {"index": 191, "review": "We came here  to mix it up a little and try something new.  It is a small place that is a next to a market managed by the same owners (a little hard to find).\n\nThis was our first experience with Slavic/Baltic food and we loved it.\nThe dishes were tasty (especially the crepe dessert) and the portions were very generous!  \nThe only downside is no beer or wine but the food and friendly service more than compensates for it!", "name": "Euro Grill", "rating": 5}, {"index": 192, "review": "I love this place. The owners are incredibly friendly. It's so homey. The only restaurant with authentic Balkan food in the entire Bay Area. Cevapi and burek are my favorites. Also check out the grocery store in the back for more delicacies.", "name": "Euro Grill", "rating": 5}, {"index": 193, "review": "I had a great experience calling in an order for pick up. I ordered burek (giant beef pastry) and sarma (cabbage wraps). Food was ready in 15 minutes as requested, which was great, but the best part was how incredibly nice the owner is. He's very energetic and talks fast, so he can be hard to understand, but he makes you feel right at home. He even opened up the closed Euro market next door so I could buy some yummy Croatian wafers and chocolates. The food was hearty, delicious, and per my Bosnian friend, totally authentic. I will definitely be back to try some of the other amazing-looking things on the menu.", "name": "Euro Grill", "rating": 5}, {"index": 194, "review": "My wife and I ordered a cevapi sampler, burek, Cocka (yugoslavian cola), coffee, and Tufahija (stuffed baked apple).\n\nWe had never had Bosnian food before, but we loved everything we ate here.   The sausages were excellent and the bread was outstanding.\n\nThe cafe is cute and nicely decorated.\n\nOur waiter was very helpful and provided warm, prompt service.\n\nWarning: the hours of operation are different from those stated on the cafe's web site, so I suggest you call ahead to verify they're going to be open when you arrive.\n\nWe'll definitely return!", "name": "Euro Grill", "rating": 5}, {"index": 195, "review": "Amazing!  Most of what the Yelp reviews say are true. This place and the food are incredible. The unique Lepina bread melts in your mouth. The goulash was perfectly seasoned and the mashed potatoes were the creamiest I've ever tasted. \n(However, the food tends to be a little heavy on the salt)\nThe Nutella crepe made me weak in my knees. I've had Nutella crepes before but nothing like this. \nThis menu is designed to seduce your senses and it does! \nThe owner was awesome. He actually did open the restaurant especially for us.  The place is difficult to find so don't even try. Go straight to the Euromarket and the owner will walk you over and get you set up. \nA MUST GO place!  You can't go wrong!", "name": "Euro Grill", "rating": 5}, {"index": 196, "review": "In one word, Spectacular! Tiny little place, not really the \"dining experience\". But the food, OMG, it's out of this world! I gave up fast food (and joints like chilis/applebees), and found this place. It's actually cheaper in some respects.\n\nLike Restaurant Impossible where Robert Irving implores their owners to make clean, fresh, flavorful, authentic dishes with love and care...this place already does it.\n\nLike everyone already said the fresh baked bread is outstanding. The ingredients have always been super fresh. Flavor profiles are well balanced. We usually get the Gyro or Goulash, both are amazing. \n\nThis is Bosian I understand? It's a great fusion food that is not forced, just perfected. Love the owner, he's a really nice and accommodating guy :-)", "name": "Euro Grill", "rating": 5}, {"index": 197, "review": "Can't believe I've driven by this place so many times and never knew about it.  Just recently discovered this restaurant and let me just say, the owner who owns this restaurant and the market next door is very nice.  My wife and I came one day and when we realized it was closed, the owner walked out of his market and walked up to us to explain that his cook was on vacation and told us when the cook would be back.  Next time I came to pick up some food to go, I got a lamb gyro and when I brought it back home, the gyro was still smoking hot and juicy.  The french fries were still very crispy too.  \n\nI highly recommend this place and can easily consider this restaurant as having the best gyro I've ever had.", "name": "Euro Grill", "rating": 5}, {"index": 198, "review": "I would rate the food overall quite well 4-5 stars. We have been many times and always happy with the quality of the food (keep in mind this isn't \"fine\" dining). Their fries are the best! The issue is that you will have to take my word for it, for now anyway, because their fryer is broken . . . as a matter of fact, it has been broken for some time now. \n\nI give it 3 stars because of the frustration of going there. As repeat customers, we enjoy talking to the owner and we love the food, but there is a total lack of consistency. If there is one thing that defines successful restaurants, it is consistency. The issue here is that we have tried to visit many times when their posted hours say they're open, but they're not. We go to order specific food and it isn't available and then when we try to be flexible, it still isn't available. I would say about 50% of the time we go by to visit, they're closed. They have since erased their posted hours on the sign that hangs in the door's window. \n\nI would love to be able to give this place 5 stars and encourage everyone to visit and I still encourage people to do so, just be aware of the fact that it might be closed and / or they may be out of whatever food you were hoping to order.", "name": "Euro Grill", "rating": 3}, {"index": 199, "review": "Best Goulash. Period. Had a delicious lunch with my Marketing team. Can't stop talking about the garlic bread!\n\nI will definitely be returning.", "name": "Euro Grill", "rating": 5}, {"index": 200, "review": "My coworker had come to Euro Grill before and since he told me it was a small family run business, I decided to give them a go.  The menu is very simple with a few appetizers, entrees, and desserts.  The gyro and fries was $8 and the combo sausage and bread platter was $11(see photos) which is more than fair for the amount of food provided!  The gyro was a bit messy to eat but the flavor was great.  It wasn't a true gyro since it wasn't in pita bread but the bread that they used was very soft and spongy so I still enjoyed it nonetheless.  The sausage was flavorful and accompanied with onions and cucumbers, it was a nice change to try the Eastern European type of cuisine that isn't really found in abundance around this area.\n\nIt's definitely worth a return trip because the owners running it have a very friendly attitude and pleasantness about them.", "name": "Euro Grill", "rating": 4}, {"index": 201, "review": "Found this little gem via yelp. the BF and I were looking for a yummy, cheap and non Italian/Asian/American restaurant (which tends to dominate this area). BF ordered the gyro and said it was very authentic and I ordered the mini sausage sandwich...delicious! We also ordered a dessert..can't remember the name but they were like cold donuts drenched in honey and walnuts... YUM-O! \n\nPlace was quiet, service was good. would only take 1 star off because it was a bit hard to find (had to go to the back then front then back again to find the actual entrance) and when we ordered water as our beverage, they brought us bottled (and of course charged us $1.49 per bottle)...perhaps we should have been more specific when we asked for water.", "name": "Euro Grill", "rating": 4}, {"index": 202, "review": "My initial impression of Euro Grill is rather bleak. First, it was a struggle to find the entrance as they have about six different doors. Once I entered there was no one there to greet me so I assumed there was a counter to order at but no. I was noticed by an older gentleman who brought me a menu, but before I had a chance to look at it, he let me know that it was the chef's day off. As a result, only three things were available. My options were the ten piece sausages or the burger.\n\nDo they even eat burgers in Europe? For a place that specializes in Bosnian food, I would have expected there to be some raunchy looking soups and maybe bread on the menu...not a burger.\n\nI had the sausages. Small little turds wrapped in a pita-esque bread that was quite tasty. \n\nOverall I was satisfied enough...even though it was the chef's day off.", "name": "Euro Grill", "rating": 3}, {"index": 203, "review": "This place is easy to miss.  I drive down El Camino every week and I only noticed this place because of Yelp.  Anyways, food here is good and generous.  Never had this type of European food, but it was satisfying.  Service was awesome as the owner was always attentive to our questions.  But like all new restaurants, not sure how long this good service will last.\n\nAlso, their burger here is massive.  Never seen a patty that large... easily worth two meals in itself.", "name": "Euro Grill", "rating": 4}, {"index": 204, "review": "That bread of theirs is orgasmic. I had the cabbage wrapped beef, it was a tad bit salty but felt like a hearty home cooked meal. Service is warm and friendly though I wish our water glasses were filled more often. Value for $, the warm welcome, ambience and unique food make this a 5 star.", "name": "Euro Grill", "rating": 5}, {"index": 205, "review": "A nice find.  This place is going to get popular soon.  The goulash was great.  My friends loved the sausage sandwich and stuffed cabbage.  Drive to the back of the building to find the front door.  The owner is so appreciative of our business and kept saying God Bless You.  Nice to be cared for by this hard working Bosnian entrepreneur.", "name": "Euro Grill", "rating": 5}, {"index": 206, "review": "Tried the Combination plate, Gyro and a Turkish Coffee. Combination plate is the best way to sample their food if you are a first timer. The bread was super soft. Gyro is huge and tasted decent! Had ajvar for the first time and I liked it. Reasonably priced food. Owner was a nice friendly gentleman and helped us by explaining various items on their menu.", "name": "Euro Grill", "rating": 3}, {"index": 207, "review": "What a great little gem in SV! Honest, goodness, hearty food and friendly attentive service. Price is very reasonable by bay area standard. We tried the cabbage rolls, combo plate, and Cockta drink. Cabbage has a tinge of sourness to it like sauerkraut. The meats were good and there were a lot of them on the combo plate. The bread is to die for!!! We didn't care for Cockta. I think it's an acquired taste. \nWe also visited the small market next door. The gentleman running it was very friendly. Got some chocolates from there. Will definitely be back to try other dishes and more chocolates!", "name": "Euro Grill", "rating": 5}, {"index": 208, "review": "The service was great and food was delish! My hubby and I ordered the Gyro with fries, Euro Burger with mushrooms and cheese, and the Nutella Crepe with whipped cream. The portions were HUGE and the dessert was definitely enough for two people to share. Such a cute place! We left very full and happy =).", "name": "Euro Grill", "rating": 5}, {"index": 209, "review": "This is a nice, little restaurant next to the Euro Market.  I love the service here.  The owner is extremely friendly!  I have gone to the Euro Market several times to get fresh-baked bread, pate, European candies and cookies.\n\nThe food here is excellent!  I had the garlic bread appetizer, chicken skewers, and tried the Ćevapi.  I enjoyed it all.\n\nThe server gave us a sample of a marinara-type sauce for dipping (sauce isn't on the menu).  Delicious!!!  Tomatoes were sweet and not too tart.  It was great with the bread.  Chicken skewers were tasty and very moist.  You get 2 large skewers with some veggies, 2 huge slices of lepina bread, sour cream, roasted pepper sauce, and a side.  Great flavors!  Everything goes well together.  Love that bread, baked fresh there.  The Ćevapi is a beef sausage, also very tasty!  You also get the lepina bread and sour cream.  \n\nGreat prices for huge servings!!  I didn't have room for dessert.  I want to try their cheese pie next time and save room for the Tufahija, walnut-stuffed apples with whipped cream.", "name": "Euro Grill", "rating": 5}, {"index": 210, "review": "I'm originally from Balkans, and I say this food was legit and almost the same to food you would get in Croatia/Bosnia/Serbia. I definitely recommend trying sudzukice, cevapi and burek. If you like the food, you can also buy some smoked meat from Balkans in the nearby Euro shop.", "name": "Euro Grill", "rating": 5}, {"index": 211, "review": "Coming in with a few coworkers today, i was a bit skeptically because it was next to a Euro Market (same owners by the way) and assumed food from grocery store would be sub-par, I was very wrong.  \n\nOnce you come in, you smell the sweet smell of bread. I'm like dang smells good enough to go vegetarian for one meal but luckily I didn't have to =)   Once coming in it was pretty crowded so our orders were a bit slow to get to us.  In my party we all got the same meat combo which comes with 5 sausages, 1 oddly shaped meat patty (damn good), 3 piece of chicken, and two long sausages that comes along inside a big bread that could hold a pound of ground meat with sides of euro salsa?, sour cream, and raw onions.   Looking at this dish for 10.99 i'm like dang there's leftovers for dinner. \n\nIf you never had Balkan food, good spot to eat.\n\nOh grab yourself some Cockta", "name": "Euro Grill", "rating": 4}, {"index": 212, "review": "The food is tasty but the service is a little spotty. Make sure you are ask the waiter what's available that day since about 1/3 of the menu wasn't last time I went.\n\nThe food itself is very good though! I had a mediterranean salad and my boyfriend had a falafel, both of which were delicious.\n\nIf you have time, go to the small market they also run next door. It's chock full of European products that are hard to find anywhere else (like German chocolate!)", "name": "Euro Grill", "rating": 3}, {"index": 213, "review": "True there are other better Bosnian restaurants in US but to be fair, there is no other real competitor for Bosnian fare in SF or in the Bay Area because there  just aren't too many former Yugoslavians who are willing to cook.  Anyone who knows the work that goes into making good Bosnian food knows that it is labor intensive and calorie heavy.  A friend of mine (Serbian - btw, my spouse is Bosnian) always tells this story - a Western couple comes to my friend's home for tea, they were offered some cake and tea.  The woman has a couple slices of the cake and cannot get over how good it was.  She asks for the recipe.  He says, \"like all Yugoslavian cuisine, and cakes are no exception, we start with a dozen eggs, a pound of butter, and ...\" The woman's jaw drops and interrupts, \"it's ok, I don't need to know more.\"  \n\nMy point is - if you are looking for hearty large servings of good meaty meals - Euro Grill is the place around SF & Bay Area (or you can make it at home on your own).  If you don't understand the culture behind the cuisine and do not care for it (or looking a for a light fare), this is not the place for you.  Also, most of the dishes served at Euro Grill are traditional snack foods.", "name": "Euro Grill", "rating": 4}, {"index": 214, "review": "Let me be very clear about this.  Euro Grill has GREAT food.  Their gyros are absolutely tasty, even when reheated the next day (a very important factor considering their portions are generous) and the service is generally good.  \n\nI would have no issue giving them 4 or even 5 stars.  HOWEVER, the reason why Euro Grill gets bumped down to a measly 3 stars is because of their inconsistent hours!  Maybe it's just me hopping on the extra large strugglebus, but I can never figure out when they're open!\n\nBefore all you happy campers get all upset at me, LEMME EXPLAIN YO.  Initially when I came here, I loved it!  In fact, I loved it so much that I was determined to share it with my super foodie friend who loves Mediterranean/Greek food.  We have now tried to come here THREE different times and each time, Euro Grill was CLOSED.  I don't understand!  It's so frustrating!  We've come during their supposedly posted \"open\" hours and they just aren't open!  They lie!  Or it's a freaking conspiracy .. haven't decided yet.\n\nNevertheless, I would recommend trying the place.  It's a little difficult to get to and might involve some circling, but do attempt to try it.  And get the gyro.  Their bread is a scrumptious, light, soft masterpiece that makes my mouth water.  Whenever I manage to actually get in the door, that is.", "name": "Euro Grill", "rating": 3}, {"index": 215, "review": "Family owner and well cared. Excellent service and food! I was actually on my way to White Elephant restaurant which is right around a corner but it was closed. Quick search on yelp revealed this place and the place is awesome! Unexpectedly nice West-European place. They have such Russian style food like ,  and \"famous\" in USSR drink , bwa-haha. The guy who served us serving was from Yugoslavia. Would not hesitate to drop by next time I'm around.", "name": "Euro Grill", "rating": 5}, {"index": 216, "review": "I was reluctant to try anything else on the menu, because I was craving cevapi. They were pretty good. Due to the location it seems like they don't get many customers. No complaints. Overall a very good joint", "name": "Euro Grill", "rating": 5}, {"index": 217, "review": "Great burek!!!!!!!  definitely worth a stop.  Don't miss this hidden gem.  \n\nStopped by after reading the yelp reviews and we weren't disappointed.  We ordered two bureks; one meat and one cheese.  They both were great.  We also checked out the market and found some great teas and cookies.  All were very reasonably priced.  \n\nWe plan on making this a more regular destination.", "name": "Euro Grill", "rating": 5}, {"index": 218, "review": "This place might be the most fabulous restaurant on the planet, but I'll never know since it doesn't follow its own posted hours...Yelped it and saw that it was open. Drove there and it was closed. Signs posted on the door say its open. Met a man (the owner, maybe, but he seemed reluctant to 'fess up) who told me they were always closed on Mondays. He even went over to the sign with the hours and pointed to where it was marked open 11am - 2pm and said, \" See? We are closed today.\"  I said, \"so, open 11am - 2pm means closed in your country?\" He goes, \"Yes...\"\n\nCan you say \"ESL fail\"...? lol...\n\nNOTE: He let slip that the place will be changing owners sometime soon...", "name": "Euro Grill", "rating": 2}, {"index": 219, "review": "The service is great. The server is awesome and the food is delicious and not pricey at all!!! Love! Since it's my birthday he gave me and friend's free imported juice", "name": "Euro Grill", "rating": 4}, {"index": 220, "review": "Went here for a late lunch. Verbal assurance from staff that all the meat is Halal.  Had the combo plate that had a little bit of everything. The sausages were very good.  The bread is nice and fluffy and the other kebabs are good too.  Friendly service.  Only downside is they serve alcohol.", "name": "Euro Grill", "rating": 4}, {"index": 221, "review": "I go this place not always but Goulash and of course cevapi are the best bosnian food that I ever tried. Home made bread and great service ;)", "name": "Euro Grill", "rating": 5}, {"index": 222, "review": "This is the only place that I know of where I can get BOSNIAN food. Yes, the food is mainly Bosnian, not Mediterranean or Serbian or whatever else some people might confuse it with. I've been here twice, and have had a pleasant experience each time. The food is good, the prices are great, and the service is excellent! The best item on the menu is the burek with the meat, along with a glass of kefir (thick yogurt), you cannot get a more authentic Bosnian meal! The burek with cheese and with spinach are also good, but don't compare to the one with the beef. The chevapi are just okay, nothing exceptional, which is a bit disappointing. But the lepinja (bread) that the cevapi come on is delicious! The last time I was here, we arrived early, but our server opened up early for us, even though we were the only customers. \n\nThe restaurant is going through some financial troubles, so sometimes some of the items on the menu are not available. Hopefully this little gem stays open because I need a place where I can get some good old fashioned Bosnian food whenever I get homesick!", "name": "Euro Grill", "rating": 5}, {"index": 223, "review": "If you like eastern european food, this is the place. They have great sausages and crepes. The staff is always friendly and nice. Try their Kefir and other european drinks.", "name": "Euro Grill", "rating": 5}, {"index": 224, "review": "This place have authentic Bosnian food. My kids are very picky on food when I first time bring them here they loved food. Highly recommended.", "name": "Euro Grill", "rating": 5}, {"index": 225, "review": "This place is AMAZING!!!!! Hubby and I went here randomly one day, and we are so glad we did. I had the Cevapi and hubby had the Gyro. Both are fresh and delicious, and especially the bread they come with.  The quality far exceeds the prices- worth every penny!!!", "name": "Euro Grill", "rating": 5}, {"index": 226, "review": "The aroma instantly makes you want to order some food. My friends and I came in last Saturday before the San Jose Earthquakes game and it looks like this will be our usual spot before the games.\n\nI ordered a large quantity of the Cevapi. Most restaurants do fine jobs a making food, but this place reminds me of my own mothers cooking... it was the best! Also had some Jupi which was my favorite as a kid. \n\nFast friendly service and the food is just excellent. Highly recommend this spot for food fanatics.", "name": "Euro Grill", "rating": 5}, {"index": 227, "review": "Ok so my brother, his girlfriend and I stopped by for lunch and i have to say i knew it was not going to be a good experience right out the gate because the place was empty and it took a while for someone to even notice we were there. menu looked decent but a little pricey. the food took FOREVER to come out and when we got it we were less than unimpressed.\n\nMy brother's caesar salad was not tossed and the chicken seemed to be that precooked chicken you get in a bag. His GF got a creamy chicken crepe which for lack of a better word..SUCKED. My gyro tasted great but i could not pick it up without all the dressing coming out the side. i had to eat it with a knife and fork. i wanted to give it 2 stars but this seemed more appropriate. Oh yeah when we asked for water and he brang us 2 bottled waters with 2 straws that didn't rise above the lip of the bottle which we thought was funny. we paid we tipped him $5 on $31 but we will not be back anytime soon.....EVER.", "name": "Euro Grill", "rating": 1}, {"index": 228, "review": "The food was awesome. I had the goulash, which reminds me of a similar family recipe my dad always makes(but with pasta instead of a stew). Also had it with some bread on the side. It's a small place in a random area that I had never seen before, but I'm glad I gave it a try become sometimes the quiet underrated restaurants are the best place to eat. The older european gentleman(who I believe was the owner) was so welcoming, and friendly. Probably one of the nicest humble restaurant owners I've ever met.", "name": "Euro Grill", "rating": 4}, {"index": 229, "review": "The Cevapi (Bosnian meat-ball) and Goulash have amazing taste.  As desert, Nutella crepe is really good.. I am repeat customer :)", "name": "Euro Grill", "rating": 5}, {"index": 230, "review": "I came here for lunch with a coworker.  I had the Sarma -- cabbage rolls stuffed with ground feed and rice, served with two large potato halves.  They provide some warm bread while you wait for your food, which is nice.  The potatoes were roasted and peeled, so it's sort of a \"make your own mashed potatoes\" sort of thing -- pretty cool.  The rolls had some kind of pastrami-like stuff on top.  It was just the right amount of saltiness to add to the dish.  The meal was $8.99; pretty good value for the amount of food you get.\n\nThere appear to be a lot of other good dishes on the menu; I'll be back to try more.", "name": "Euro Grill", "rating": 4}, {"index": 231, "review": "The gulas and sarma are back!! I first discovered this place many eons ago in the Balkan forest of Santa Clara. It has fed me and my family for centuries. The people within the restaurant are extemely nice and the food is great. I want to give a big shout out to Sead, Mirza and Ramiz for their amazing service. Hvala Vam puno!! Jedemo!!!", "name": "Euro Grill", "rating": 5}, {"index": 232, "review": "Love the friendly owners and the homemade meal.  Comfort food at a great price, served with a smile :)", "name": "Euro Grill", "rating": 4}, {"index": 233, "review": "My Serbian friend brought me here..all I can say is THANK YOU!! I have been back many times and love everthing I have tried..great staff and even better food! The euro burger is wow!! Try it you will not be disappointed.", "name": "Euro Grill", "rating": 5}, {"index": 234, "review": "Disappointing.  Saw all the good reviews, and thought I'd try it. This was one of the few times yelp steered me wrong.\n\nAwful service. Cigarette smoke wafts during your meal, the lighting is bad (and for me to notice, it has to be really really bad) and the food is... bland and heavy.", "name": "Euro Grill", "rating": 2}, {"index": 235, "review": "The combo plate here rocks, especially if you're a carnivore. Five evapi, two sudukice and one skewer served in a lepina, with onions and roaster pepper sauce. I think the owner was excited that I ordered that and threw in a Pljeskavica  to boot. It was carne overload. The important thing however was that all the meat was perfectly cooked and excellently seasoned. Definitely a Yelp success story and a great find.", "name": "Euro Grill", "rating": 5}, {"index": 236, "review": "Holy Smokes this place is heavy on the meat dishes. Wow totally came away with food coma. Never had Eastern European food before. I must say the dishes were tasty.\nService was a slow and so was the food arrival. My husband may go back but for me it was just ok.", "name": "Euro Grill", "rating": 3}, {"index": 237, "review": "If you don't know the exact location, it can be very easy to miss the place. In my case, I drove past it and had to drive around a couple of blocks before finding it. However, once you find it, you find that there's a parking lot and also street parking if necessary.\n\nOnce you enter the restaurant, there are a bunch of glass tables with menus on top of the table. While browsing the menu, there's European music blasting in the background. The owner of the place does a great job describing all of the dishes and even helping us pronounce the difficult names. It turns out that he's Bosnian, which was helpful in determining which part of Europe that \"Euro Grill\" stands for.\n\nUpon the owners suggestion, I ordered the Combination - Mjeano Meso. Holy crap, it was a whole bunch of food. When receiving the plate, it looks like one huge torta. In a hybrid of garlic bread and french bread, the bread used is buttery and soft. The two different types of sausage varied in flavors, size, and texture. The chicken breast meat was surprisingly tender and juicy. As me and my friend were eating, the owner constantly came by to check up on us and described all the different things going on.\n\nThe service here is what gives this place the fifth star. Besides the excellent service mentioned above, he also opened the door for us as we left and also described how he also owned the Euro Market a few doors down. Overall, I really felt like I was in a European country. Different food, and somewhat having a hard time understanding what the owner was telling us. Good ol' language barrier. I love it!", "name": "Euro Grill", "rating": 5}, {"index": 238, "review": "I'm always on the lookout for a good gyros place.  This place is it! Cevapi, burek and the meat platter are my favorites.  Prices are incredible for what you get.  I come here at least once a week for a work lunch.  My coworkers are hooked  now.", "name": "Euro Grill", "rating": 5}, {"index": 239, "review": "Euro's customer service can be sketchy, but the food is great. They make their bread fresh, and it's always hot. I love the euroburger and goulash. Their crepe dessert is amazing.", "name": "Euro Grill", "rating": 4}, {"index": 240, "review": "Hello! I'm so happy i found this place. I'm Croatian and i know how much i miss the food from bosnia. Delish, i didn't even know that this place exist my hair styles told me about it. They have the restaurant and the market. So if you have kids go to the restaurant first because in the market there is a loot of chocolate. Soooo regarding the food its amazing we got ćevapi, gyro,  cold platter, garlic bread and of course palacinke with Nuttela and pomegranate and after a lot of years i had cockta. The bread was fresh, the meat was juicey and palacinke were amazing. Overall i was very satisfied.  I had my big order of ćevapi, half of the cold platter and palacinke with nutella and a soda only me yumm yumm yummm. They were ouy of burek but when we went to the market near door they did had it fresh and frozen, they also had frozen ćevapi and fresh bread and other stuff from ex Yugoslavia.  Sooo if you want to go there just go you wi left very full and happy.", "name": "Euro Grill", "rating": 5}, {"index": 241, "review": "The owner was very nice and attentive. The food itself was also pretty flavorful but I am giving this place a one star because they served me microwaved left over food from the night before (I am pretty sure). To the owner, if you are reading this, don't ever serve food from the night before, it's a dick move, you will drag your restaurant down the drain.", "name": "Euro Grill", "rating": 1}, {"index": 242, "review": "A lot of ethnic restaurants make feeble attempts to transport you to their country of origin. Exhibit A: sticking a sombrero on the wall and playing mariachi music. However Euro Grill is different. Once you step in inside you really do feel like you have left Silicon Valley and are now in some backwater town in Eastern Europe. How did they accomplish this feat? Maybe it was the music, maybe it was the musty smell in the air, maybe it was because we had difficulty understanding out waiters English, or maybe it was because the placed seemed like a front for the Russian Mafia given how empty it was. \n\nThe above paragraph may sound like a critique but the truth is I really enjoyed the novel experience. For those of us who have traveled to countries where we don't speak the language coming here is a very nostalgic experience and part of Euro Grill's charm.\n\nAfter we sat down our waiter came by and basically gave us a run down of the menu which was much appreciated given that Bosnian cuisine is something most Americans are not familiar with, myself included.\n\nI ordered the mini portion of Cevapi which is basically a Bosnian sausage sandwich. It came with a side of what I believe was sour cream, some mysterious red sauce, and diced onions. The bread was truly amazing. In all honesty I think it outshone the sausages that were nestled in. It was totally unlike any other bread I have eaten. Dipping it in the sour cream and that delicious but subtle red sauce really made my day. \n\nThe service at this place was truly spectacular. Our server checked in on us frequently. Asking us how we liked the food, if we needed more condiments, and even if we wanted the temperature adjusted. Wow! Of course it also helped that for the most part we were the only people there.\n\nIn closing, if your looking for a culinary adventure make the trek to Santa Clara and check out this tucked away gem.", "name": "Euro Grill", "rating": 4}, {"index": 243, "review": "Delicious Food and great service. The restaurant is clean, new, and comfortable. Originally looking for Eastern European food and found this place using yelp, and very happy that I did. Mostly Bosnian influenced cuisine, but with other eastern european influences. Seems very authentic.\n\nReasonable prices: Dinner entrees mostly in the $7.99-10.99 range. Ordered the Combination- Mjeano Meso : includes the evapi (lamb+beef sausages),Sudukice ( spicy sausage) , and a chicken kebob on the Lepina bread. \n\nThe Lepina bread was exceptional - its a large round roll that is airy and light in the middle. Delicious! The anjvar sauce( red pepper sauce-not spicy) is so good. The sausages have a good well-rounded flavor. The chicken kebob was ok, similar to what you'll find elsewhere. \n\nCall ahead to check on hours, they close either at 7pm or 8pm depending on the season....", "name": "Euro Grill", "rating": 5}, {"index": 244, "review": "Great traditional Bosnian food served by a friendly older Bosnian gentleman.  Very clean restaurant and excellent service.  We had the \"beef patty burger\" and the \"sausage burger\" -- those weren't the actual names, but instead more of a description, and they were very tasty.  Go with those items if you have a large appetite, each dish is pretty sizeable.  I would definitely bring my hungry family by this place if they're in town.", "name": "Euro Grill", "rating": 5}, {"index": 245, "review": "Good eats to be had here!  One of my coworkers suggested \"Bosnian food\" for lunch, so I figured why not.  I'm always up for something new.  \n\nFirst off, you will never just stumble on to this place.  Use a map to find it.  It's not hard to find, just in a kind of unexpected location.  The parking lot is pretty small, so you might need to park on the street.  \n\nI went with their Cevapi, which looks something like a large focaccia roll sliced down the middle and filled with small ground beef kabab meat.  It comes with diced onion, sour cream and an orange tomato based sauce that is slightly spicy.  For being such a simple looking dish, it was really good.  If you're a fan of sikh kababs or other types of ground meat kababs, you're sure to enjoy this dish.  Wash it down with a Cockta (made from rose hips) cola and you're going to be full.  Just to make sure we had the full experience, we also ordered the Palainka, which are similar to crepes, but filled with various types of marmalade and topped with whipped cream and chocolate sauce.  Today, the marmalade was plum, and it was excellent!\n\nI think one of the great things about the food here is that it is definitely different from your typical American or European fare, but it is familiar enough that it isn't scary for even the pickiest eater.  I would definitely recommend this place for anyone with kids or if you're just generally not up for trying many new foods.  type their address into your navi system and get over to Euro Grill to try them out. Good cheap eats that won't leave you wanting to snack an hour later.", "name": "Euro Grill", "rating": 4}, {"index": 246, "review": "Fantastic food. Our party of four had the gyro, the stuffed cabbage, and a sausage dish (forgive my lack of Serbo-Croatian on the name!)\n\nThe food was absolutely delicious. Every dish was fantastic. \n\nYes, it's greasy -- especially the sausage. But I guess that's just true to its roots. The bread was absolutely fantastic, and was definitely made-that-day fresh. After our meal, we went next door to the market and bought all of the bread they had in stock!\n\nThe service, while super friendly, was not fantastic. It was the weekend lunch rush. The restaurant filled up right after we came in, and the kitchen was definitely slow getting food out and then getting us our check. \n\nBut other than that, it was a fantastic visit. Every member of our party will be back!", "name": "Euro Grill", "rating": 4}, {"index": 247, "review": "I visited this place 4-5 times. I would go more often if it would not be that far from my work. The place is clean and the owner is very friendly. \n\nSo far, I've tried Cevapi (everyone's favorite), euroburger, and apple deserts. All was great. One time we had a small meeting which happened to be attended around 25 people. They gave free borek to each of us which was great.", "name": "Euro Grill", "rating": 5}, {"index": 248, "review": "As soon as we landed in San Jose we were starving! Yelp lead me here and I'm so glad we came! The food is AWSOME!! The place is small, quiet and cozy!!! Please come and eat!!!!", "name": "Euro Grill", "rating": 5}, {"index": 249, "review": "The food is absolutely delicious. The employees are very friendly and the prices are low. Good bang for the buck!", "name": "Euro Grill", "rating": 5}, {"index": 250, "review": "The pictures of this place are accurate, it's a tiny little place. NOTHING on their main entree menu is veggie friendly. Well they had one thing POSSIBLY but he said they don't make that today (Tues). So for lunch I had the medit salad and it was eh. I mean it's fresh, but it's was just a bunched of chopped cucumbers, tomatoes w/ a tiny bit of onion, alot of feta cheese, some pimiento olives, and I also added an order of fries to my lunch. I'm not a salad chick. I like reaI food even if I'm a vegetarian. I really wanted to try their apple stuffed walnut but they said they only serve that Wed-Fri. Eh, wouldn't come back, but the food is ok and service is very friendly. The server (& possibly owner) was very attentive and we got free Croatian chocolate at the end of our meal.", "name": "Euro Grill", "rating": 3}, {"index": 251, "review": "I had the Slovakia sausage sandwich and roasted vegtables, it was good. Seems like a small family run restaurant. Hard to find and GPS map location was wrong.", "name": "Euro Grill", "rating": 4}, {"index": 252, "review": "Quant little spot that is warm and inviting. The gyro was fantastic and they have great deserts.  The servise is friendly and attentive although a little... different in formalities.", "name": "Euro Grill", "rating": 5}, {"index": 253, "review": "Balkan food just does not taste much better than here. Mixed grill is absolutely incredible. Plates are huge and prices are from the 90's. They dip that home-made bread into some kind of sauce and it is addictive. The best Balkan cuisine  on this side of the Pond. Be prepared for a little longer wait because everything is made to order.", "name": "Euro Grill", "rating": 5}, {"index": 254, "review": "Came for the first time yesterday.  I had the chicken crepes and my friend had the meat pastry pocket.  We are both now a fan of the food.  I will definitely be coming back.  The place is small and clean.  It does not have air conditioning, so I could see it getting hot in the summer.", "name": "Euro Grill", "rating": 4}, {"index": 255, "review": "First we went to the Euro Market next door and the cashier, who I could barely understand, asked if we were going to the restaurant. Turned out, he would be our waiter too! We had a hard time understanding him but it made the experience more fun.\n\nWe first ordered the meat pie which is like ground beef? maybe lamb? encased in a flakey crossaint like pastry. For under 5 dollars, it was HUGE. It was almost a foot long and 4 inches wide.Quite delicious and great for left overs.\n\nWe also got the Sarma which meat and rice rolled in cabbage served with sour cream. Pretty tasty, not something I would I crave bc its not within my pallet, but still delicious and quite authentic tasting.\n\nLast but not least, we had the sevapi? We only got the half order so it was like one huge sandwich. The sausages were ohhh soooo gooooodd.  I smothered it with the roasted bell pepper spread and a touch of sour cream and it was like music in my mouth.\n\nWould definitely come back but on a Friday so I can try the goulash (they prep it for several days and the only guarantee you can get it is on Fridays).", "name": "Euro Grill", "rating": 4}, {"index": 256, "review": "A warm welcome,  great portions, meat and more meaty goodness, finger licking dessert and generous and hospitable hosts - What's not to love? \n\nTry the Ćevapi which is tons of grilled sausages with home baked bread and a yummy red pepper relish. The chicken skewers are also nicely charred but moist and served up with more fluffy bread and spread. \n\nMore here: Breaking Bosnian (bread)\nhttp://inthemoodforhalal.wordpress.com/2013/11/06/breaking-bosnian/#more-159", "name": "Euro Grill", "rating": 5}, {"index": 257, "review": "I usually go to this place every couple weeks. The selection isn't huge and sometimes they are missing items on the menu, but the food is great and the price is right. I love the goulash, the sausages (both standard and spicy), and the fresh baked bread is great, too. Plus, if you like European chocolate, they have a little market next door with a good selection of European goods. Finally, the owners are so nice and friendly -- they often give me a little bit of chocolate from their store!", "name": "Euro Grill", "rating": 5}, {"index": 258, "review": "I have been there twice now, once for lunch with a friend, and once with a large group of family which included a 4 year old and a very picky teen and retiree.  Everyone found something to their liking and was satisfied, taking home left overs.  The house made bread is nicely chewy and hot, and hard to resist for the carb watchers.  My mother loved the stuffed cabbage and the rice with sour cream on it, and my picky father was pleased with the lamb goulash.  We also had (and liked) the combo plate and the chicken skewers and salad.  My son also liked the garlic bread and wanted a second order.  We also got the gratis nutella crepe dessert, which was wonderful.  My son informed me \"We WILL be back, Mother!\"  High praise from a sullen teen...", "name": "Euro Grill", "rating": 4}, {"index": 259, "review": "This place is fantastic.  The food is amazing, the staff is friendly, and the service is spectacular.  When I lived in the San Jose area, I would come to this restaurant all the time.  I would highly recommend it to anyone who comes - especially if they order the goulash!", "name": "Euro Grill", "rating": 5}, {"index": 260, "review": "Okay, this place has FABULOUS gyros. The meat was fresh, juicy- not like some gyros where they let it roast too long and it gets dry. It was awesome. The sausage sandwich (dont remember names) was really good too and you can get a half if you aren't too hungry. The fresh baked bread is to die for. The salads were super fresh too. Only downside is it was SO slow the day we went. Not sure if it was an off day, but the owner (assuming) was the only one on the floor working doing EVERYTHING- seating, orders, running food, bussing... I dont think there were many cooks in the kitchen either. Like I said, not sure it was an off day, but it took 15 to get seated, another 10 to get our order taken, and then about 15 to get our food. Only reason Im not giving 5 stars, but for laid-back balkan food this was great. Also prices are SO reasonable.", "name": "Euro Grill", "rating": 4}, {"index": 261, "review": "March 1, 2012,\nEuro Grill was so greasy and very heavy food and turkish coffee tasted and smelled like mold. I also went into the Euro market next door and the stuff in there was old and some outdated.  I would not recommend.  they say they make everything there fresh not true the burek was decent but you could tell it was not fresh (the bread gave it away it) we also tried the variety plate with different sausages and veggies very oily.  Needless to say I will never go back.", "name": "Euro Grill", "rating": 1}, {"index": 262, "review": "Simple pretty cheap food. Kind of a one man operation and can be a bit slow at times but everything is pretty fresh and clean. Tastes great. So far I have had the mediterranean salad, chicken crepe, fries and gyro. Very good value for the money. Only complain would be at times its a bit slow service due to one person being the only real presence. Great find though", "name": "Euro Grill", "rating": 4}, {"index": 263, "review": "I went here to eat chicken crepe. The only chicken dish they had was skewers. We ordered those. The wait time was more than 30 min. Might not go to this place next time. Extremely sloppy service.", "name": "Euro Grill", "rating": 1}, {"index": 264, "review": "lots lots of food.l Huge portions.. I ordered a gyro burger and a gyro for me and my other half. I honestly could have just bought the burger it was big enough to feed 4 people.. seriously! the burger was good i enjoyed it although the gyro was a bit oily. i had to wipe the grease from my lips from the bread they used. i prob wont go back since i have had better else where but it was ok. the place seemed cleaned and the people were nice.", "name": "Euro Grill", "rating": 3}, {"index": 265, "review": "Love this place... My friends have been telling me about food here and I finally had it yesterday and sure enough; it was great.  Cevapi were great and service is good! I would recommend this place to anybody and its fairly priced!", "name": "Euro Grill", "rating": 5}, {"index": 266, "review": "This is an excellent restaurant for Eastern European, Balkan, Romanian cuisine. I had the Cevapi (mici, or mitiei in Romanian) and they were excellent. The Sarma (sarmale or ardei umpluti in Romanian) were on the house, The Goulash was excellent. Platters of mashed potatoes, pickled vegetables salad, and grilled bread were wonderful. Generous portions, and very reasonable prices. \n\nNext time I have a craving for mititei I know were to go. The staff was very amenable to serve it a-la-carte, homestyle, for us to share and sample everything. We completed the meal with some crepes (clatite in Romanian) for desert. Highly recommended.", "name": "Euro Grill", "rating": 5}, {"index": 267, "review": "Place was hard to find, they didn't have ingredients for several items on the menu, unfortunately for me the two top thing I was hoping to order  (goulash or stuffed cabbage) we're not available. Ordered the sausage on their home made bread. Sausage was bland and greasy... Bread was very good, which is why I am rating this place 2stars. Bread alone rates much higher.", "name": "Euro Grill", "rating": 2}, {"index": 268, "review": "This place was so AWESOME! So glad we stopped on our way home. We were greated with open arms and reminded me of growing up in old Yugoslavia! This will always be our last stop on our way home. Great food, service, and great people.", "name": "Euro Grill", "rating": 5}, {"index": 269, "review": "Service was excellent. My wife and I arrived around 12:00 on a Sunday and were greeted by a gentlemen who told  us we could sit where ever we wanted but recommended us to his favorite spot in the restaurant.  After being seated the waiter went to the kitchen and then returned with a pastry he suggested we try.  My wife and I both sampled the pastry which was delicious.  We were given this sample free of charge and it was a good size portion.  For lunch we each had the gyros and fries both of which were amazing.  The gyro was enormous and came on a homemade bread that was a welcome change to your typical pita bread.  The fries here were also great, perfectly golden and crispy.\n\nI enjoyed the atmosphere of the restaurant as well.  It was small and intimate but not crowded or cluttered. \n\nI will return here to try other items on their menu.", "name": "Euro Grill", "rating": 5}, {"index": 270, "review": "Had lunch here today for the first time and look forward to coming back. I had the gyro, wife had the spicy sausage sandwich. Both came on delicious home made bread, a welcome change to the usual pita. The gyro was excellent, seasoned to perfection. The sausage sandwich had a little kick, but not super hot. It was served with a red pepper spread and a dollop of sour cream. We were both happily stuffed. Highly recommended.", "name": "Euro Grill", "rating": 5}, {"index": 271, "review": "I went here with some friends. The place is pretty nice, we liked the music and the feel of it. The guy that took our orders was pretty funny too, but he had trouble explaining what the food was. I had the combination dish and it was awesome and filling, I am pretty sure he told me that he was going to give me extra. Everyone else was very pleased with the food.", "name": "Euro Grill", "rating": 5}, {"index": 272, "review": "I was watching drive ins, diners and dives and they they visited a bosnian place in TX and the food looked really good so I wanted to find a place to try this type of cuisine.  A bosnian friend recommended this place so I checked it out.  I've been there twice and had a good experience both times.  Both times I had the Cevapi, it's kind of like a burger and really good.  Instead of a meat patty they use sausages and the bread used for the bun is unique, it's freshly made there.  It's served with a tomato sauce and sour cream.  What I liked was all the ingredients were very familiar but tasted slightly different.  I was told by some other people dining there that Cevapi is very popular in all the balkan countries.  They also said to try the Sarma, cabbage stuffed with meat.  Service is a bit slow so don't go there when you are in a hurry.  It's a great chance to try something new.", "name": "Euro Grill", "rating": 4}, {"index": 273, "review": "The friendly owners of Euro Market (http://www.yelp.com/biz/euro-market-santa-clara / www.euromarketsantaclara.com) have added an adjoining restaurant as promised.  The interior is very chic and the food is delicious and authentic.", "name": "Euro Grill", "rating": 5}, {"index": 274, "review": "You want meat?  They got meat.  Very, very tasty.  Nice little place.  Good service.  Tasty food.", "name": "Euro Grill", "rating": 4}, {"index": 275, "review": "Amazing Serbian food. One stop place if you are really hungry.", "name": "Euro Grill", "rating": 5}, {"index": 276, "review": "After coming back from a trip through Croatia, Bosnia, and Serbia, I can say that this restaurant definitely helped me ease back into life in America. The pljeskavica is really tasty and the cevapi is very nice as well- though it tastes a bit different from what I had back in the Balkans. I don't know what bread they used, it doesn't taste quite like Somun, but it was still really good. Sarma was tasty, recommended for a non-adventurous eater.. can't go wrong with a cabbage roll. Prices are good and very happy to find that they indeed serve Tufahija. Burek is perfect and not too greasy. Try a Cockta with your meal for a nice Balkan soda. Only thing missing is that they don't have kajmak and used sour cream instead. Otherwise, great restaurant, very nice staff, and good prices. Highly recommended. Also, check out the grocery market next door for some Balkan goodies and foods.. Milka bars, Cedevita, Vegeta.. just to name a few.", "name": "Euro Grill", "rating": 5}, {"index": 277, "review": "I'm not going to repeat others' accolades - but this place is totally worth trying out. I'll go back after that wonderful gyro today!", "name": "Euro Grill", "rating": 4}, {"index": 278, "review": "Affordable, filling and delicious!! Tried the goulash with rice and came with a side of sour cream. The goulash had meats and veggies in a light tomato sauce. I couldn't stop eating it. Had the whole thing and was stuffed. Unfortunately I would never have found this place on my own. Its not very noticeable and the parking lot is in the back. We literally drove right passed it while looking for it and totally missed it. The bread was homemade and fresh. Though it is a tiny restaurant. Also tried their sausage and it was just ok for me. Thought it tasted a bit greasy.", "name": "Euro Grill", "rating": 4}, {"index": 279, "review": "Euro Grill owner must be one of the friendliest owners I have ever met. Place is small but nice. Food is excellent and if you're up for a Mediterranean adveture you should definitely try it. The deli next door has a good selection of European foods, including two of my favorites: Milka chocolate and Delicje cookies.", "name": "Euro Grill", "rating": 5}, {"index": 280, "review": "My friend and I recently ate lunch at Euro Grill.  We wanted to try it as it had recently opened.  The owner couldn't have been more friendly and helpful in explaining the menu items.  The food was excellent! And more than filling!  Prices are extremely reasonable  and the service was good (thought there weren't many other customers).  It is a very small restaurant, entered from the parking lot.  I would like  to see a little more variety on the menu but the sausages are so good that I guess it doesn't matter as I would probably order them anyway!", "name": "Euro Grill", "rating": 4}]