[{"index": 0, "review": "This is the more or less japantown edition of the wienerschnitzel fast food chain. \n\nThey have their own smallish not very well paved parking lot which seems to be more then sufficient for the business.\n\nThere is no drive thru or inside seating so this is totally a eat it and beat it kinda joint. There is outside seating both shaded and unshaded concrete picnic table thingys, which is not at all a bad choice if the weather is good. The menu is burgers, a variety of hot dog choices including something vaguely like polish and Chicago style, and fried chicken sandwiches (also known as schnitzel-hence the name). Soda fountain drinks, shakes and soft serve ice creams. I actually like the burgers-I think they are better then mcd's or the king of the burgers. The fried chicken sandwiches are decent if you don't get the god awful barbecue sauce, and the hot dogs are okay. Especially the chili and Chicago dogs. Note that the Chicago dogs are more like Chicago style dogs as opposed to the souped up righteousness that is a true Chicago dog, but for the price they are good enough. \n\nSo since there is no inside seating, typical three star fast food options and a crappy parking lot, why the four stars you say? \n\nWell, this place puts the fast into fast food. The only possible way to get it quicker would be to have it ready before you order. They're working on that I'm sure. Also yeah, it's greasy fast food,  but for five bucks or so I can get a sandwich, chili fries, a hot dog (with chili. 'Cause that's how I roll.) and a drink. \n\nWhen I gots the hunger all that adds up to awesome.", "name": "Wienerschnitzel", "rating": 4}, {"index": 1, "review": "Their soft serve is soooo good but damn,  does it make you have a soft serve from your arse.  Like,  wake me up at 5am cause my toilet is going to have a field day! \nHaven't tried anything else from them but the service was fast and friendly.", "name": "Wienerschnitzel", "rating": 3}, {"index": 2, "review": "Unsatisfied with my burger across the way, and still slightly hungry I made my way over here. When was the last time I had a corn dog and curly fries together? high school. So that's what I got but I made it the mini corn dogs. Straight out of the fryer that shit is delicious. Took me straight back to the days with no real responsibility and easier times. Food memories are quite powerful arent they?", "name": "Wienerschnitzel", "rating": 4}, {"index": 3, "review": "Please know this is not a fancy restaurant.  Its a place to fulfill your quick fix hotdog cravings.  I have been a fan of this place since I was in college back in Texas.  Its fast food, but with quality.  Again, its personal preference that makes me give this place a 4.", "name": "Wienerschnitzel", "rating": 4}, {"index": 4, "review": "I had received some coupons in the mail for this place, and had driven passed it. I've never heard of the place, coming from the west coast, and the coupon wasn't bad - $3.99 for a chili dog, chili burger, and chili fries. Didn't have dinner plans, wanted to be cheap, get to try something new.\n\nNo drive thru at this place, so park and walk right up. There are a few tables if you want to eat, but might be discouraged when you see the far greater crowd at Fosters.\n\nI got my combo, and then because I'm a sucker for corn dogs, got the mini corn dog pack. Still, a lot of food for less than $7.\n\nBasically, it reminded me a lot of Checkers, or I guess they may be Rallys out here. The food was ok. Wasn't blow away by any of it, but it was tasty enough and filling. With it right down the road, and open til midnight, I could see grabbing some stuff from here on a lazy weekend, and if you have a family the $9.99 family deals are really good for small families or even friends grabbing some food - some get you three chili dogs, three chili burgers and three chili fries, which isn't bad at all. \n\nJust make sure you factor in the chili - have napkins and eat over the plate.", "name": "Wienerschnitzel", "rating": 3}, {"index": 5, "review": "this review is strictly for the jalapeno poppers... 5/5! out of this world my favorite!", "name": "Wienerschnitzel", "rating": 5}, {"index": 6, "review": "Listen. Listen. \n\n\nI need you to understand the lengths I went to find this place. It's like a trip down memory lane, lined with chili cheese. 5 miles doesn't seem like a lot, but when you're HANGRY, every millimeter counts. \n\nBless you, Wieberschitzel for being actual fast food when I needed you. I've never liked your outdoor seating, but cain't no cold wind blow hard enough to keep from from scarfing your food down in front of everyone on the corner of Fourth and Taylor. \n\nAnother plus (besides all the chili cheese options), the bathroom is clean. I see you DW, stand up!\n\nIf you like it, then throw some chili cheese on it.", "name": "Wienerschnitzel", "rating": 4}, {"index": 7, "review": "No complaints here! \n\nThis location is close to my work so once in a while ill treat myself. They serve pretty quick so It doesn't take too much of my lunchtime.\n\nOnce my co-worker and I called in our milkshake order since we only had 15 for our break. The lady was cool she took the order over the phone we arrived and she had them ready in the fridge to keep from melting. We got back to work with plenty of breaktime left.", "name": "Wienerschnitzel", "rating": 5}, {"index": 8, "review": "Yo Doggy I was craving Hot Dogs tonight . So I stopped here I ordered Chili Cheese Fries,Mini Corn dogs and 2 Angus Beef Chicago Dogs. The Counter Girl was a Cute Latina so that's a plus and she got my order right . This location seems to be pretty busy. I got my Grub 10 minutes later. And Hot Diggitty Dog it was good it definitely hit the spot as I'm heading into another lost and productive weekend. Got to make some Freedom Paper to pay Uncle Sammy.", "name": "Wienerschnitzel", "rating": 3}, {"index": 9, "review": "Ohhh Weinerschnizel....let me sing your praises. Chili cheese fries, corn dogs, chili cheese dogs, ice cold fizzy drinks. All for a couple bucks and you can eat outside and enjoy the sunshine. Der W is a California classic!", "name": "Wienerschnitzel", "rating": 5}, {"index": 10, "review": "OMG! Drop corn dogs on the floor and try to serve it?  Your gonna get folks sick serving such a NASTY TREAT.\n\nI watched in silent disbelief as I watched the gal drop and pick the frozen corn dogs off the dirty floor, toss it in the fryer, wait for it to cook and then toss it in a bag to hand to me oblivious to the fact that I had witnessed the bad deed.\n\nI declined it and said loud enough for the person next to me to hear (he was also getting a corn dog) that there is no way I can consciously feed my child food that was picked up off their dirty floor and that I would like a refund.  \n\nNo comment or eye contact but the register was opened and I was given my money back.  \n\nI know stuff like this happens all the time, I just wish that folks in the food industry would realize the cost of food is nothing compared to the cost of making someone really sick!", "name": "Wienerschnitzel", "rating": 1}, {"index": 11, "review": "Love this place!\n\nBut today when I went, I noticed 2 things were missing from my order, so I went back & gave the lady my reciept & told her what I was missing, but rudely one of the ladies who was working in the back making the food said she had already gave me one of the items out of the 2 that were missing. The cashier asked me again if I got the item I was missing or not & I told her no but the lady try to say she did gave it to me making it seem like I was lying. I work in the fast food business too & I know how people try to pull that \"I didn't get the right meal or I'm missing something\" just to get free food but I would never do that to someone. But then the manager stepped in & he apologized & told the rude lady to make me another one & he was very apologetic & he even offered me a free sundae. But the whole time, the lady kept giving me dirty looks & was talking about me to her other coworkers. I felt like she was very rude & unprofessional & it made me feel uncomfortable in a way. If it wasn't for the nice gesture of the manager, I would not be going back to that location again!", "name": "Wienerschnitzel", "rating": 2}, {"index": 12, "review": "My family ALWAYS comes to this Wienerschnitzel, ALWAYS! Today was a completely awful experience for us. We had coupons which we knew were expired but asked the cashier if she will let us use them. She said no to two of the coupons but yes to one of them which happens to be a buy one, get one free deal. When we were finally ready to order, a different cashier helped us which happened to be the manager. \n\nThis manager was VERY UNPROFESSIONAL and told us the coupon was expired and cannot be honored. We explained that the other cashier said it was OK to use. So this \"manager\" proceeds by telling us that she doesn't care what the other person said 'cause she's the manager and what she says goes. We disagreed with her and asked this manager to confirm with her employee what she had told us. The other employee said that she told us the BOGO coupon CAN be used by us. After that, she still didn't allow us to order with the darn coupon and accused us of trying to pull a \"fast one\" on her. IGNORANT. Ugh, I can't believe this person. \n\nWe left without ordering anything and decided to go to McDonald's instead. I know this was just a REALLY BAD experience today and I can't say for sure that we will never come back here ('cause it's the closest one to our house) and is safe to come here even late at night. But OMG, the nerve of this manager. \n\nHey Ms. Manager, you need serious customer service training!", "name": "Wienerschnitzel", "rating": 1}, {"index": 13, "review": "I've been coming to this place for over 10 years, ever since I went to the middle school down the street. The food is good and the wait time isn't that long. Over the years I've noticed the menu change and look nicer. The only thing I'm disappointed in are the portions they give now. I always got chili cheese fries and the container was always stuffed. Now I get about half of the container. I still come to this place because it's good.", "name": "Wienerschnitzel", "rating": 4}, {"index": 14, "review": "Cheap hot dogs and chili dogs. I love their chili fries, especially when you buy em with a coupon. Staff is friendly, and you get some characters that go there.", "name": "Wienerschnitzel", "rating": 3}, {"index": 15, "review": "Cheap. Easy. Available till late night. Bad for you. Sounds like a \"late night phone sex ad\" doesn't it? lol\n\nBut no, this is Wienerschnitzel! Home of the shit your pants combo! (Chili Cheeseburger, Chili Cheese Dog, & Chili Cheese Fries! I can hear my gastronomic problems now!) This bad boy is available sometimes for only $3.33, yes folks, that's right,  you can simultaneously raise cholesterol, eat unknown mystery meat, give yourself stomach problems, AND save money all at the same time!\n\nThis location has plenty of parking and is right next door to Jack's Bar so easy drunken munchie access because they are open till 12am!! \nThe seating is strictly outdoor so not a good place during bad weather. The menu is always cheap, so get the $0.79 corn dog just for sh!ts & giggles!! DO IT! The chili is bean less all meat and pretty tasty for cheap stuff and the chili cheese fries are something you comeback for! I always get their all beef chili cheese dog combo and upgrade to chili cheese fries for maximum gluttony! =)", "name": "Wienerschnitzel", "rating": 3}, {"index": 16, "review": "I was there this morning to have some food. Before I get any food I request key for restroom. Of course I mention them, I'm gonna have some order after using restroom. The one lady said someone is there I have no key. So I wait 20 min and no one came out from restroom. I went back to ask for again. Same replied. So I knock the restroom to see somebody is there. No reply! Again I went to requested for key or to check the restroom may be somebody is there but they refuse my request. Then there were two lady start talking in Spanish. Which I don't understand. I notice they don't want to provide restroom to their customer. So I was mad and left this place without any service. Won't go back to this place again.", "name": "Wienerschnitzel", "rating": 1}, {"index": 17, "review": "their service and prices are okay, just their hotdogs, chili, burgers and all things related are just horrid. Way to go California to somehow have a iconic hotdog even nastier than the disgusting yet flavourless greasy salt sticks of new york.", "name": "Wienerschnitzel", "rating": 1}, {"index": 18, "review": "Great hot dog joint on Taylor and 4th. The key to this place (for me at least) is to buy only a hot dog with beef. The cheaper hot dogs are made with turkey. I never found a turkey dog or a veggie dog to my liking. Maybe they are okay here at Wienerschnitzel, but I was happy with my beef hot dog (chili dog).\n\nFries are great, soda pop is great. Saw a lot of school kids buying the ice cones for like a dollar. Guessing that those are great as well. I will try some next time. I also want to get the beef dog done Chicago style. That might be my favorite style of hot dog...with the relish, pickles, onions, peppers, tomato, mustard ..and celery salt if available.\n\nPrices are low here. I paid $6 for a beef dog, fries, and a Dr. Pepper. You can go lower if you buy the corn dogs/dogs made out of turkey. \n\nThis place isn't healthy for your body, but definitely good for your soul.", "name": "Wienerschnitzel", "rating": 5}, {"index": 19, "review": "Seen the Yelp* sticker in the window. So I am writing. This is my favorite Wienerschnitzel. It is in a busy little neighborhood north of Downtown. The service is always fast and accurate. I go in the early evening and busineess is always brisk.", "name": "Wienerschnitzel", "rating": 4}, {"index": 20, "review": "I used to know the owner but I think he sold the place cas I never see him anymore. He was nice. The workers here are nice and fast. \n\nThis is honestly my favorite place to go for CHILLI CHEESE FRIES! I love it. It's great. Nothing else compares. Also this location never skimps you out on the chili or fries!\n\nAlthough it is high in calories and I feel like I'm clogging my arteries, I can't help but indulge in every bite! It's full of flavor and taste. So much better than your average fast food joint.\n\nMini corn dogs are so tasty as well and they are only .99! What a deal. They are small but don't underestimate these bad boys. They are full of flavor and go great with mustard. \n\nNeed I say more?\n\nMenu is a little more on the expensive side of fast food but it's so worth it. It's amazing!", "name": "Wienerschnitzel", "rating": 5}, {"index": 21, "review": "I've probably said this before (in fact, I'm sure I have)... but it really does seem to me this time that God or some higher supreme being whatever put this restaurant chain on Earth just for me. It's got everything I could ever possibly want to eat, and MORE.\n\nChili cheese dogs? Yes, please. Italian sausage with onions and peppers? I'll have one of those. Chicago-style dogs? I'm in CA, but sure! I'll take one of those too. Hot dog topped with pastrami, Swiss cheese and a pickle? You have got to be kidding me... that is like a dream come true! The fries kicked ass too, and even after all that (and a soda!), I was still hungry for more.\n\nThere are no Wienerschnitzels on the east coast, but I really hope that someone rectifies this situation, and fast. I even seriously considered opening up my own franchise here in Boston just so I can eat more of their yummy goodness (but alas, I have no business sense or capital to start). I think the best thing I could possibly say to my parents would be, \"I know I went to college and all that, but my life's passion is to sell hot dogs to the masses!\" \n\nI'm sure that would go over well.", "name": "Wienerschnitzel", "rating": 5}, {"index": 22, "review": "First of all I believe they must give out coupons to this place at the bail bonds places down the street and if you've been here you know what I'm saying.  One of my nutso kids was jumping on and off the benches, and the other one was running circles around the tough lineup of folks waiting for the food.  It took forever to get our hotdogs and I was relieved to get in my car and drive away.  The chili fries are so bad.  Save yourself.  Really just nothing too good about this place.", "name": "Wienerschnitzel", "rating": 2}, {"index": 23, "review": "Do yourself a favor and ask yourself, \"Hey, why is this food so cheap?\" \n\nHere's a hint, see how much salt and lard costs at your local market.", "name": "Wienerschnitzel", "rating": 1}, {"index": 24, "review": "It's Friday night after NYE partying. I am very lazy at this point. So after picking up movies, I decided i want fast food. There isn't much near the house. So never having been here after passing it up. I stopped. Order all beef chili dog, fries and drink. As I'm driving home I am preparing myself that this is going to end up badly. Yet, as I drive the smell of the dog and fries gets me salavating. I enjoyed this meal. I regret not upsizing the fries as they were tasty and I should have gotten chili on them. Bonus knowledge. They are open for breakfast.", "name": "Wienerschnitzel", "rating": 3}, {"index": 25, "review": "I'm a regular customer.This is the only location I go to. It's  clean, the staff are all friendly n professional, \"with the exception on one cashier in the morning\"food always fresh and service is fast and accurate, however, It seems the past month the ice cream machine is either down or they run out of ice cream. The other issue is I may be 30 to 60 seconds pass the breakfast time (10:30) and always refused breakfast. I can't imagine 30/60 seconds would seriously make a difference but the cashier will not let up. Between the ice cream and the breakfast it's money lost. I suggested they get the ice cream machine fixed n get their inventory matter fixed, With the warm weather approaching this problem could effect their p&l.", "name": "Wienerschnitzel", "rating": 3}, {"index": 26, "review": "The Chicago dogs at Wienerschnitzel are not great by any stretch of the imagination.  Curiosity got the better of me once.  That won't happen again.", "name": "Wienerschnitzel", "rating": 2}, {"index": 27, "review": "chillie cheese fry burrito for $.99\n\noh \n\nmy \n\ngod\n\nso good.", "name": "Wienerschnitzel", "rating": 5}, {"index": 28, "review": "My neighborhood Wienerschnitzel.\nChili cheese fries with onions is a must!\nCorn dogs are always great.\nHamburgers are pretty good.\nSoda fountain is always nicely calibrated.\nAll beef dogs not too great but I don't come here for those anyways.\nIt's open late, the staff is always friendly and efficient. I don't think I've ever been disappointed here.", "name": "Wienerschnitzel", "rating": 5}, {"index": 29, "review": "I would give this place a 4 for fastfood but I have it a five because it is really good and hotdogs are my favorite fast food when done well like they do them here.  The sandwich, can't remember what it is called, with the dog cut lengthwise on the rye bread is really a winner, sauerkraut anyone? Yes its good and the buns are usually the best in the business, fresh and tastey. Prices are good too. No inside seating but tables outside are clean. Friendly service and a good menu. Walk up and order.  They really aim to please.", "name": "Wienerschnitzel", "rating": 5}, {"index": 30, "review": "i just ate there last night and got food poisoned! Worst Chicken Sandwich I ever had too.. Don't ever eat there!!!", "name": "Wienerschnitzel", "rating": 1}]