[{"index": 0, "review": "I've already reviewed this place before (& given it 5 starts) but this place really is awesome. The tea is great and so are the sandwiches. Prices are great and so is the overall atmosphere. The people who work here are the sweetest.\n\nAnyone looking to try a new boba/sandwich place: Definitely try Butterfly :-)", "name": "Butterfly", "rating": 5}, {"index": 1, "review": "This adorable small Vietnamese milk tea/banh mi/vietnamese sandwich got me sad that during my stay there, there were only about 3 other customers who came in that 2 hour window.\n\nPlease choose this mom & pop shop over the more popular boba place down the street! It is just as good in my opinion.\n\nI had some time, a book, and a craving for milk tea. I ended up ordering a lavender milk tea and green pandan waffle, which had my total come out to be $7.91. \n\nThe lavender milk tea was really good, with just the right amount of lavender and tea flavor. Boba consistency was chewy and good as well. The pandan waffle was also quite good and a dal for only $3.50. SCU kids, come through for a snack on your way to class! The owner, Jennyfer, saw that I was done with my milk tea and offered to bring me water, which was so nice. It was great customer service. \n\nThere's a $10 min for cards and a .35 cent charge to use the card I believe.\n\nI'll be coming back here if I'm ever in the area as I'm happy to support local mom and pop shops when I can.", "name": "Butterfly", "rating": 5}, {"index": 2, "review": "I normally pay $3.00 for one sandwich, this place charged me $9.00. \nThey do have better Vietnamese sandwich than the other stores but not worth $9.00.\nThe staff is nice though.", "name": "Butterfly", "rating": 3}, {"index": 3, "review": "Finally came here after living so close for 3 years. Service is very nice and friendly drinks are top notch! I ordered the coconut green tea with coffee jelly. It was flavored with real coconut and I am pretty sure they make their own coffee jelly. My boyfriend ordered the strawberry banana snowbubble which is like a smoothie, he said it was very good. They use all fresh fruit. We will definitely be back to try the food.", "name": "Butterfly", "rating": 5}, {"index": 4, "review": "Hungry and needing a small snack before a real meal? \n\nButterfly has just that! \n\nFood: \n\n-Great Vietnamese coffee (comes in a slushing form) $4.50 \n-Protein style spring rolls (2) good amount and not cheap on the size of the roll", "name": "Butterfly", "rating": 5}, {"index": 5, "review": "What people say about extremely nice people working here is very true, I attest. \n\nMy partner and I walked in to grab a bite and were greeted right away. We were handed the menu and told to take as much time as we needed. The banh mi menu is really simple, there are only two options: a meat version and a vegetarian version. The spring roll options are the same. I was craving a banh mi so we went with their Butterfly Special (meat version). Of course I had seen pictures of the green pandan waffle and knew I had to try that too.\n\nThe total was $9.00 on the dot. It was $6 for the banh mi and $3 for the waffle. \n\nBanh mi came out presentably very nice. It was on a very pretty plate and then on a basket plate. It's the nicest banh mi I've ever seen. The banh mi itself was very flavorful. The bread was crisp on the outside and warm/fluffy on the inside. Whatever is in that banh mi is way better than any banh mi I've ever had. The only downside is that it is smaller than most banh mis. I probably could have consumed two of these!\n\nThe pandan waffle is delicious. It's not too sweet, and it was crisp on the outside and so soft on the inside. Some have already commented that it was doughy on the inside, and I agree that it is a bit on the doughier side. However, that's not to say that the batter is raw. It was just a fluffy, doughy kind of soft, which I actually liked. But then again, I love carbs of all kind. The pandan flavor is there without being overpowering or too subtle. Once again, it's not so sweet that it will give you a tummy ache. \n\nService is so kind here. The lady here came out and asked me if I wanted my waffle crispy or soft. I thought this was really nice of her because people have different preferences in terms of how they like their waffle cooked. She was really friendly, chatted with us, and gave us great service. :-)\n\nI wish the banh mis were bigger because they are so freaking good. I would still come back here to eat though!", "name": "Butterfly", "rating": 4}, {"index": 6, "review": "New addition to their menu: beef rib banh mi! Beware the red chili pepper! I'm used to having jalapeños in my sandwich but whoa! I did not see the red peppers when I bit into this one! \n\nThey. Are. Spicy!\n\nOne glass of milk, a spoonful of peanut butter, and an Oreo cookie later, my mouth is no longer on fire.\n\nAs for the sandwich, it's good! The cashier who took my order told me she thinks it's more flavorful than the banh mi special, so I think I made the right decision!", "name": "Butterfly", "rating": 4}, {"index": 7, "review": "Came here after my friend and I went to get our nails done across the street and we were hungry for some food. We found this little gem on Yelp as well. \n\nWalked in, sure do like Butterflies and wanted to keep the theme of that. \n\nWas greater by a young boy, I believe it was the waiters son. Nice young boy. \n\nWe were checking out the menu and the \"snack\" portion of the menu was limited. Saw a couple bahn mi's and spring rolls, and waffles. Thought the door said they sell pho as well but didn't see that on the menu. The owner then said hi to us cuz she was working in the back. She let us know that there was this othe BBQ meat dish bahn mi and we both decided to order that. \n\nIt was yummy and came out on a cute display. There could have been a little more meat stuffed in there but all the flavors was still delicious. I asked to get it spicy and boy was it spicy! \n\nWe also ordered boba drinks. I had the lychee milk tea with boba and lychee jelly. For me it's all about the boba, and I wasn't too fond of this. Next time I come here I can just get it without the boba. \n\nWhile my friend and I were chatting the owner decided to make us the green pandon waffle. My friend has never had it and I kept telling her it was good. The owner ended up making one without us even asking her! So nice! You can totally tell\nIt's a family run business, great customer service and their bahn mi was yummy. \n\nI'm only knocking off one store cuz the actual boba itself. Other that that I will definitely be coming back.", "name": "Butterfly", "rating": 4}, {"index": 8, "review": "It's true. Only nice people can work here. I came in a sour mood and was instantly in a good one after speaking with the individual at the counter who took my order.\n\nI got a green pandan waffle which didn't have the crispiness I love in green waffles. This one was much greener and doughier than I like but my counterpart said it was the best one he's ever had. To each their own. 3 dollars for the waffle \n\nThe sandwich was solid. It was 6 dollars and was traditional with cha lua, pickled veggies, mayo, xa xiu, thinly sliced cucumbers and i think ruc  . No Pate though but it was on a perfectly toasted french bread. It was definitely sufficient for the craving!", "name": "Butterfly", "rating": 4}, {"index": 9, "review": "I ordered Taro Boba tea and spring rolls. This by far has been one of the best boba teas Iv had. They were able to customize my tea with less sugar and almond milk. The spring rolls were fresh and flavorful. \nOh and that peanut sauce, yummm!!!", "name": "Butterfly", "rating": 5}, {"index": 10, "review": "A little pricey for bubble tea, but less pricey than Sharetea down the street I guess. I payed $5 even for a large lavender snobubble smoothie. I like that they had lavender but I prefer my lavender drinks a little bit more strong even though it usually becomes a more artificial taste. The bubbles were good a good amount of chewy but some were on the under cooked side. I'm not the biggest fan of bubbles so it's my fault, I should have asked for jelly. They have a huge variety of jellies to choose from. No pudding though! I wasn't overly impressed with the drink, pretty standard. If I was craving bubble tea and this was the only one open, I'd stop by!\n\nI would definitely come back to try the food though, the pandan waffle and the bahn mi looked really good. The Pho on the otherhand seemed a little overpriced $10. But we will see. Since it's so close to me, I'll definitely have to come back and edit my review when I have tried more things.", "name": "Butterfly", "rating": 3}, {"index": 11, "review": "This place is so precious. We came in a group of six and all ordered a looooot. They're family own and run, so if you come in with or behind a big group, be ready to wait for a while. The wait didn't bother me at all. Their presentation is so cute and the family is so sweet. Everything we ordered was incredibly delicious. I got a vegetarian sandwich, we also had a few waffles, chicken, egg rolls, an array of drinks and some other random things. Everything was amazing and the family is so so so sweet. Highly recommend. I wish I lived here so we could com back more often!!", "name": "Butterfly", "rating": 5}, {"index": 12, "review": "This is the best bubble tea I've had since I've been in the Santa Clara/ Sunnyvale area. It's not overly sweet so you can taste the actual flavors. The lady is always friendly as well. Definitely only place I'm going back too!", "name": "Butterfly", "rating": 4}, {"index": 13, "review": "I have been going since their grand opening and honestly will not go anywhere else for my boba, or Asian food, for that matter.\n\nTheir pandan waffle is one of my favorite things to get when I'm craving a snack along with my drink; their pho is also very good. \n\nThe owner is also an absolute darling, and that's a big plus, as I go to SCU nearby and am a constant customer. \n\nGive it a try.", "name": "Butterfly", "rating": 5}, {"index": 14, "review": "Jennyfer (owner) is the sweetest! My friends and I came here late on Saturday night to get our banh mi cravings fix on, and luckily for us this place opens until 9pm.\n\nThis place is cute - there's lots of decor around the place, including cute little succulents on patio tables outside the place - I can tell they spend a lot of time putting this place together. \n\nThere's not much variety of food on the menu, but don't let that fool you. Each item seems to be crafted and made with perfection before releasing on the menu. (i.e. we ordered a BBQ beef sandwich that will soon be added to the food menu). \n\nWe ordered all of the Vietnamese sandwiches on the menu (special, BBQ beef, and vegetarian) and to my surprise, ALL of them were delicious! They are very similar to the traditional Vietnamese sandwich, but made with a modern twist of Jennyfer's creation. The jalapeño she used in the sandwich were extra spicy - so be careful! The sandwich was so good, we devoured them before we could take a picture.\n\nWe also got to try the Pandan Waffle and they were SO GOOD! They were thick, crunchy on the outside, and fluffy on the inside. The flavors mesh so well together - really good after eating that spicy banh mi. \n\nWe weren't a fan of the boba - we ordered the jasmine tea & coffee milk tea. They were alright. I would come here for their Vietnamese sandwich. We'll be back to try other food items on the menu! \n\nCon\n- Not a lot of variety of Vietnamese sandwich, but ALL of them were delicious! Hopefully, they'll be more in the future. \n- A little overpriced, but everything was good so far! \n\n+ Accepts credit cards\n+ BOMB ass banh mi (& pandan waffle)\n+ Great Customer Service", "name": "Butterfly", "rating": 4}, {"index": 15, "review": "Whoever the person behind the counter is.... she's very very nice. If this place succeeds she will have 99% to do with it. It's kind of hidden away but was able to find it through yelp. The bahn mi is made wonderfully. You can tell she goes the extra step to make it good. They are however kind of small and takes a bit to get your order... it really doesn't matter though. They are good and made with love. I hope we all go there because it's rare to see something this good go unnoticed. \n\nI'm so glad I bought 2 for myself. one on the way home and straight away when I got here. I wanted two number 1's but she recommended something else..... steak or pork she said. I opted for pork... her sandwich was better than the one I chose. Be back very soon!!", "name": "Butterfly", "rating": 5}, {"index": 16, "review": "WARNING: The nicest people on the planet work here. \n\nSo if you're in a mood and having a bad day, be prepared for that to be completely turned around by the staff at Butterfly. \n\nIt's a cute little corner shop operation with very random decorations like an outdoor decorative water fountain inside a sparkly light up eiffel tower, mix and match furniture, random cooler with ready-made desserts, and the cutest faux grass and butterfly counter cover. \n\nAs soon as I walked I was greeted and the wonderful woman behind the counter let me know they also make banh mi and spring rolls, though they aren't actually listed on their menu board. There are some slices pics of those items, but I'd def recommend they add it to their electronic board to boost sales. \n\nThey have 3 different types of drinks: Tea (all sweet as far as I can tell), snowbubble (smoothie), and milk tea. \n\nI got a tea with passion fruit, grape, and lychee with green apple jelly. It was good but very sweet. I couldn't finish the whole thing on my own and kinda wish they had an option to make it less sweet. But I'm also from the midwest so when I hear 'tea' sweet tea with syrup and flavors don't come to mind. To me, that's flavored soda/dessert, but I realize in South Bay the high fructose drinks are still considered 'tea'. Something I have to get used to.\n\nThe avocado snowbubble smoothie was good. It actually wasn't very sweet, which I appreciated, but it also wasn't super flavorful... then again, how much flavor can I expect from getting avocado. The weird thing about this drink was that I finished about half of it and had to go into an event. I came back 3+ hours later and it was still in the exact same condition. Not melted, still cold, not flat at all. Kinda makes me wonder what's in it that it doesn't melt down. At the end of the day I'd totally get this again in other flavors. \n\nI got the spring rolls with shrimp but no pork and was thinking they'd come in a to-go box as I was in a bit of a hurry but they served them in this beautiful basket and the portion was actually super generous. They weren't the greatest spring rolls ever and def could have used quite a bit more mint, basil, and cilantro for flavor but the presentation was lovely and it was unexpected for a little drink shop like this to even offer that so I'm a fan. \n\nThe woman behind the counter also made me a sample of their pandan waffle. It's green and tastes just like a regular waffle. I'm thankful she let me try it because I was curious but to me it might as well have been a waffle with green food coloring. Maybe when you order it you can choose toppings- I don't know and I didn't see it on the menu, but it wasn't something I'd get again on its own. Needed a light honey drizzle or dipping sauce in my opinion. \n\nI will say that it's not exactly fast and if you came while they were busy you could easily be there for 15 minutes waiting on your drink and more for a banh mi or spring rolls, but they're new so I'm sure it's something they're working on.", "name": "Butterfly", "rating": 4}, {"index": 17, "review": "Friendly staff, really clean restaurant with 5 small tables. \n\nThe menu is somewhat limited to two banh mi options of a special sandwich (multiple kinds of pork) and a vegetarian option for $6 each. I opted for the special sandwich and it was just ok. The meat was overly salty and fatty and there isn't quite enough pickled veggies. Also the cucumbers were cubed and not julienned which made it harder to eat in a sandwich. \n\nI also think the bread quality is an essential element to a good sandwich, which was definitely not the case here. The bread was too round and not crunchy at all. \n\nOverall not a terrible option if you need a quick banh mi by Santa Clara University, but with El Camino Real and East San Jose within an accessible drive, I would definitely venture out to those neighborhoods.", "name": "Butterfly", "rating": 3}, {"index": 18, "review": "Look out for this place, as it's a bit hidden. The place has a nice feeling to it, nothing too modern, but the decoration sets a pleasant atmosphere. I wouldn't come here to hang out with friends, but maybe for a quick lunch.\n\nThe service is pretty good. The cashier, who I think owns the place, clarified any questions I had about the tea served here, specifically, what snowbubble was, and gave me a sample of the boba before I even purchased anything. \n\nMy friends ordered the spring rolls. The presentation of the dish was pleasing Although I didn't personally try the rolls, my friends said they were good. \n\nI ordered a Coffee Milk Tea with boba. It's a little pricey, but about what I would expect from a smaller business like this one. The drink took a bit for the amount of customers that were in the shop. It was worth the wait though. The owner brewed the coffee in it fresh, and the boba was chewy and sweet.\n\nOverall, I'd definitely come back here. The owner obviously cares about her business, and it shows in the food and drink here.", "name": "Butterfly", "rating": 5}, {"index": 19, "review": "We will probably come back here again. The tea was good and so was our banh mi sandwich. \nIt's a little hidden so you really have to look for it. I must say it is a improvement from the old place in every way. Decor, drinks, food. The food in housed in one of those warming oven things so it's good for a quick bite. The main sell is the tea of course. It's one of the better tea places in Santa Clara, we were not disappointed.", "name": "Butterfly", "rating": 4}, {"index": 20, "review": "I love how this place has boba drinks and banh mi sandwiches. They even have pho on the menu. If you're looking for a quick bite, stop by this little corner on Lafayette St. I had the butterfly rib eye  sandwich with an iced vietnamese coffee to go.  The food came out fast and I enjoyed every bite.", "name": "Butterfly", "rating": 5}, {"index": 21, "review": "New to the area so I decided to check out Butterfly. \nIt is located at the end unit of business strip on Lafayette and Frankin St. lots of parking.  The interior is very pleasant and comfortable. Good amount of tables to hangout. \nTheir Vietnamese sandwich and it was good, pandan flavored waffle made fresh to order was really great snack (daughter in picture approved) and the Avocado  smoothie with pearl went down well as well. The boba pearls were fresh. I will have to come back to try more items during my lunch hour. Service was quick and they do deliver as well.  The owner also said they do fruit arrangements at reasonable prices.  I will update more", "name": "Butterfly", "rating": 4}, {"index": 22, "review": "Great service! Enjoyed my lychee black tea with lychee jelly and my friend like the mango black tea with mango jelly I ordered. \n\nWill have to come back next time to try the banh mi and other offerings.", "name": "Butterfly", "rating": 3}, {"index": 23, "review": "Love Jennyfer and her cafe. Food here is amazing and she is really kinda. The boba teas have so much flavour compared to most places. Door presentation is exceptional for a small cafe. Thank you again for the to go cups of Vietnamese coffee to help us get back on the road to SoCal.", "name": "Butterfly", "rating": 5}, {"index": 24, "review": "Hidden gem next to Santa Clara U. They now have banh mi and spring rolls . Good drinks , good food what more can I ask for when I'm in the area. \nThanks Butterfly", "name": "Butterfly", "rating": 5}, {"index": 25, "review": "Amazing place ...first time today with me and my daughter... there strawberry snowbubbles was soooo good..\nThe butterfly sandwich omg!! Fresh and delicious", "name": "Butterfly", "rating": 5}, {"index": 26, "review": "The lady (owner?) or the shop was very friendly and possibly the highlight of my experience here. \n\nI wanted something quick, cheap, and tasty to grab before class and I figured I would try out Butterfly since I walk past it everyday on the way to class. I walked in, and it was a tad too warm for a hot summer day out but I thought it's okay, I'm only here to get food to go. I ordered a banh mi and the nice lady took my order and made it herself. You could tell she put a lot of care into making the sandwich, but my concern is that I paid close to $7 and got a smaller-than-average banh mi that was pretty much just fatty pieces of pork with every bite. Perhaps that is what appeals to others, but I tend to want to enjoy my banh mi without biting into a deposit of lard every time. I ended up picking out all the meat, and stomaching the rest because I didn't want to waste the sandwich. I wouldn't have mind paying a little more for a larger portion or superb quality, but I think it was just not a good match with my taste.", "name": "Butterfly", "rating": 2}, {"index": 27, "review": "This is a cute restaurant with the nicest family working here. I felt very welcome and happy as soon as I walked through the door. \nThe place is very clean and the food is awesome. The banh mi is delicious and the teas are great too. \n100% recommend coming here to support good local businesses.", "name": "Butterfly", "rating": 5}, {"index": 28, "review": "I ordered 3 drinks from Butterfly through UberEATS. I ordered a honeydew milk tea, honeydew snow bubble and mango snow bubble, all with black pearl. I found it extremely odd that my honeydew milk tea had a pulp type of texture but didn't bother too much I guess. On the other hand, I didn't care for the ridiculous amount of ice in my drink. It really upsets me when 3/4 of the cup is filled with ice as I paid for the drink, which in this case I didn't get much of, even though I upgraded to a large. When it came to the snow bubbles, they didn't taste like their prospective flavors as the sweetness overpowered the drink all together. I will definitely pass on this place next time I'm in the mood for boba.", "name": "Butterfly", "rating": 2}, {"index": 29, "review": "Great food, friendly service, and nice atmosphere. Get the veggie rolls! Their peanut sauce is bomb dot com.", "name": "Butterfly", "rating": 5}, {"index": 30, "review": "Came here for a quick break with my coworkers in hopes we would fulfill our tea craving. After waiting for our drinks for nearly 20 minutes, the anticipation was killing me! I thought to myself, \"This is going to be one hell of a drink!\" I ordered mine 25% sweet (pretty sure it was 100%) and that shit was pure coffeemate and I didn't taste any tea! I ordered an almond milk TEA not milk on the rocks. I will not be coming back here again.\n\nAlso, it smelled like toilet water which could have been the pickled veggies but it was too pungent. I love banh mi, but they could do something about the odor in there.", "name": "Butterfly", "rating": 1}, {"index": 31, "review": "Um, I hate to do be the one to do this, but it's time to bring this establishment back down to reality. I have no idea how this place has the reviews it does, but if you want to know what it's really like, read on.\n\nSo I came here with three friends, we were all craving milk tea with boba. We ordered a Jasmine milk tea, two regular milk teas, and an almond milk tea. We waited 25min for our drinks to be prepared even though there was no one ahead of us in line. I can't ever recall waiting that long for milk tea in an empty tea shop. To be fair, the person who took our order was nice +1 star.\n\nAs we were waiting, we noticed that each drink was being individually blended with multiple large scoops of powdered Coffee Mate, which seemed both excessive and flat out strange. When our drinks finally arrived, the first thing my friend and I noticed was that our order of 25% sweetness milk teas were cloyingly sweet. Like beyond 100% sweetness at any other place. We quickly all realized as a group, that there was NO tea in any of our drinks. We were literally drinking liquified Coffee Mate with boba. We couldn't even drink our \"milk teas.\" Yuck.\n\nI would highly recommend passing on this place, forever. Or at least until they get their act together and start using quality ingredients.", "name": "Butterfly", "rating": 1}, {"index": 32, "review": "I stopped by Butterfly for a snack after grad school. Butterfly is located right off campus from SCU and it is convenient to walk to from campus. Jennifer is the owner and she is so kind and friendly! \n\nMy friends and I ordered boba tea and a pandan waffle (green waffle) to share. I appreciate that I had the option to choose the sweetness of my drink. All of the fruit that goes into the boba drinks are fresh and not artificial! The panda waffle was cooked perfectly! It was crispy on the outside, warm and soft on the inside! \n\nI can't wait to go back to try more of the snacks...especially the Vietnamese sandwiches, spring rolls, and French bakery treats!", "name": "Butterfly", "rating": 5}, {"index": 33, "review": "I was in the area and saw this place on yelp. Looks pretty new. The owner is super sweet!!! Went from laundry/dry cleaning owner to this place! She asked me about my day and it felt like a great personal connection which is good in the customer service world. She made sure my drink came out just the way I wanted. I got the regular milk tea which was good and the butterfly sandwich? Whatever sandwich it was, it was pretty good and I'd recommend it! Plenty of meat and just the right amount of spiciness! If there was a little more sauce it would have been perfect.", "name": "Butterfly", "rating": 4}, {"index": 34, "review": "My boyfriend and I went in for a coffee milk tea and taro milk tea. The lady that took our order was very friendly, but did take a while to prepare it. As soon as we got our drinks, we took a sip, we were both immediately in disgust. The taro milk was way too sweet and had an odd taste of cotton candy. The coffee milk tea was way too bitter, and to add the boba was gross. It was a waste of $10!", "name": "Butterfly", "rating": 1}, {"index": 35, "review": "My co-worker and I came here after work today and were absolutely blown away by the excellent service and delicious boba drinks served here! Jennifer, the manager, is infectiously sweet and wonderful to talk with, and even gave us a free sample of the pandam (green) waffles on display. She had never heard of mixing the Taro and Thai Tea flavors together (a mix I always ask for), and was so impressed with the resulting flavor that she said she might name it after me.  So if there's a drink called the Brian on the menu, that's why.\n\nAll in all, I highly recommend this place, both for the incredibly comforting atmosphere and the excellent boba drinks. I look forward to coming back here soon!", "name": "Butterfly", "rating": 5}, {"index": 36, "review": "The highlight was the customer service. The workers put a lot of care into the food they make! I ordered the snowbubble which is similar to a smoothie but with boba. So tasty! My boyfriend ordered the bbq pork banh mi and he liked it so much he ordered another!", "name": "Butterfly", "rating": 5}, {"index": 37, "review": "This place is around the corner from the tailor store and has the cutest staff. You'll have to be a little patient here in case you come when they're busy, I went when there was only one worker so it took a little longer for me to get my meal since there were people ahead of me.\n\nI ordered a banh mi ($6) and was really surprised when I found out it was a combination banh mi. It came with shredded chicken, BBQ pork, and cha lua - YUM! The sandwich was very good and the presentation was super cute! She served it on a plate in a bamboo basket.\n\nI also got a pearl milk tea... which was average, not the best but definitely not the worst. The boba was actually quite delicious and I very rarely get boba because some places make it too chewy or too hard. \n\nLooking forward to coming back again. :)", "name": "Butterfly", "rating": 5}, {"index": 38, "review": "Delicious Milk Teas!!! ;d The young lady who works there is super sweet and cute and very nice! She made my day :)\n\n*Update: we ordered the butterfly croissant sandwich, which was bomb! Let me tell you, the waffle dessert is soooo gooood. You must try it all when you go!! Your tummy will thank you!!! ;d", "name": "Butterfly", "rating": 5}, {"index": 39, "review": "I adore Butterfly. There are plenty of tea shops in the area, including one right next door to Butterfly, but none of them come close to Butterfly's quality and service. The owner is absolutely the sweetest; she remembers her customers and is always so wonderful to talk to. Every item I've had on their menu has been fantastic.\n\nJasmine Milk Tea: 5 stars. The balance of milk, sweetness, and tea is perfect. Exactly what I want in a milk tea.\n\nTaro Milk Tea: 5 stars. Rich, creamy, and sweet, without being overpowering. The color is great too!\n\nMocha Snow: 5 stars. Super refreshing, and the coffee has a really charming hazelnut flavor. \n\nOreo Cupcakes: 5 Stars. We took these home one night to eat later, and they were perfection. The Oreo was softened, so you could bite right into it with the rest of the cake. Just great!\n\nI'm really excited to try their sandwiches and pho too! There is ample parking, and they deliver with GrubHub too, so you have no excuse not to give them a try! My favorite place in the South Bay for tea and snacks!", "name": "Butterfly", "rating": 5}, {"index": 40, "review": "My mom and I visited this adorable place after noticing the recent grand opening sign.  We stepped inside and were greeted by the new owner Jenny and her daughter Brianna.  Jenny welcomed our visit with a sample waffle made out of a green Panda leaf and coconut oil.  The waffle was delicious without any syrup, I loved the texture.  \n\nAs we chatted briefly with the owner and her daughter, we also looked over the menu.  They offer spring rolls, Vietnamese sandwiches, in addition to a variety of milk teas with boba.  We also sampled their Thai one of my favorites, I can't to go back and taste the spring rolls and sammies. Butterfly also offers fruit arrangments and coffee beverages. Five stars for the excellent customer service and delicious samples!", "name": "Butterfly", "rating": 5}, {"index": 41, "review": "The fresh ingredients make the difference between this place and all the other boba teas in the area.\n\nI had the taro and my husband had the honey dew.  You could definitely taste the taro and honey dew.  The pearls were also the right consistently.  You are able to select sweetness as well.\n\nThe sandwiches weren't great so I would not order food again but would recommend their drinks.  I hope they continue to include the fresh ingredients because many places taste artificial and now other taro milk teas just don't compare.", "name": "Butterfly", "rating": 4}, {"index": 42, "review": "My boyfriend and I live nearby and go here all the time.  This has become our favorite place to get Boba tea, locally.   Here's why:\n1) The owner, Jenny, is the nicest person in the world.   So friendly, and really goes out of her way to make you feel welcome and make sure you have a great experience.  The rest of the staff is also quite friendly.  \n2) The tea is delicious.  They use fresh fruit in all the drinks, and you can really, really taste the difference.\n3)  The Waffles are yummy, and so are the sandwiches.  Food is presented very nicely, too, in little baskets.\n4)   They make really beautiful, reasonably priced edible fruit arrangements which is all fresh, lovely, and delicious\n5)  The décor is cute and eclectic.   Every time we walk in, they are playing fun, upbeat music, too.", "name": "Butterfly", "rating": 5}, {"index": 43, "review": "I can only rate the sandwich and the spring rolls. There are only 2 types of each- a vegetarian and a meat (pork, shrimp) version. But at my favorite restaurants I only order the same items anyways, so I don't mind less choice. \n\nThe food tasted fresh with lots of crunchy veggies, soft roll and juicy pork belly. It's nice to have a healthy lunch option near work without worrying about timing or parking", "name": "Butterfly", "rating": 4}, {"index": 44, "review": "The sandwiches are delicious and the green waffles are amazing. I had the mango smoothie and it tastes almost like I was eating a fresh mango. I recommend this place 100%. Service is quick and I believe her name is Jennyfer, she is so very sweet.", "name": "Butterfly", "rating": 5}, {"index": 45, "review": "While the staff was very friendly, i was utterly disappointed in the banh mi. Possibly one of the worst that I've had. The pork was covered in bright red food coloring and the sandwich was masked with mayo and the rendering fat from the pork slices. Nowhere did I taste any pate. And the fancy pork was thin. The sandwich pretty must tasted like mayo, fat, and pickled carrots", "name": "Butterfly", "rating": 2}, {"index": 46, "review": "Absolutely delicious! Great atmosphere and great food. The staff was extremely friendly and it was nice to meet Jennifer. I am an American who lives in Vietnam and this is very authentic. Cant recommend it enough!", "name": "Butterfly", "rating": 5}, {"index": 47, "review": "I read the review and come here, I really don't know how did they get the positive review ?!!? this store is totally Shitty!!! They said they put all the meats(chicken and pork)  in the sandwich, actually there are nothing real meat in the sandwich,they put all the artificial meats which I never met in United States. When I request to change to the real meat,they said that's all they have.They told me they make the meat. Seriously?? They made all the fake meats to put in their sandwich,horrible!! DO NO go to this store to pay for their fake sandwich. I wish I can put zero star to review it. I just leave the entire sandwich to them. Sooo terrible,I have never seen a store like that,how can they waste soo much time to make all the ARTIFICIAL meats ??", "name": "Butterfly", "rating": 1}, {"index": 48, "review": "I love this place so much! Jennyfer is the kindest most genuine person and she always asks how I'm doing. Try the green waffles at your own discretion because you will be addicted like I am!  I'm a tough boba critic and this place is amazing. A true gem!", "name": "Butterfly", "rating": 5}, {"index": 49, "review": "Came here with a friend a few weeks ago looking for some yummy tea. Lucky we found this place! I had a Thai tea and my Friend got honeydew. They were both delicious! We also got the waffle that was unique and super tasty! The owner was such a sweet heart. You could tell that she was excited about her shop and all of her items. Will be back!", "name": "Butterfly", "rating": 5}, {"index": 50, "review": "So I work near by here and I really wanted to find a place that served Vietnamese food. I ordered the buttery banh mi special and it was SO GOOD  probably one of the best services I had in a while. It tasted really good, everything was cooked perfectly. The lady was so sweet that she gave me a small dessert. Definitely will be coming back here for my daily lunch breaks :)", "name": "Butterfly", "rating": 5}, {"index": 51, "review": "Love the cute decoration with beautiful butterflies. Would come over daily for a happy mood if i live in the neighborhood. Had try the Mango Smoothie. Perfect flavor!! Love to speak to Jennyfer, she is like a neighbor sister.", "name": "Butterfly", "rating": 5}, {"index": 52, "review": "I got the special five spice pork and it wasn't what I was hoping for expected at all it's pretty flavorless I'm glad I asked for extra help but the only thing the sandwich that taste good.  I have been debating driving up to Union City to my favorite Vietnamese sandwich place but the reviews were good here and I thought I'd try it now I wish I'd made the drive", "name": "Butterfly", "rating": 1}, {"index": 53, "review": "I ordered lavender milk tea. It was the best lavender milk tea I have had. I also had their chicken bun.", "name": "Butterfly", "rating": 5}, {"index": 54, "review": "2nd time in, order their butterfly special sandwich.  This time round, bread is hard to bite almost broke a tooth and is very chewy. Wonder y there a big difference from the first time I try.  This time it's a waste of money.", "name": "Butterfly", "rating": 2}, {"index": 55, "review": "Small place, but I enjoyed my lunch here very much. I ordered some banh mi and milk tea. The sandwitch was $6 which was more than I'm use to paying but it was a good portion and had a good amount of meat and veggies. Tasted amazing. The milk tea was good and I liked you can control the amount of sweetness. The boba was a little chewy for my taste but I'm a very picky boba eater.", "name": "Butterfly", "rating": 5}, {"index": 56, "review": "I LOVED the Vietnamese sandwiches and the coconut milk tea there is up there with one of the best boba drinks I've had - it's also now my new favorite flavor. Jennyfer and her staff delivered such great customer service as well and I will be revisiting very soon!", "name": "Butterfly", "rating": 5}, {"index": 57, "review": "Great bubble tea, you can tell them the sweetness level, and they can make some of the drinks with soy milk if you don't drink regular milk. I got a vegetarian banh mi without mayo so it was vegan. Overall a great spot if you're trying to avoid meat since the meat substitute they use was really tasty and filling. They had great non-vegetarian options; my friends got non veggie banh mi and a shrimp spring roll. Awesome spot with good seating, and the fruity drinks use fresh fruit. We also got a complimentary pan dan waffle which has a coconut flavor (non vegan I think)! The owner and workers were all really nice too!", "name": "Butterfly", "rating": 5}, {"index": 58, "review": "Place is pretty brand new and I came in for some food. Ended up getting a jasmine milk tea, and a Vietnamese sandwich. The people were friendly and also gave me a complimentary green waffle, so good!", "name": "Butterfly", "rating": 5}, {"index": 59, "review": "If you are tired of frequenting businesses where you are treated poorly, or get the feeling the staff is indifferent about you at best, then you are in for a treat.  The two ladies there during my visit dealt with everyone walking in like they were invited guests.  \n\nI got a sadwitch and a chocolate dessert.  The bread was fresh and the ingredients tasty and healthy looking.  The layered dessert was in a pretty glass container.  Coffee was likely one of its components.  I did not go for the tea drinks, even though they populate much of the menu.  Would love to see more lunch variety and other sandwitches such as tuna or vegetarian options.\n\nThe place is very clean.  But what really grabbed me is how customers are treated.  You get the impression you are among friends who care about you.", "name": "Butterfly", "rating": 5}, {"index": 60, "review": "Looking for a local Boba shop heading out of town and found this on Yelp. Great customer service. Deeeelish! Coconut Milk Tea is da bomb!", "name": "Butterfly", "rating": 5}, {"index": 61, "review": "Finally, a Vietnamese sandwich shop opened up by my work. This is my fourth time coming to this shop so I think I'm quite well versed with the food and drinks offered here. My usuals are the special meat sandwich or spring rolls which a drink order of the classic milk tea or jasmine milk tea. Keeping it 100, I honestly believe the sandwiches and milk teas are very good. My girlfriend usually orders her fruit teas with 70% sweetness. Overall, this place is a hidden gem behind the old plaza. The people working here are very friendly.", "name": "Butterfly", "rating": 5}, {"index": 62, "review": "Great service. The sandwiches are so yummy, the drinks are excellent, the owner of the store is so cute, beautiful, and very friendly. I will recommend my friends and coworkers to come to enjoy the food here.", "name": "Butterfly", "rating": 5}, {"index": 63, "review": "Staff is super nice. Milk tea is sweeter than I'm used to; I asked for their absolute least sweet option and it's still too sweet for me.", "name": "Butterfly", "rating": 3}, {"index": 64, "review": "Sandwiches and Boba drinks here are super yummy. The owner obviously cares about the business and you could tell the love in every plate.", "name": "Butterfly", "rating": 5}, {"index": 65, "review": "Very friendly, home feel. I had the coconut milk tea, which was better than any other coconut milk tea I've had at other boba places. They also gave complementary green waffles. Entrance is a little hidden, but it's definitely worth going.", "name": "Butterfly", "rating": 5}, {"index": 66, "review": "I came her for a quick bite.  I used the Yelp Order but it did not go through.  The Lavendar Milk tea is good.  I ordered the special sandwich.  I expected a larger size for the type of sandwich and the bread was really tough.  The inside is clean, decor is cute and staff are really nice.  The store seems to be new so I anticipate it will get better over time.", "name": "Butterfly", "rating": 3}, {"index": 67, "review": "Get ambience and the bubble tea is legit.  No powder her, real ingredients.  The price was very reasonable and the staff skied to please.", "name": "Butterfly", "rating": 5}, {"index": 68, "review": "I tell my wife I could alway live off of Banh mi sandwiches, so Ive had my fair share and variety of them. I think the Banh Mi here is the best I've ever had in my life. From the bread all the way down to the meat cuts.  Not to mention their tea and spring rolls were yummy too!", "name": "Butterfly", "rating": 5}, {"index": 69, "review": "Enjoyed hanging out at this quaint little shop. Had a great Vietnamese veggie sandwich and tea. Hung out long enough to need a second beverage and got maybe the best Vietnamese coffee I've ever had. Location used to only have bubble tea, and is trying to get the word out about their growing food menu. Check it out!", "name": "Butterfly", "rating": 4}, {"index": 70, "review": "I love this shop. The pho and sandwiches are delicious. Nice assortment of tea choices.", "name": "Butterfly", "rating": 5}, {"index": 71, "review": "We found the best boba in Santa Clara, my grandson says to go there every weekend. Won't argue with that. Will taste the pandan waffles next time...", "name": "Butterfly", "rating": 5}, {"index": 72, "review": "Frankly didn't expect this place to so Awesome. Jennifer is an incredibly sweet person and great to talk to. The coconut milk tea is a must-have as is the special sandwich. Will be returning many times I guess", "name": "Butterfly", "rating": 4}, {"index": 73, "review": "Jennyfer is the sweetest lady! She was so attentive and caring. My friends and I were all happy with our teas and definitely will be returning! Thanks butterfly", "name": "Butterfly", "rating": 5}, {"index": 74, "review": "Food is delicious. Bread is baked fresh! Slushees and other drinks are not too sweet. Veggie sandwich yummy with lots of meat like taste with the tofu. Altogether a 5+++", "name": "Butterfly", "rating": 5}, {"index": 75, "review": "Good customer service their jasmine pearl tea was good...not too sweet. We order their house special sandwich...it was .  Their meat is not fattening..paired with cha...makes a great sandwich. I especially love the spiciness.  I would definitely go back to try their spring roll and waffle.", "name": "Butterfly", "rating": 4}, {"index": 76, "review": "Very impressed with this new restaurant. So far I have only had the waffles and vegetarian sandwich, can't wait to try more menu items. Their food is prepared made to order and they use fresh and tasty ingredients. I was especially impressed with the waffle made with fresh pandan leaves (traditional Vietnamese style), not too sweet and very flavorful. I will be back to try more items!", "name": "Butterfly", "rating": 5}, {"index": 77, "review": "The Vietnamese sandwich was very small for $6 and the taro milk tea overly sweet. There was no line, but I waited over 10 minutes for my sandwich, which wasn't even heated when I got it. Probably won't be coming back...", "name": "Butterfly", "rating": 3}, {"index": 78, "review": "Just got a veggie sandwich and milk tea from Butterfly. Excellent sandwich and tea. Fantastic service!", "name": "Butterfly", "rating": 5}, {"index": 79, "review": "sweetest manager/customer service ever! loved my jasmine milk tea. my brother got the coconut milk tea and he enjoyed it as well. decorations and furniture are arranged in a colorful and spring theme- perfect for kids! would recommend this to anyone", "name": "Butterfly", "rating": 5}, {"index": 80, "review": "Jennyfer is always very friendly! They have Great drinks and lovely service! My kids love the snobubbles! The milk tea is always delicious. This is our go to for Boba!", "name": "Butterfly", "rating": 5}, {"index": 81, "review": "Perfect Banh Mi and tea after the Silk Road Ensemble concert at Santa Clara U. Don't forget to ask for the green waffle. It's not just for St. Patrick's Day anymore!", "name": "Butterfly", "rating": 5}, {"index": 82, "review": "Heard this place opened up near campus so I was excited to check it out and it did not disappoint. Super convenient location and totally worth the price. The staff is very friendly and the place itself has a cute & comfortable vibe. My friend and I got the boba and the meat & vegetarian banh mi and they were really good! boba was a bit sweet for me but other than that a new go-to spot", "name": "Butterfly", "rating": 4}, {"index": 83, "review": "This is the best place for Bubble Tea , Juices and Smoothies . Very tasty . Nice atmosphere , so welcoming , absolutely outstanding customer service . Great place for family, kids and friends.The lemon tea with boba was great as well Vietnamese sandwich . Must visit and try .", "name": "Butterfly", "rating": 5}]