[{"index": 0, "review": "We have ordered from New China Garden via Grubhub a few times now.  Food is always delivered quickly and hot!  Maybe that is due to our proximity to the restaurant (approx 3 miles).  It's an American Chinese food.  Ether than Panda for sure. \nWe have tried different items and have been satisfied with them all. Mongolian beef is tender and tasty. The Generals Chicken is mild with a tasty sauce - could be spicier.  BBQ pork fried rice is good with generous portions of pork. The dumpling filling is very good but the dough is a bit think for me. \nChicken Chow Mein has large pieces of chicken but is a tad dry. \nGreen Onion pancakes are the one . \nAll in all food is good, a bit pricy after delivery.", "name": "New China Garden", "rating": 4}, {"index": 1, "review": "The food served here is entirely lacking in flavor.  This may be appealing to some but it's unlikely the case for most.  The portions are very generous and the food is cooked well (perfectly crispy fried items and all the meats are tender) but other than by texture I couldn't tell the difference between the house-special fried rice and the lemon chicken.  We also had the BBQ pork chow mien and sweet & sour pork, no flavor.\n\nDespite the large portions I expected better for the price, dive restaurants can get away with a lot (lack of cleanliness, decor, rudeness, parking) but not with lacking flavor. \n\nWould love to see this place succeed, clearly family owned, hopefully they spice things up in the future.", "name": "New China Garden", "rating": 2}, {"index": 2, "review": "Ordered this in for dinner...total disappointment. Cashew chicken had no flavor and the beef with broccoli just tasted salty. Got excited about the egg rolls because they were nice and crispy but once bitten into, they were just mushy vegetables inside... Felt like they had been fried while frozen. No duck sauce for the egg rolls, just sweet and sour sauce (which is not the same thing). \n\nThe only things out of the entire order that were edible are the steamed dumplings and the green onion pancake They were pretty ok. \n\nHate leaving bad reviews but I'm pretty upset that after dropping more than $40 bucks on this I was still hungry because the food was so unbearably awful.", "name": "New China Garden", "rating": 1}, {"index": 3, "review": "Okay... \n\nI first have to disclose that I hold a strong bias when it comes to Chinese restaurants. For this spot its a positive okay. Its better than Panda Express but feels \"americanized.\"\n\nThere's nothing wrong with americanized Chinese food, but it doesn't fall with my pallet range of food I would consider amazing.\n\nI went their for lunch and got their Mongolian beef and house chow mein. Like I said in the beginning, it wasn't bad, but damn, no spice. The rice was spicier than the Mongolian beef.\n\nMy verdict... its a perfect place if you want an American Friendly Chinese Restaurant for anyone with a sensitive pallet.", "name": "New China Garden", "rating": 3}, {"index": 4, "review": "I am all for trying out a new restaurant based on yelp reviews.  This was just awful.  The orange chicken had zero taste of orange and the chicken was the frozen battered chicken that cheap places use.  \nThe Mongolian, I have no idea what world the chef came from.  What arrived was made wrong, tons of garlic and red pepper, when I asked for both to be left off.  Maybe I need to learn more but zucchini and bell peppers in the beef dish?? really??  Also there was only about 6 pieces of beef in the entire dish.\nI used a delivery service for the food and ratings on yelp.  Can't say i would ever order from here again.  Sorry folks.  But sometimes bad is too bad to take a chance on again.", "name": "New China Garden", "rating": 1}, {"index": 5, "review": "New China Garden is a family style restaurant with home style cooking and fresh ingredients, prepared in the authentic Chinese way. They have take out or dine in. The atmosphere is casual, clean; with a calming aesthetic ambiance. It's family owned and run . The prices are reasonable, if not a little cheaper than most Chinese restaurants. There's a real \"homey\" vibe to the place, as occasionally the locals from the Neighbourhood come in for their \" to go\" orders and chat with Bi, the  ever friendly daughter and host/ server, with an engaging smile that makes you feel welcomed ; or the mother, just as friendly; but not as visible . Because she's either in the kitchen or behind the counter. The father you don't see because he's in the kitchen preparing the food.\nLike I said this is family style home cooked food , not \"fancy shmancey\" pricey fair . But if you're hungry and especially if you have a family , or a special someone that you want to share some time with and have a nice intimate dinner with; then this is the place.\nI was in China last year and there's a difference between American influenced Chinese food and \"Chinese\"- Chinese food ! This is like the latter !\nTry the Beef Chow Fun, great ! ; or maybe the Mu - Shu pork. Soup? Try the Sizzling Soup ( yum ! ). I've got to stop ! I'm making myself hungry ! whatever you choose I'm sure you'll be pleased . \nSo if you're looking for good authentic home style Chinese food at  a reasonable price , check this place out !!\nAnd maybe I'LL see you there !", "name": "New China Garden", "rating": 5}, {"index": 6, "review": "I could eat at this restaurant weekly, the service is good, the food is fantastic! The prices aren't bad, the decor is old school and maybe could use some updating, but don't let that stop you from giving them a try", "name": "New China Garden", "rating": 5}, {"index": 7, "review": "I have come to China garden a few times because it is close to my school for lunch or special events. I am not a huge fan, here's why;\n\n1. The orange chicken doesn't taste orange and tangy. \n2. I ordered a lunch special and it was supposed to taste like honey BBQ and it tasted like soy sauce. \n3. My students weren't huge fans of the food and kids eat anything! \n\nUpsides;\n1. Service is fast\n2. Food is cheap \n3. The portions are good size", "name": "New China Garden", "rating": 3}, {"index": 8, "review": "Ick, portly prepared chicken salad w mayo?! A friend took me for lunch. Pot stickers are good.", "name": "New China Garden", "rating": 2}, {"index": 9, "review": "Great choices for vegans/vegetarians. They're always happy to make vegetable fried rice without egg for us. Food is delicious and not too salty. After only eating there once or twice they remembered our order the next time we stopped by and even recognized us over the phone based on our order.\nI love the garlic broccoli and Kung Pao Tofu.", "name": "New China Garden", "rating": 5}, {"index": 10, "review": "Do not order from here if you like your food fresh or edible.  This was so very disappointing. We Doordashed food.  Everything was drenched in oil and not the yummy kind of oil. The stuff left over in the 4 moth old fryer grease.  Everything was so overlooked it made me gag trying to eat it and my friends daughter remarked that it was baby food.  Order from China Delight or any other place. Avoid this at all costs.  Never will order from here again. :(", "name": "New China Garden", "rating": 1}, {"index": 11, "review": "Love the new owners. Kids always eat the staples of fried rice and chow mein. Wife and I rotate between mandarin chicken and orange beef.", "name": "New China Garden", "rating": 5}, {"index": 12, "review": "I'm not super picky, and I love Chinese food, but the food was not good. The sweet and sour chicken was just okay, a little bland. The reason I'm writing this review is because of the chowmein I received. It has almost no flavor, except a slight bitterness. It tastes like cardboard, and is way soggier than it should be. Basically over boiled noodles with a few raw green bell peppers thrown in. Iv never been so disappointed in a restaurant. I recommend any place over this one.", "name": "New China Garden", "rating": 2}, {"index": 13, "review": "Ordered  mushroom chicken & shrimp with mixed vegetables for takeout. Love the variety of crisp vegetables in both dishes. Flavorful & not too salty (like some Chinese restaurants). Pricing was reasonable.\nLooking forward to trying lunch specials here.\nParking was a bit challenging at this location.", "name": "New China Garden", "rating": 4}, {"index": 14, "review": "I have endured the food at the New China Garden twice.  The first time it was flavorless and the batter on General's Chicken and Sweet and Sour Pork was soggy and disgusting.  You had to eat a piece of onion or bell pepper with each bite or get no flavor.  Awful.\n\nThe second time, both meat dishes tasted like the meat was off.  We figured out it was probably the oil they cooked it in.  Same soggy mess with no flavor but the bad taste of meat gone off. \n\nEat Chinese anywhere else.", "name": "New China Garden", "rating": 1}, {"index": 15, "review": "This restaurant's location is under new ownership and the food went from \"OK\" to excellent. The previous restaurant was called \"China Garden Restaurant\" and the new restaurant is call \"New China Garden Restaurant\". So the reviews from the previous ownership are not relevant to determine if you should stop by.\n\nBelieve me, you should stop by.\n\nWe have tasted numerous dishes and they were all excellent. Not only that, we have experience the friendly conversation of the woman who waits on our tables. She smiles and welcomes us each time we stop by.\n\nFor vegetarians, there is a section of the menu dedicated to you. For health eaters, there is no msg added and delicious brown rice is available.\n\nFinally, the cook has no problem customizing the dishes. For example, we wanted a broccoli and tofu dish with a curry sauce instead of the sauce it normally comes with... no problem, and it was delicious..", "name": "New China Garden", "rating": 5}, {"index": 16, "review": "Good and bad!\nPrawns....Good!\nService....Bad!\nGioza...err pot stickers....Good!\nUtensils....Bad!\nWonton Soup....Good!\nSpare ribs.....Ok!\n\n*small fra la la la la A Christmas Story appeal.\nLove the Alameda upscaling. Wonder if this place will survive the long term renovation!", "name": "New China Garden", "rating": 3}, {"index": 17, "review": "This was pretty bad food by any standard. I tried wor wonton soup, that was quite plain. The chow mein was grey and tasteless. The spare ribs were very different than any others I've had from the many, many Chinese joints I've tried and were quite chewy but had the most flavor. The orange chicken was pretty flavorless and served with the sauce on the side. They certainly don't skimp on the portions, too bad it's so unappetizing. Certainly bummed out with my $60 delivery order.", "name": "New China Garden", "rating": 1}, {"index": 18, "review": "Second time I eat at this place to try my two favorite American style Chinese plates. The first time I ordered my all time favorite, some sweet and sour chicken with fried rice. I ordered a bit later than usual dinner time and found it weird that they only allow combo plates during lunch hours. They also only seem to have 1 size when ordering, ordering for myself I realized it was just too much food. As far as taste, having tried a few others in the area this is the best tasting in my opinion. Being in the area temporarily and being from the east coast, I wasn't used to the lack of Chinese restaurants here since we have them on almost every block back home lol. This one tasted the most like what I'm used to back home, and the few others I tried had food that wasn't even edible and I threw it out. As far as taste, it is a slight bit different but still very good, the sweet and sour chicken was tender and the breading not hard. The rice was good but a bit too much eggs used, but I could live with it. The dumplings and crab Rangoon were very good. Despite them serving a big amount and thinking I was going to waste most of it, In turn I found the food was really good still warmed up the next day. Tonight was my second time here and I ordered my second favorite plate, General Tso Chicken with pork fried rice. The chicken tasted good, again too much of an egg taste in the rice but it was good. Have some left over as I stated they give you single orders of everything and it is enough for about 3-4 people, the price reflects this as well. The price is a bit steep I paid $32 for this order for myself, but I paid more at another restaurant and the food was not edible, this food taste great so I feel it was worth it.", "name": "New China Garden", "rating": 4}, {"index": 19, "review": "Did they get a new chef or something? I've eaten there before a few months back and it was fine but last night's food was gross! The egg rolls were soggy and cold, the sweet and sour was flavorless and the shelf life of the vegetables used in the cashew chicken was questionable. My intention was to buy a couple items to enjoy over the next couple days but I just threw the rest out.  Will not be ordering from them again. :(", "name": "New China Garden", "rating": 2}, {"index": 20, "review": "Definitely time for an update considering my last review was nearly 3 years ago and ive been back countless times since.  \n\nMy boyfriend use to love this place since its a short distance from his house and he grew up knowing primarily just this chinese restaurant. He raved about this place time and time again before finally bringing me here. ever since we'd been together (2011), i had the opportunity to introduce him to many other asian restaurants, including those that are much more authentic and of superior quality. That might be why he no longer favors this restaurant lol. Occasionally, we still order here since it is the most convenient for us.  My gripe with this place is that i feel as if i always have to prepare myself for dehydration after my meal if i were to eat here.  It may be msg. Beside from that, it really isnt that bad of a place(taste wise), i just think i can get better at competing locations for matching prices.  \n\nI also find it a little odd that theyve changed owners a handful of times eversince 2011. Not sure if i should be a little concerned in regards to their food quality, since businesses such as this that dont do so well tend to serve old food.", "name": "New China Garden", "rating": 3}, {"index": 21, "review": "Restaurant has okay service , Food is very tasty love this location I'M 100% SUPPORTER OF A CASE SMALL BUSINESS RULES... Honestly I will not be complaining. Why ??? this is not ( Fogo di chao cuisine, Italian,zheck , burmese, new Zealand cuisine, French or Mexican restaurant. \n\nThis is Chinese. As we all know Chinese food is easy to prepare, not high quality of products. Of Chang restaurant wanted to make it happen\n ( Chinese gourmet cuisine.)  \nNop didn't happened.\nNot sushi etcetera.\n\nBut not because of this you should complain....Please deal with it don't come to small businesses and expect the Best and Excellent service for $6 dollars or $10 dollars you spend... Honestly you can't get 5 stars service. If you like that go to millionaire chain restaurant.  Any in Santana row. For example...\n\nI'm very upset all this people damage a lot of this small business for stupid reviews... I'm sure you don't even left a tip. But yes had all time in the world to complain... :-(        \n\nShame On  All of You.    \n\nBad yelpers I dislike you. 100% Losers.", "name": "New China Garden", "rating": 4}, {"index": 22, "review": "The absolutely worse Chinese food I have eaten in five years.  The Mongolian beef was 1/3 size of the chicken and vegetable chow mein I ordered. There was no real flavor, just onions and peppers.  You could taste the grease and the wings were disgusting.  I asked for a cup of sweet and sour sauce and was given a few ketchup packet size for sweet and sour.  I will never buy here again.", "name": "New China Garden", "rating": 2}, {"index": 23, "review": "Honestly people that choose to run their mouths and talk crap first off need to learn how to A. Know how to come for someone or B. check and learn how to articulate a sentence and or grammar. \n\nThis restaurant is amazing I've been coming there for years all the way from Union City which is about a 45min drive just for the food. \n\nTheir food has honestly been the best food I've ever had for Chinese American food. \nSome people are going on about authenticity which I don't get what they mean when Lemon Chicken isn't something you get if you go to China...\n\nTheir food is really good and their service is great. \n\nThis place is highly recommended. \n\nIt's way better then China Station and most other Chinese restaurants I've been to. But if you want something to trash talk just go eat at China Station and then get on with your reviews.", "name": "New China Garden", "rating": 5}, {"index": 24, "review": "Had a less than pleasant experience.\n\nordered online. \n\n30$ order.  First time I've brought food home from anywhere and all dishes were rather difficult to eat.\n\nDidn't seem fresh and the color was all greyish and dare I say mushy?\n\nNot like the pictures.  \n\nMaybe just a bad day for them when they shouldnt've been open?", "name": "New China Garden", "rating": 1}, {"index": 25, "review": "First time back since new ownership. All I can say is this was the worst Chinese food I have ever had and I generally will eat anything.  Bring back the previous owners!!  Our order included pot stickers (the only item that was half way edible),  crispy sesame beef, which was one of there recommendations, and was gummy and tasteless, cashew chicken (yuck) and the house chow mein (horrible).  Back to Blue Sky in Campbell or to Union at Union and Bascom", "name": "New China Garden", "rating": 1}, {"index": 26, "review": "Not a bad little Chinese restaurant. They offer your standard options and are pretty decent. Don't expect the best Chinese food ever but definitely a good option when craving some chinese.", "name": "New China Garden", "rating": 3}, {"index": 27, "review": "Love this small Chinese food restaurant,  looks hiding next to brick gym but very delicious food and great on service and prices.  Looking for fast food mmmm??  Look no further this is better and healthier.", "name": "New China Garden", "rating": 4}, {"index": 28, "review": "It wasnt horrible but wasnt amazing either. Im sure having to wait 1.5 hours didnt help it at all.", "name": "New China Garden", "rating": 3}, {"index": 29, "review": "Nice restaurant, remodeled recently, quick and fast service for take away dinner.... I am differently a repeat customer.  Pawns sweat and sour awesome and tofu kung pao the best :)", "name": "New China Garden", "rating": 5}, {"index": 30, "review": "I love this place! The Honey walnut prawns are so tasty, nothing is soggy, shrimp is not chewy. What we had today were\nCrab rangoons- they make them great here, although they changed the way they fold them, the ratio is just right. Ive had them barely full, all cream cheese, or fried for too long, or chewy....these crab rangoons are not that.\nSweet & sour chicken- white meat, not fatty, not soggy, veggies are cooked but still crunchy ( which i like ) vs soggy fully cooked that get nasty trying to reheat leftovers. Yuk\nMongolian beef- perfectly spicy where ur not gonna regret in the bathroom later, veggies same \nChow main- how can u screw up chow main? Flavor i guess... its not salty and its not bland either....", "name": "New China Garden", "rating": 4}, {"index": 31, "review": "Food is super flavorful and priced just right. Parking can be a bit of a challenge so take out is a good option. Their take out is always on point and I don't believe I've ever had an incorrect order. The egg flower soup is one of my favorites as well as their fried rice. The smoothies are a nice touch and nice and sweet. Over all a solid choice for Chinese take out in this part of the city. The only thing keeping this from 5 stars is the parking", "name": "New China Garden", "rating": 4}, {"index": 32, "review": "This is my little family's fav Chinese place. I'm pretty sure it's family owned and they probably recognize us by now. We always get the family style dinner. We get the \"Mandarin\" option and add a Chinese chicken salad.  The food is not gourmet by any means but it hits the spot. We have never been disappointed here and we come pretty regularly.", "name": "New China Garden", "rating": 5}, {"index": 33, "review": "I stopped in to give this place another try ,and it reminded me why i quit going there to begin with every thing was off,the chop suey was gooey and over spiced,and the won ton soup was over spiced more than i was ready for ,when i first moved here in 1983 i was going in there it was ok the owners were there since 1973 ,and every time i went and ordered the food was consistent,but in the last five years it has  gone down hill ,when i was there nobody came in to pick up to go orders or anything,it once was real busy and the staff was friendly,not any more there are signs taped all over the wall with so called specials kinda sad to see the place go down hill.", "name": "New China Garden", "rating": 2}, {"index": 34, "review": "I live a couple houses away from this restaurant and I would rather go to McDonalds and spend my money. Ive never wrote a review but after visiting this place I felt it very necessary.\n\nThe food is mediocre, the place is rundown (they constantly have dirty mattresses lying around outside), and the staff/managers have no customer service skills what so ever. If I could give this place a -5 stars I would.\n\nI have given this place 3 different visits since I live so close, and every time is a problem. I gave up when on my last visit we were told \"She can change the prices on the menu anytime she wants, she's the owners daughter\" EXCUSE ME?!?! That is illegal. The bill is written in Chinese and never adds up correctly. And when you try and ask what your getting charged for they don't answer but argue with you and throw the menu at you then tell you to figure it out yourself. RIDICULOUS!\n\nI could keep on ranting on on how terrible this place is or I could just tell you to STAY AWAY.", "name": "New China Garden", "rating": 1}, {"index": 35, "review": "My daughter and I come here regularly. Their food is good. Every time we come in we order 3 entrees, and two side dishes and pay about $30-35. It's a family owned place and the lady who waits tables is the sweetest lady. She always takes care of us when we come in. They aren't usually busy in the seating but we never come in for dinner time, and they do a lot of carry out. I definitely recommend this place for good Chinese.", "name": "New China Garden", "rating": 5}, {"index": 36, "review": "Wanted to give this place a chance.  We ordered and the food was honestly so,so.  The problem came when I got the bill.  The bill was like $8 overcharged.  I told them about it and they said the menu prices had changed.  \n\nWTH!?  Then update the prices!!  You can't just show lower prices then overcharge us.\n\nI then asked what were the new prices and was still over charged by like $6.\n\nThey said it was tax but tax was not that much.\n\nThey then told me they did overcharge me.  But only refunded me a partial amount of the $6.\n\nNot good.  Not going back.", "name": "New China Garden", "rating": 2}, {"index": 37, "review": "Gave this fast food restaurant a shot because of my close friend told me that this place has good big portions at a reasonable cheap price; I ordered my chow fun mix and lemon chicken. My friend ordered a combo with fried rice, orange chicken, and egg roll. The chow fun was pretty decent it has more veggies than what its supposed to have which is the noodles and beef/chicken. My lemon chicken didnt look like authentic lemon chicken. It was more like katsu chicken chopped with a bland taste of the lemon sauce. (The sauce was watery down and didnt have that lemon taste.) I was disappointed for the price came up to be around 10$ -15$. But the portions are in fact huge. I wasnt able to finished it because that reason and its lack of form and taste. Will I come back again? I probably wont but its good for a try decent mediocre fast food. If you ever want fast food chinese food and huge portions.", "name": "New China Garden", "rating": 2}, {"index": 38, "review": "Pretty mediocre, at best.\n\nIt's too hot today (100°F)  so I'm lazy to write a full review. Just avoid this place and will not be disappointed.", "name": "New China Garden", "rating": 2}, {"index": 39, "review": "Food was good, almost great...TV + Waitress was were annoying. I just moved to the Bay Area + aren't familiar with the nuisances of Asian Culture. I do genuinely give respect, & try to look for the Gold in everyone however. I do understand when a person is selfish, & greedy. She was focused on the loud TV for herself. And gave us an inflated bill for 6 dishes like doubling the average 6.95% TAX. Ok, I get it but the haggling over her own mistakes, & irresponsibility to honest & clear got old fast. She did her \"boiling frog\" routine to a tee. My temperature kept rising, + my guys were irritated by the pettiness. Expect to leave full, & unhappy. Won't go back.", "name": "New China Garden", "rating": 2}, {"index": 40, "review": "Though the place itself could use a bit of revamping, the food itself is delicious. I love how they offer different plate combinations and you can substitute items. The few times I've been here, the food is always consistent and yummy. The food is hot, fresh, and cheap. I've never really eaten there, but as for the take-out I always get my order super quick. Overall, cheap and deliciously prepared Chinese food.", "name": "New China Garden", "rating": 4}, {"index": 41, "review": "Avoid. Probably the most tasteless war wonton soup I've ever eaten. Unfriendly service. What a shame. Ice to go there all the time.", "name": "New China Garden", "rating": 2}, {"index": 42, "review": "The prices for this restaurant is pretty cheap.  Lunch here is not bad.  The mongolian beef isn't as good as panda's.  The people there are pretty friendly, I believe it's a family ran business. The young girl behind the counter is nice, though I had better chinese food.\n\nps. Attn: Yelp, you better not filter any more of my reviews.  I'm a real person who spend extra time to write reviews of places I like and dislike.  Fix your darn filter if you think it is broke, because as I been reading you get many people angry for filtering some their honest reviews.  Readers read this web site:\n\nwww.yelp.com/topic/los-gatos-i-dont-get-yelp-filters\n\nIf this fall into a filter because I posted a website, then yelp has many issues to fix.", "name": "New China Garden", "rating": 2}, {"index": 43, "review": "They changed owners a few years back and it went downhill. Last time I ate there the food was so nasty my kid threw up at the table. The waitress yelled \"you leave now\" and I haven't been back since.", "name": "New China Garden", "rating": 2}, {"index": 44, "review": "Horrible service.   And apparently they no longer do delivery.   The waitress  said they have not offered delivery in 4 years  however there are reviews from only days ago that review their delivery service.", "name": "New China Garden", "rating": 1}, {"index": 45, "review": "I ordered chow fun and Mongolian beef for pick-up. Why does it taste like it's two days old?", "name": "New China Garden", "rating": 1}, {"index": 46, "review": "The food here is so good! We just finished with our dinner and everything we had was great.....would highly recommend.", "name": "New China Garden", "rating": 5}, {"index": 47, "review": "This place sucks. You have to go through a third party for a delivery order. They charge you a delivery service fee, gratuity fee, and then the third party charges you a fee for their service. Twenty dollar bill goes up to be a forty dollar bill. What makes this restaurant even worse is the customer service is horrible and they don't even have what you ordered.", "name": "New China Garden", "rating": 1}, {"index": 48, "review": "Best place ever! They have the honey walnut shrimp which I definitely recommended and the broccoli beef. Also their beef fried rice is the BOMB. I would always go here with my bf and his parents and we never get tired of gettrrhe same food. They also have great service as well. Its a family owned restaurant which I think is nice. Not much who come to eat, I see people mostly do take outs", "name": "New China Garden", "rating": 5}, {"index": 49, "review": "Ordered by phone and went in to pick up order Pork Chow Mein, Garlic Shrimp & beef Broccoli. Before this place was sold I had been ordering for years the food was great. Now the food is of poor quality the Pork was very tough and no flavor to anything. I will never go back again. There was no one in the restaurant maybe that should have been my first WARNING.", "name": "New China Garden", "rating": 1}, {"index": 50, "review": "Ordered food for delivery thru Eat24. They showed up over 2 hours after I placed the order. The Eat24 people called them over 5 times to see where they were and why there was such a delay and each time the restaurant told them they were \"on the way\" or \"5-10 minutes away.\" This was a load of crap. 2 hours is insane. I asked them what took them so long when they finally showed up to my door (after 2 hours) and they had nothing to say. Literally. Didn't say a damn thing. No apology, no excuse, nothing. The only redeeming thing about the experience was Eat24 giving me a refund. \n\nNow the food (which did eventually come after 10pm after 2 hours of waiting)\n\n1. food wasn't hot, tasted like it had been sitting around for 2 hours. Wonder why. . . ?\n2. Shrimp in lobster sauce: Shrimp had a strange texture in half of them. Kind of grainy? Not sure how to describe it. Needless to say I ate a few pieces and then threw in the towel. The sauce was bland. *side note, this is a dish I have eaten since I was a child so I actually know what it's supposed to taste like and this wasn't it.\n3. Sauteed asparagus with chicken in black bean sauce: the chicken was decent quality, on par with what you'd find at any Chinese restaurant. The asparagus was a little under ripe, but overall good. The sauce was WAY TOO SALTY. I realize that black beans are inherently salty, but this was insane. I cook black bean sauce myself so I know it's possible to make it less salty. I felt like all of my insides were drying up while I was eating.\n4. Wonton noodle soup: this was the best thing I received, but it wasn't one of the best I've had. The filling was a bit too peppery, which was a bit strange and surprising. The wonton skins were good texture, the broth was decent, but the filling killed it.", "name": "New China Garden", "rating": 1}, {"index": 51, "review": "I went there for the first time on Friday with my husband and it was very good. Sweet and sour pork was nice and tender not at all over fried like a lot of places these days. The honey walnut prawns were ok...a little more sauce was needed but still good. We will be back!!!", "name": "New China Garden", "rating": 4}, {"index": 52, "review": "As it has been said before, this place is a bit of a hole in the wall. I mean, I wouldn't be surprised to see it on Restaurant Impossible with Robert Irvine. The times that I've ordered from here the food has been pretty good, for the price. I guess what really irked me on the whole experience is that I saw an employee making dumplings on one of the common tables. In between dumplings the lady would wipe her hands on a dirty/crusty apron that she had around her waist. Just made me wonder too much about what else might be going on that the customer doesn't see. So yeah, I would suggest ordering delivery, or send someone to go pick up the food who doesn't get bothered by the state of place.", "name": "New China Garden", "rating": 3}, {"index": 53, "review": "At the request for a chinese food fare from my friend, I got there for lunch and ran out of time to eat in. Minus one for speed of service, they were not even half full. Slooooww service. \nWe ordered two lunch specials to go. \nNext time I am going to ask them to go easy on the salt, way too salty for my hypertensive taste buds. \nPriced right a good portion of \"large\"(not huge) shrimp both in lobster sauce and in fried rice. Great value in ordering fried rice or chow mein in place of steamed rice, as they are offered as a side entry rather than a side dish for a buck or buck and a quarter. \nI have too many offerings nearby to consider this place again", "name": "New China Garden", "rating": 2}, {"index": 54, "review": "Ok, the place is a hole-in-the-wall, but sometimes the best food comes out of these places. I used to come here eons ago, and it was a good place. But then It got bad, very bad....tiny salad shrimp bad. But about a month ago, I was checking out the antique shops across the street when I decided to give it another try.\nThe place looked worse than last time.\nThe fish tank was gone.\nThe live lobsters were gone.\nThe smiling servers were gone, replaced by servers who had yelling matches with the kitchen staff.\nBut the food ROCKED! So we order take-out here whenever we are in the mood for Chinese. \nThey even have yummy pork buns!\nAnd very yummy Chow mein!\nI am hoping to try more of their dishes before my diet begins!", "name": "New China Garden", "rating": 4}, {"index": 55, "review": "My roommate has shared food with me from here before and it was always good so I tried it for lunch take-out.  I ordered by phone and my food was ready in the 15 minute quote I was given.  The food was fresh and plentiful with lots of good flavor!  I love beef and broccoli and this is probably some of the best I have had.  I gave 4 out of 5 stars because the only thing I did not like were the egg rolls -they tasted weird to me- and are my sisters favorite so they have to be good when we go to a place!  Parking is kind of a pain but that didn't take away from the good service and yummy food!", "name": "New China Garden", "rating": 4}, {"index": 56, "review": "2 stars because they deliver. and because they're actually reallyreally cheap.\n\nI should have seen that there were only 15 reviews on this place so i shouldn't have taken the 3.5 stars to heart as much as i did...First of all, I ordered in ADVANCE (at around 11am) because my friend and i had a specific schedule of when we needed our food...the food was supposed to get to my apartment at 5:15pm. When did it actually arrive?? 6:35pm!! YOU'RE KILLING ME SMALLS! I had to call not once, but TWICE to ask where the hell our food was.\n\nNow on to the food...\n\nChow mein- Blegh. very dry. very bland. not yummy.\n\nGeneral Chicken- The first few bites were okay, a lot of extra batter and very soggy. Also, the chicken had a weird flavor to it\n\nPotstickers- If i had only gotten these i might have actually given them 4 stars!! they were that good. They taste similar to Xialong Bao (shanghai juicy dumplings MY FAV)\n\nCrab Ragoon- THEY WERE COLD by the time the delivery guy got to my place. UGH. but they tasted aiight. the sweet and sour sauce was super gelatinous and funky.\n\nI probably will never order from here again which SUCKS because it's the only place near me that delivers cheap chinese food :( BOOOO.", "name": "New China Garden", "rating": 2}, {"index": 57, "review": "The worst Chinese food ever!  This place is seriously trying hard to make Chinese food look and taste horrible.  Tonight I had orange chicken and my friend had general's chicken.  Both had oil-logged (soggy) chicken and very bland tasting sauces.  The fried rice had no seasoning and the crab ragoons were filled with nothing but plain cream cheese.  All of the food arrived cold and I feel as if I just threw money away for nothing, seriously one of the worst meals I've had in a long time.", "name": "New China Garden", "rating": 1}, {"index": 58, "review": "The chicken felt very rubbery... And awful! Worst experience EVER for the asking price... The Thai tea needed more flavor... It was really watered down... Worst experience EVER! In contrast, the portion size was excellent...", "name": "New China Garden", "rating": 2}, {"index": 59, "review": "This is the first Chinese delivery place we ordered from after moving to San Jose. I hope there are better ones nearby. The food was decent but not outstanding, portions were big, but there were a few fatal flaws. They left off a piece of our order, and it was too late to call back and have them redeliver. We also found a small rock in the food. Not good.\n\nDelivery was fast, if not accurate, but I'll keep looking.", "name": "New China Garden", "rating": 2}, {"index": 60, "review": "Honey walnut prawns were awesome! Chow mein was ok. Any of the sweet n sour pork, chicken, or prawns n chicken salad was no good. Don't waste ur money on these things. Haven't tried anything else from the menu tho. Prob won't be back. :(", "name": "New China Garden", "rating": 2}, {"index": 61, "review": "Mediocre Chinese food. I ordered vegetable fried rice, vegetable chow mein, and vegetable tofu. The fried rice was old, hard, and barely had any vegetable at all in it. It was just a huge box of rice. The vegetable chow mein was ok. Nothing spectacular. I've had better at other average Chinese food places. The vegetable tofu was, again, mostly tofu. Where are the vegetables?? If you're a vegetarian like myself, that's what you want the most of! Don't go here. There are a lot better places to get Chinese food within a mile of this place.", "name": "New China Garden", "rating": 2}, {"index": 62, "review": "I love this place, I've been coming for 20 years it's still good... I actualy brought my girlfriend here, who knew? We now been married 10 year ??  \nFor all you old romantics, it's probably in the tea.", "name": "New China Garden", "rating": 5}, {"index": 63, "review": "Best lemon chicken Ive had. I order the sauce on the side I dont like it soggy and they always get the order right, the flavor is the best. I havent been in awhile and need to go back to.....", "name": "New China Garden", "rating": 4}, {"index": 64, "review": "I have been to this place a couple times. I have tried their lunch specials, which as I remember, were attractively priced. But the food itself, was not very tasty. Well, not tasty enough to remember anything special about it.  It was certainly edible, but it never gave me a reason to return. \n\nIn fact, I drive by this place all the time on the way home from Valley Fair. I am just so indifferent to this place. If I ever feel hungry, I always end up eating at other neighboring restaurants like Pho Lynn or Gulzaar Halaal Restaurant.", "name": "New China Garden", "rating": 2}, {"index": 65, "review": "Love it!!  \n\nThe first time I went, they had my food ready in 5 minutes.  Great flavor - I'm a big fan of Chicken & Broccoil (with white sauce) and they have this ma-po tofu & veggies that has an amaaazing spicy sauce.\n\nHave gone twice this week - great food, great service.  Not in the best area, & nowhere to park though.", "name": "New China Garden", "rating": 4}, {"index": 66, "review": "Probably my favorite chinese food place.  Not fancy, but good stuff.  Prices have raised a bit over the years, but so has everything else in life.  Always quality stuff here.  Hot & Sour soup is always great...not too heavy.  Clay pots are great...especially the tofu ones.  Best potstickers.  Haven't had a bad thing yet.", "name": "New China Garden", "rating": 4}, {"index": 67, "review": "No flavor, old food. Found a piece of metal in the rice. NASTY AND DIRTY", "name": "New China Garden", "rating": 1}, {"index": 68, "review": "I ordered sesame chicken, chicken fried rice and veggie eggrolls from this place.\n\nThe sesame chicken had sesames on it..................and that's where the similarities end. Sesame chicken is supposed to be sweet. This had more of a salty taste on it. Like they didn't put any sauce on it.\n\nI had to actually put sweet and sour sauce on it to make it taste good! Very bad.\n\nThe chicken fried rice was decent but that's pretty hard to fuck up.\n\nThe veggie eggroll was shaped all weird, but it was surprisingly good.\n\nWill definitely not visit again!", "name": "New China Garden", "rating": 2}, {"index": 69, "review": "Wow their website is so cool! My mom asked the young man at the place when she picked up our takeout if he had designed it (he had). My mom had planned on just ordering soup, but when she saw the cool online menu she decided they must have changed owners from the last time we dined in and decided to order are whole dinner as a New Years treat.\n\nWor Won Ton Soup: WOW! PACKED with big pieces of obvioulsy fresh veggies. The won tons were also good and they didn't skimp. I found a *small* piece of bone in one, but I understand that can happen so it's no big deal. I devoured my big bowl of soup happily.\nHouse Fried Rice: Yummy but nothing super special. Taste the same as any other good chinese fried rice.\nHouse special BBQ beef: Eh. The meat is tender and of good quality but the sauce is a little weird (both in taste and texture). Wouldn't get this one again.\nChinese Chicken Salad: Decent. Lighter on the dressing then most places and not as sweet (more citrusy). If you think most places are overkill on the dressing then you would like this one, but personally I LOVE lots of dressing. Good size pieces of really good white breast meat.\n\nThis may just be our new Chinese place in favor of Blue Sky.", "name": "New China Garden", "rating": 4}, {"index": 70, "review": "Everyone need a good Chinese take out place nearby, and this one has been my favorite place for the past 4 years. Quality of food and service have been consistent and price, I can't complain.\n\nWhen I am coming home tried from work, when I don't have anything to eat in the fridge, when I don't want to cook, when I have guests from Japan who wants to eat American Chinese food, I order their good and very reasonably priced Chinese food and makes everything okay.\n\nOur favorites are Sweet and Sour Chicken, Kung Pao Chicken (it is spicy!), Mongolian Beef (super spicy!), Shrimp with snow pea and BBQ pork fried rice. 3-4 items for about $25-30 and that is enough for 2 people for dinner and lunch next day.\n\nTonight the fortune cookies told us that:\n\"Our first and last love is self-love\" (me) - maybe I need to give myself a little time off!? I can go to a spa or pedicure soon....\n\n\"You are independent politically\" (my fiance) - \".....huh??\"\n\nI like the fortune cookies. They are so random.\n\nOrder ahead for pick up and food will be ready within 15 minutes, always. They started to do delivery for $20 or more, within 5 miles... haven't utilized that service so can't yelp about that, yet.", "name": "New China Garden", "rating": 3}, {"index": 71, "review": "I'm a huge supporter of family owned businesses, which this place is.\n\nHad them deliver to my place for the first time yesterday and was not disappointed.  It did take longer than expected to get here, but rush hour traffic was a factor and the food was still hot when it arrived.\n\nThe crab ragoon was the standard -- crispy and golden with just the right amount of cream cheese, crab filling and scallions.  Skipped the sweet and sour sauce.  It smelled a bit off, but that may have been my imagination.\n\nSalt & pepper fried calamari was beautifully nestled in the box with hot peppers and garlic in addition to the salt and pepper seasoning.  They left this box open so the dish wouldn't get soggy.\n\nFrom their dim sum selection, I chose the pork buns.  Nothing new or exciting here, just hot yummy slightly sweet steamed buns with savory sweet barbeque pork inside.\n\nThe potstickers were flavorful and did not require dipping sauce at all.  Skins were the perfect texture and thickness that provided a bit of chewiness. yum! \n\nLastly, when asking the gentleman over the phone whether he'd recommend the Szechuan fried fish fillets or sauteed sole with broccoli, he gave his honest opinion and said he'd pick the sole as it was healthier.  He was right on and this was one of the best fish dishes I've ordered.  Lightly sauteed in a sauce with slivers of ginger, scallion, and garlic, the fish stays firm, moist and tender.  Broccoli stayed crisp and accompanied the fish well without overpowering it's delicate flavor.\n\nI would suggest calling the restaurant directly over ordering online as their option to deliver is not always available.  Also keep in mind portions are generous.  The entire order above was for me alone and I had plenty of leftovers for lunch today.  My total came to $33.50 and delivery was free!\n\nWill definitely order from China Garden again!!", "name": "New China Garden", "rating": 4}, {"index": 72, "review": "I got the vegetable fried rice 2 days ago. yesterday i was heating left overs and noticed  something strange looking in my plate , so i pulled it out of the rice. It was a bug. Looks like a baby cockroach. Not sure how to report them to the health department but I'm working on it. when i called the restaurant to complain the employee Cindy would not let me talk to the owner, and at first pretended not to understand English . Then when she saw i was clearly upset , she suddenly understood English and told me to come in and bring the bug and they would give me $5. It wasn't the point of the money, its the point that you have bugs crawling into customers food. She did not even apologize, nor even deny that they have bugs !! I ate that rice the first night i bought it, for all i know i ate more bugs then- but didn't even notice.i have photos but yelp wont let me add them due to \"invalid format\" which i dont understand since they are just cell phone photos. If i can get the site to allow me to post them then i will.", "name": "New China Garden", "rating": 1}, {"index": 73, "review": "Once again - I want half stars! ...3.5 would be my vote if it was an option.\n\nThe bf has been here a few times, me only once and it was take-out. I liked the war wonton soup, the actual wontons themselves had a nice flavor. Only 2 shrimp in a big huge container, but that's not too uncommon. They apparently have 2 chinese chicken salads ~ I had the 'new' version and it was good and a bit spicy -yea! (chinese hot mustard spicy). The chicken was all tender white meat and the ingredients were fairly fresh considering the fact that I was probably their last customer on a Sunday night. \nThe bf liked his Mongolian beef, he said they actually made it somewhat spicy as it should be!\n\nThey were very nice when I had to run back in for a 3rd fortune cookie (the dog gets her own)\n\nIt seems to be good basic chinese food, nothing grrrrreat, but A-Ok!", "name": "New China Garden", "rating": 3}, {"index": 74, "review": "I was really craving for some good Chinese food since I moved here and thought HEY since they're in the FOOD TO YOU menu this place must be really good!! WRONG!! The honey walnut prawn was BRUNT!!! Yes burnt.  I placed an order for pick and and who would know they would FORGET one of my orders.  I call back and he's like I don't have that down.  Well what did you have down? Brunt honey walnut prawn with out the mayonnaise sauce? Sad that Panda Express' honey walnut shrimp tastes way better! I also order the chicken chow fun.  It was so so.  I have had better.  I really enjoyed the chicken and snow peas.  Tastes similar to what I would make at home. Would I recommend this place? NOPE!! I wouldn't order from this place again!! For the people who have gone there for YEARS, this must be the only place you guys have got accustomed to. Boo hoo!!", "name": "New China Garden", "rating": 1}, {"index": 75, "review": "It's your typical Americanized Chinese restaurant, but hey I love it, especially when you get fresh cooked to order food at the same price of nasty Panda Express. The lunch plates are under $10 dollars, and you have some seriously good portions. I had the lemon chicken with pork fried price ($1.00 for fried rice of your choice) for $6. 00. It wasn't greasy and just had the right amount of sauce. The chicken had a breaded crust, but it was sliced to show how much the chicken overpowers the breading. So good. \nThe place is a definite hole in the wall, hell the decor I'm pretty sure hasn't changed since the 70s, but whatever, it builds character to the restaurant. You know that this place is focused on the food.\nI definitely recommend this place, especially when you're a broke college student wanting a filling meal that isn't fast food.", "name": "New China Garden", "rating": 5}, {"index": 76, "review": "I love this place, and have been going here for years.....i go here every time i'm in the mood for chinese, and I dont like any other place....waay bettr than panda express and it's really close to my house.....", "name": "New China Garden", "rating": 4}, {"index": 77, "review": "well. so i don't feel well, and didn't feel like going for pick up. reading yelp reviews decided to give China Garden a try; ordered online\nDelivery was very prompt, guy was at my door in about 15-20 minutes, so far, so good.\nNow that's where 2 starts come off. i ordered Mongolian beef a-la-cart, i got \"luch\" version of beef & rice. out of all the beef that was there, 80% was vegetables. not really what i was hopping for. hot n sour soup was OK, can't say that it was best i ever had, just ok.\n\nSo overall, food was edible but i don't think i will be ordering there again.", "name": "New China Garden", "rating": 3}, {"index": 78, "review": "China Garden is a bit of an enigma. For years, we only viewed it as a basic take out place--good chicken salad, egg rolls, etc--but recently they have upped their in-restaurant dining experience. The changes? First off, the booth tables are now open to diners, instead of being taken by staff reading papers or working on food. Second, good table service from helpful waitresses. This is a big improvement, although the food remains pretty darn good, otherwise. One thing to point out:  China Garden has great jade-colored concrete bricks that dorn the inside an strike a wonderful 1960s design theme: this place has vintage as well as value appeal.", "name": "New China Garden", "rating": 4}, {"index": 79, "review": "Nice people, but bad, greasy, Americanized Chinese food. Milpitas and Cupertino and pretty much the places to go for Chinese -- I haven't had much luck in San Jose proper.", "name": "New China Garden", "rating": 1}, {"index": 80, "review": "I love this place! The owner and the waitress are very friendly, and their menu serves a variety of Chinese food. Usually I go to other Chinese restaurants and their foods were either too salty or too oily... But China Garden's food, especially their chicken wings and Szechuan chicken are YUMMY!!!! Soup wise I would suggest their \"spicy sour soup\", the best in San Jose!!!! I heard they have Chicken Salad, I will definitely try that next time!!! Afterall, I have to give this restaurant a FIVE starts!!!", "name": "New China Garden", "rating": 5}, {"index": 81, "review": "I'm torn here - the General Chicken was great - good quality breast meat, tasty sauce, not oily, great batter - crisp and obviously fresh and well made.  The pork fried rice was yummy and had that nice seared flavor I like.  And the decor reminded me a lot of awesome Chicago dive chinese places - I dig that stark naugahyde and washed out reds with brass and mirrors.  I'm cool with all that.  \n\nWhat was not cool was the complete horrible travesty that was the eggrolls.  I've been eating chinese (ok, chinese-ish) food for 30 years and I've never known a chinese restaurant (even MALL horrible chain chinese) food to f*** up egg rolls.  I mean, sure, there have been places where the fillings were a bit suspect, but HOW DO YOU MESS UP THE WRAPPER?!?  I don't know how its even possible to make this happen to an egg roll wrapper.  I've even made some at home and they didn't suck like this.  BECAUSE I BOUGHT EGG ROLL WRAPPERS - its not rocket science.  How to describe.....  It was weirdly rancid and flaky and didn't hold its shape at all and it was burnt and then the inside consisted of some carrot and cabbage, but they were already cooked before hand or something and it just makes me sad to even think about.  It was almost like a messed up sick a$$ tempura, but that can't possibly be what it was.  It confuses me.  \n\nHahaha - my friend (a waitress) asked if that's the way they were always cooked.  She was being politic and diplomatic.   I said cause they were REALLY BAD!  But the waiter was good and took them off the bill, so he got a 25% tip.  :-)  Never punish your wait staff for the sins of the chef.  Unless of course they cop attitude.\n\nOh, and the free soup was too fishy tasting for me.  But that's entirely a personal preference and I don't think that meant it was bad.  And since it wasn't something I ordered, I didn't care.\n\nThis was no Chef Chu's, but the main course was good enough and it was inexpensive for lunch.  I do regret I didn't get to drink a cocktail, because it struck me as the kind of place that might have a good umbrella drink.", "name": "New China Garden", "rating": 2}, {"index": 82, "review": "It's unbelievable how great their lemon chicken is! You MUST try it! Another thing that i liked the most is their appetizers, especially the Honey Walnut Prawns, pot stickers, and fried prawns. They are unbelievable delicious and under a decent price. I think it's a good place to take out or dine in! Good food under decent price. \n\nThe egg rolls didn't look as pretty as other restaurants. But, i went back to the restaurant lately and saw that they changed the style to make the egg roll. They look more beautiful and much better in taste! It's definitely worth another try for these egg rolls.\n\nWhenever i'm hungry and feel like eating Chinese food, this restaurant is the first one that came into my mind! The customer service is good too! I can't say anything more, just try it out!", "name": "New China Garden", "rating": 5}, {"index": 83, "review": "LOVE LOVE LOVE THIS PLACE. I was craving the Wor Won Ton soup the other day so I had to stop by. This is the only place that actually puts \"flavor\" in their broth. I did notice that the won tons were a little smaller than normal. I've been coming here since I was 18 years old. (very long time) This is where I would take my special dates;) back in the day. I would not consider this a hole in the wall. I would say average. They have re-modeled the place and it does look nice. Hole in the wall.. That would be down town San Jose. To my surprise they actually had a new waitress after all these years. I was shocked not to see the same two gals. The new waitress was very attentive and bubbly. So she got a nice tip. The prized House Fried Rice Never and I mean Never lets me down. I love that smoky flavor that no other restaurant can compete with. They have two sizes of shrimps in their fried rice small and medium..hey were in a depression and thats alright with me as long as there is Flavor...I will always travel here to eat as long as they are open. I was 18 yrs old when I used to frequent this place and now I bring my 17 yr. old son to have dinner with dad.", "name": "New China Garden", "rating": 5}, {"index": 84, "review": "I have been going to this place for 20 years. I would suggest eat in, the food tastes better there than take out. The food is very consistant and tastes great all the time. Its a great place to have chinese food.", "name": "New China Garden", "rating": 4}]