[{"index": 0, "review": "I want to start this review by going over some of the things for the last year that people have really been upset about.\n\nThe biggest issue seems to be that this fast food self serve restaurant does not give free cups of water and that if you want a carry out box or extra napkins there is a small charge. They also mentioned that they only allow one refill on the soda. They consistently bring up the rude counter people who get the order wrong and won't make it right. \n\nI am not here to dispute these claims or defend the owners of this franchise. As an Elite Reviewer, who previously reviewed the L & L in Campbell (5 Stars), I want to review this restaurant in a fair and impartial manner.\n\nThis restaurant is a family run franchise going on it's 11th year. It is located in an expensive rent shopping center near Target off of Coleman Avenue, a very busy area. \n\nIt is always busy, especially during lunch time and in the evening. The prices are VERY low. An average meal with beverage is under $10.00.\n\nThere are usually long lines and if you have hesitation or not sure what to order, they will take the next person in line (I have witnessed this). They charge less than a dollar for cold bottle water and a fountain drink (with 1 refill) for under $2.\n\nMost places charge a higher price to compensate for the extra refills, water cups and extra take out boxes/napkins.\n\nI don't have a problem with this as I have seen this at other low priced fast food restaurants before. Most donut shops do not give free cups of water. This is not a full service expensive restaurant.\n\nNow for the food. I have tried many dishes, including the chicken dishes which are high quality dark meat with a marinade (not greasy). The Garlic Tilapia is amazing and my favorite is the home made macaroni salad. I usually order another side for $1.50. My average bill, including beverage, extra side and a bottle of water is under $14.00. The rice is always perfect and the quality and preparation far exceeds many expensive restaurants I have experienced.\n\nThe restaurant is very clean and I have never experienced (nor heard) any rude service from anyone. I also understand that if a customer does not get what they want, they will be upset.\n\nI HIGHLY recommend this restaurant.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 1, "review": "ATTENTION:\n\nThis L&L has terrible customer service. You can tell the manager is failing in her business because they don't allow returns and exchanges. She said once the ticket is sent to the cooks there are no returns. \n\nI ordered a plate and questioned the cashier whether he was charging me for the right size plate. He swiped my card before confirming what order i received. \n\nThere was enough time for the cashier to pull the ticket but because the manager was wasting time talking to customers she said it was too late.\n\nEven the cashier seemed scared to offer me the refund, which means she probably puts too much pressure on her workers to save a little bit of money.\n\nWill never go back here and I'm not editing my review. Good luck in your business", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 2, "review": "I have been here several times since my last review and this L&L has defiantly gone downhill.  Last time I was here, I asked the cashier if I could sub kimchi for one of the sides and the cashier just laughed in my face.  He was like ha ha ha no.  What the heck!?  I am perfectly fine with paying extra, but don't laugh in my face about it.   Seriously?  I should have not even continued to order after that.  Plus like many others have said before, this location doesn't give out free water cups, like other L&L's do, so you are forced to buy an expensive bottle of water if want water.   Also, it doesn't matter how busy the restaurant is, service is always slow.\n\nI defiantly don't recommend this restaurant.  There are many other Hawaiian restaurants in the area that are a lot better than this.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 3, "review": "L&L is good sometimes when you wanna gorge out. Not the healthiest food, but I do like to get their bbq chicken or chicken katsu from time to time.\n\nWent to this location for lunch today. The food is like any other L&L I've been to. Fairly consistent I find it.\n\nI usually take it to-go, but today decided to eat in. What struck me as odd is that when I asked for a cup for water they said they don't offer it. You can only buy a water bottle for a dollar. I had to look it up and it's not against the law to not offer free tap water, but I found this quite odd and off putting. Even the movie theatre who are notorious for their extravagant concession prices will still give you a small cup for water. I wouldn't even be mad if they said they'll charge me a dime or whatever for a cup since I'm using their supplies. Just a heads up to anyone coming here for lunch.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 4, "review": "Question: When you eat somewhere with loved ones, does that restaurant make you feel like you're in detention?...\n\nThen you haven't been here. The \"Rules and Regulations\" list includes (but certainly not limited to) the following...\n\n- 1 hour before closing, all exterior lights (including \"open\") are shut-off.\n\n- One refill per customer, no water is available on tap.\n \n- 2 napkins and 1 fork is all you're allotted to take and any extra are subject to charge.\n\n- Extra Katsu sauce = 0.75 cents\n\n- The wait times average 13-17 minutes.\n\n- If it's 1 hour or less before closing, you're told \"we're doing to-go only okay?\" as a greeting.\n\n- All dining chairs and tables are not available to use if you come 1 hour or less before closing.\n\n- Extra condiments, refills of soda, napkins, etc. will result in a scolding and penalty fee.\n\n- Not a customer? Be ready to be asked to leave and don't ever ask to use the restrooms, either.\n\n- Treat this place like royalty, after all, it's an honor to have rude customer-service employees serving you.\n \nIf you're looking to sit and enjoy your food like a normal person, that is nearly impossible here. I've come here dozens of times, but enough is enough.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 5, "review": "My first time trying Hawaiian Barbeque since the office was craving it for lunch one day.\n\nI got the \"healthy\" chicken combo, comes with brown rice and steamed veggies. Couldn't say I was a fan. Dark meat is used, and I'm not a fan of dark meat. The amount of oil on the chicken was also ridiculous, i had to pat down the chicken with a napkin before every bite. Thankfully the veggies were steamed, so I ate of all that.\n\nThe place is clean and the staff service is ok.\n\nI don't plan on coming back.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 6, "review": "Really rude right off the bat,  followed by mediocre food.  The kicker?  I was going to take my food to my dogs and was made to pay 57 cents for a to go container and bag.  Food was thrown together and not very appetizing! The Asian lady had the audacity to ask me what I needed the bag and container for.... I replied since I paid for it,  none of your business!! Won't be back!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 7, "review": "The food is fine - normal Hawaiian bbq chicken with rice and macaroni salad.  Be ready for slow service.\nAnd what's really lame is that I can't get a cup for water. \n\nMe: 2 cups for water\nCounter guy: we don't have water\nMe: really, you don't have water in the soda dispenser? \nCounter guy: no, but you can buy a bottle of water\nMe: fine, just give me two cups for soda\nCounter guy: these cups? \nMe: Yeah \n\nMe at the dispenser: hmm, this sure looks like water.\n\nPreferred if they didn't lie about not having water. Just tell me that I can pay whatever $$ they want for a bottle of water or I can pay $1.99 for a soda cup and get water (or soda) from the dispenser.\n\nAnd by the way, sign on the dispenser says you only get one refill.  ONE REFILL for $1.99.  \n\nWalk across the parking lot to Trader Joe's and get that $0.17 bottle of TJ's water.  Or better yet, just go somewhere else.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 8, "review": "The several times I've been there, the meat has had a tendency of being rather dry.  What's particularly off-putting and finally made me stop going to this franchise is how they put up all the chairs and begin cleaning an hour before they close.  \n\nAs a customer, it didn't make me feel welcome.  I felt more like a nuisance, someone who messes up their restaurant and keeps them from going home on time.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 9, "review": "This review is overdue, every other review is right. The customer service here really does suck AND they really are so cheap when it comes to refills, condiments, utensils.....Well you name it. My husband and came here a lot. On one occasion we brought my mom with us and she ordered the short rib combo. \n\nMy mom has always been one to have the nose and palate to recognize when something has gone bad. Well she got her short rib combo and took one bite of it and spit it right out. The meat was bad , it had a spoiled taste to it. So I go up to the cashier lady and tell her and guess what her response is? \n\n\"Well nobody else has told us that\" \n\nNo appology , no accountability. I was baffled and dumbfounded,  Standing there infront of me was this woman who was the definition of bad service. \n\nShe reluctantly had to go about making sure a new order was made. But the whole time I was made to feel like it was my fault. Oh god never again have we returned to that dump. \n\nLook elsewhere for cleanliness and good customer service.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 10, "review": "The service is slow and the guy working the counter is extremely rude. He refused to give costumers free water and condiments. I won't be returning to this location.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 11, "review": "I really wish there was an option for 0 stars.  My husband and I were so extremely disappointed with our experience here today.  Being from Hawaii, L&L is one of the few places where I can go to feel close to home.  But I feel as though the service + quality has been going down with every visit.\n\nMy husband and I went here for lunch today and ordered our usual (chicken katsu & loco moco) + 2 Hawaiian suns.  I am currently 8 months pregnant and need to stay hydrated at all times so I also asked for a cup for water.  Their response?  \"we don't give cups for water.  You need to purchase bottled water.\"  NEVER have I ever visited a restaurant in my entire life that refused to give me water.  When I asked the cashier why this was the case, the cashier responded with a really bad attitude saying it's the boss' rules. \n\nAfter we got our food, I realized our chicken katsu order was missing its katsu sauce.  So I went up to the same lady and asked if I can have my sauce.  Her response?  \"49 cents.\"  Mind you, she said this without even making eye contact with me.  When I asked why she was charging me for sauce, she responded again with that same negative attitude saying it's the boss' rules.  \n\nWe finally got her to give us a sauce after explaining to her that we had ordered chicken katsu and it SHOULD come with the sauce.  \n\nAs I was looking around the restaurant, I noticed a big sign printed in bold on their fountain drinks that read \"ONE REFILL ONLY.\"  Everything about this restaurant says they don't care about their customers.  All they care about is saving every nickel and dime possible.  It honestly really saddens me that they call themselves a Hawaiian restaurant.  Nothing about this places shows \"aloha\" whatsoever.  My husband and I will not be returning to this place.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 12, "review": "The Coleman location for some reason had over sweet meat.  Perhaps it was just one day but the day I went the beef teriyaki bowl was full of sugar.  It was still a tasty meal.  I still love the spam musubi since you really can mess it up.  Plenty of seats during busy lunch hour.  And they turn around fast since food is served quickly.  They have your choice of different types of hawaiian juice/soda and also a tap soda machine.  I did bring my own hydro flask so didn't run into the no free water issue.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 13, "review": "I used to enjoy the food, but the service here is unacceptable. \n\nI decided to come in today and grab a quick lunch before my class. I ordered a BBQ beef bowl and asked for a water cup, but they don't give out water cups. So, I waited 20 minutes and noticed that everyone who came before me had received their order. I asked the counter if my food was coming out soon, and they made it apparent my order had been forgotten. They asked me to clarify my order.\n\nI waited another 15 minutes until I received my food. In total, I waited 35-40 minutes for my food while I watched others received theirs in under 10. I asked if I could have a side of macaroni salad or a juice because I waited so long. I was refused by the rude counter worker with a man bun who made me feel stupid for asking!\n\nI got mediocre food and missed my class. Thank you L&L!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 14, "review": "Going back a handful of years ago, L&L was one of the only Hawaiian places to hit if the craving popped up. However, there are now a handful of competitors in the Bay that have raised the bar.\n\nTheir menu offers a Hawaiian/Chinese food type of selection, as I was able to order their Hawaiian Orange Chicken. This dish came loaded with chicken, but it was 90% batter and 10% chicken. Flavor was decent, but they definitely need to work on their chicken to batter ratio. The 2nd plate I tried was their Healthy Garlic Tilapia with brown rice and veggies. This meal was on point. The Tilapia was cooked perfectly, and the garlic was not over powering. The veggies and brown rice complimented the fish very well.\n\nService was fast and friendly, and the interior was very clean. The only thing that threw me off was that they DON'T provide cups for tap water. I guess one too many customers have filled their water cups with soda, and the owner has had enough! Really?!? Maybe they should hire a soda fountain monitor? \n\nC O N C L U S I O N\nI'd show up again for the Tilapia, but it is most definitely not my go-to Hawaiian spot in the YAY AREA!", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 15, "review": "The food here is okay, but the guy who works at the counter is extremely rude. He refused to give customers water cups, saying he had no water and we needed to buy a water bottle. I'm pretty sure that's illegal.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 16, "review": "They don't serve water. They don't have napkins available for customers. Food is okay.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 17, "review": "This place is good for hawaiian food. Love the chicken and fried shrimp. Also the mac salad is BOMB.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 18, "review": "No water cups. \nGot my order messed up. \nEmployees arguing/being passive aggressive to each other at the cash registers, very noticeable. \nFood: normal not out of the ordinary Hawaiian bbq. Spam musibi good, Kim chew side small but good too.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 19, "review": "I asked for a separate container to put my Mac salad in as I need to warm up my food when I come back for work. I was told over the phone that's not a problem . When I arrived my Mac salad was not in a separate container and they will need to charge me to do that . I guess I'm supposed to put cold food in the microwave then. Terrible customer service .", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 20, "review": "I love me some spam musubi and I've been to this particular L&L a few times in the past months. The food is always delicious and I have no complaints about it. :) I'm not expecting healthy food when I eat here, so salt and oil don't bother me. So I am reluctant to be as harsh as some of the other reviewers on Yelp have been.\n\nThe wait for food tends to be long, though. And I have to agree with other reviewers on two points: the staff at this L&L seems rather morose/unhappy regardless of the time I've visited, and the \"1 refill only\" sign on the soda machine does contribute to an unwelcome vibe overall. I have never asked for a cup of water (I usually just get a drink elsewhere or at home).\n\nIf you're just getting takeout I would say this is a serviceable location, but you might be disappointed if you dine in.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 21, "review": "This is by far the worst L&L I've ever visited.  DO NOT EVER COME TO THIS LOCATION.\n\nPROS\nNone\n\nCONS\nCleanliness: none whatsoever.  They was garbage on the ground and tables.  The tables didn't look like had been cleaned all day, food and trash all over them.\nWater: They do not offer water cups & forceable try and make you purchase a bottled water.\nCondiments: they do not offer free condiment cups for their sauces.  I was even asked if I was a patron eating there and prided for my receipt.  Which by the way, was taken from me during the time of the pick up for my food.  \nBathroom: Men's bathroom was disgusting, it wreaked like urine, floors were sticky and there was toilet paper or paper towels. \nUtensils: I asked for an extra fork since I was sharing my plate with another person and they gave me a hard time for requesting an additional fork. \n\nSave yourself some time and a headache, there are plenty of other places to go eat at The San Jose Market Center on Coleman.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 22, "review": "Haven't even gotten the food yet but if I could put zero stars I would. Apparently they don't understand the concept of a water cup. Water is free. But not for them. Stupid... Will update when I get my food. Maybe. Probably will still remain a zero-if-I-could star.\n\n\nUpdated: So it was still a pretty low ranking meal, the macaroni salad was pretty good and the portions were big, but with all the saltiness of foods, still needed water.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 23, "review": "Cheapest service I have ever seen. Didn't even provide water cups, they rather have me spend an extra $2 on a drink. On top of that they wouldn't allow me to make both a cash and card payment. Their drinks also only had one refill and the next charge was 99 cents. At this point they might as well charge me to breathe their air and use their table!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 24, "review": "Good customer service! And food is really good also the portions are big and definetly worth the price!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 25, "review": "Slowest service ever! And the employees don't look happy. Management is subpar. They seem very disorganized and inefficient. They are having their staff refill their 70% full drink fridge while many customers are waiting.\n\nAgain, extremely slow. I'm NEVER coming back here again.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 26, "review": "Horrible customer service. Management is not friendly or helpful at all. I ordered a mini meal that includes 2 sides. I ordered my sides and an extra side but the woman taking my order must have misunderstood me. No problem. When my order arrived I let her know that I ordered a different side that I wanted to switch out one that was not touched and could easily just be put back in the fridge as she just took out the side of Mac salad. She stands there arguing with me about how I didn't order what I ordered. Gives me major attitude, then says she will ask the manager if I can switch my side. She comes back saying I didn't order correctly and that she couldn't give me the broccoli my daughter was about to throw tantrum about because it's not ordered on my receipt. She goes saying if I wanted the broccoli I need to purchase it again. Wtf??? It was her fault she misheard me... I have a two year old about to throw a tantrum.. is it that big of a deal to switch my Mac salad for some broccoli?? Whoever's fault it was anyways, isn't the customer always right? \n\nYou guys need to get your management straightened out and your workers need to have a better attitude towards customers. This wasn't even a big issue and you just made it one. Thank you I will never be going back there.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 27, "review": "DO NOT GO.  SKIP! \n\nWorse l&l. The register people was rude and stingy as hell. No extra condiments, no water. It is illegal to refuse customer asking for water. The machine says only 1 refill per person. Don't leave your soda machine out if you are stingy as hell. \n\nGrilled onion is extra charge, but she charged it as extra sauce. I've been here before and the ones that previously took my order never charged. I asked her why? And she said because the owner says so. B.S. Don't charge me for extra sauce if I never asked for it. List it as grilled onion or have the courtesy to let me know there's an extra charge. \n\nThis is the Vietnamese lady by the way. She needs to be taught correctly and learn how to not refuse customers asking for water. \n\nThis L&L is waiting to be sued. I would give this place a ZERO if I had an option to. \n\nPlease skip this place. It's worth the longer drive to go to another L&L with better service and will treat you correctly.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 28, "review": "Food is not bad, but they ask you to buy water in bottle. There drink fountain has water but they won't give you water cup or even sell a drink cup. Their excuse is management policy no water cups.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 29, "review": "Service here used to be good but ever since the owners changed and hired new people my boyfriend and i just go to the a different L&L... we do miss the friendly owners that used to work here tho.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 30, "review": "Food is good.  Takes a long time though.   No water cups.  Very rude people behind the counter.   Not a smile in sight.   Super stingy with anything extra.  I witnessed the lady in front of me asking for a box to put some extra food in that she'd ordered and they just yelled at her that it would be .47 cents.  Incredible.  Unfriendly.  Can't understand why this place has so many bad reviews and yet the management doesn't learn from it.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 31, "review": "I just can't recommend this specific L&L restaurant.  The food is fine.\n\nBut... they force customers to buy drinks. No free water here. That just rubs many people the wrong way.  Others are offended by the 1 refill sign for sodas.  \n\nJust bad vibes in general. \n\nGo to a different Hawaiian BBQ for your meals. You'll at least receive more authentic Island spirit and service there.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 32, "review": "Average Hawaiian fast food. Cashier was on the rude side.\nHave to pay for water.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 33, "review": "They're a bit slow at the location but the food is consistent to the other L&Ls in San Jose. Not much to complain about except they charge you for bottled water and wouldn't give me a water cup", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 34, "review": "What happened to this L&L?\n\nBad sign:  Very few people eating there at 6 on a Wednesday.\nBad sign:  They refused to give me a water cup...instead only sell water for $1.\nBad sign:  Restroom was dirty, covered with graffiti, and didn't have a locking door.\nBad sign:  When i asked for 2 chopsticks....they gave me 2 chopstick.  not two pairs. Ha!\nBad sign:  Service just seemed to not care.\n\nGood sign:   Food was okay and typical L&L...for that I give the 2nd star.\n\nMy guess is this place is going out of business....  looks like a no-care situation to me.  So sad for I've been here probably 20 times since they opened.\n\nI'll be eating now at the Curtner one...which was cleaner and very friendly. \n (well at least last time i had a Chicken Katsu craving)", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 35, "review": "Have to buy bottle of water, no more free cups of water even as a patron. Isn't this breaking some kind of city code?", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 36, "review": "Really good, fast hawaiian barbecue.\n\nIf you get the mix plates, the portions are massive and the meat is really good. I personally don't like the sides that much, but the fries are decent. They also have a family meal, which is a really good deal. I have shared it with another person, and it is basically like going to an all you can eat kbbq, but with left overs and slightly cheaper.\n\nThe only thing I did not like about this place is that they do not give out free water cups.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 37, "review": "Food is good but this is based on the customer service. \n\nThe girl taking my order, who did not have a name tag, was more concerned about what she was doing on her phone rather than helping me. Keep in mind, she made eye contact with me - no hello no nothing... Only nose in her phone. \n\nIt wasn't until after a few minutes of me standing around and staring at her, that she finally asked how she could help me. \n(Of course I wasn't rude to her when trying to order because anyone knows you do not be rude to anyone handling your food until it arrived or is in a to-go box). \n\nNot to mention her phone didn't disappear until she was basically done taking my order. \n\nCome on L & L, get it together with the customer service! I don't want to have to go to another, since this is so close to home, but if this happens again I will!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 38, "review": "I've been to many L&L's around the area and my go-to is the mini size. Normally that is enough food since other L&L establishments load up the food for you. Nope not this establishment - this is the most stingy L&L I've ever been too. They do not offer tap water and have a \"one soda refill\" sign.\n\nWhat kind of restaurant doesn't provide you a cup for tap water? I'm not a soda or juice drinker that's why this peeved me.\n\nFood is what you would expect from Hawaiian fast food places. Turnaround time for your meal is pretty slow.\n\nPoor business practices.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 39, "review": "I'm from Hawaii and love Hawaiian food, L&L isn't the best, but this is the worst! Their service is among the worst I've seen. Owner is arguing with customers as I sit here eating, they charge for water, limit drink refills, and generally treat customers like garbage. \n\nDo not eat here, go to anther location for service that's not an insult to Hawaii's good name!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 40, "review": "You will be shocked to learn that you cannot have a cup for water here... you cannot have mini-cups for your condiments... you cannot have an extra fork or napkin. One fork and napkin per customer, period.\n\nOne guy in the restaurant with me was with a 2-year old who dropped his fork. The father asked for another fork, please. The man behind the counter refused. The look of shock and dismay on the father's face...\n\nI've been all over the world and have never experienced that kind of restriction on water and basic utensils, not even at a street vendor in third-world countries. This really is embarrassing and this place should not be in business.\n\nPenny wise and pound foolish... I bet that philosophy here runs deeper than the stinginess about water and napkins :) Never eating here again. \n\nBy the way the place is filthy.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 41, "review": "Well I don't come often, but the few time I came in and today it seems like no one is ever happy or smiling. The food is great but I think the service can be better. The reason for my review is solely based on the customer service here. Today when it was my turn the young lady at the register gave me the head nod. You know the one that can be used for difference purposes like saying wassup to friends or the head nod kids give each other when they are about to fight. Is this really what the world is coming to... I work in customer service and have a secondary sales based job and never would I do that to a customer... just here SMH confused wondering why there's no courtesy or respect out there.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 42, "review": "Went to L&L for the first time last week. I vaguely remember my high school history teacher being obsessed with this place. I never really knew what type of food they served until I stepped foot inside. \n\nSince my friends told me to set my expectations low, I opted to go for the safest item on the menu: grilled chicken. I ordered mine with brown rice and steamed veggies on the side. Honestly, the chicken was okay. Soft enough and flavored enough though a little on the oily side. \n\nThe place itself is kind of questionable- 1. it's not the cleanest and 2. they stopped giving out water cups due to \"soda theft\", WHAT? Portion size was pretty big- I got two meals out of my plate and it was fairly cheap. It's honestly kind of hard for me to rate L&L since I don't typically go to fast food places to eat. If they were actually \"fast\" and convenient, I might recommend it to someone pressed for time but service here is pretty slow. If we're talking fast food, you're better off with In-n-Out :)", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 43, "review": "The people at the register are very rude. I was deciding what I want and the lady called the next person in line right when I was about to order because she was impatient and the next person was ready. So I had to wait... \n\nThen when I just wanted a glass of water to drink they told me all they had for water is a bottle of water for a dollar. They don't have water at the fountain machine... So I decided on not getting a drink since I don't drink soda and find it ridiculous to pay a dollar for water.... I'm pretty sure that is not legal since in California every establishment has to offer water and can't charge for it... Really displeased with the service here....\n\nWould give 0 stars if I could... Wouldn't recommend going here, not planning on ever coming back. After reading the other reviews as well it seems like this is common issues that other people experience with even worst situations as well.\n\nThe food was average. And their portions are smaller than other L&Ls. Other L&Ls are way better.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 44, "review": "Went here for lunch and got the chicken katsu. I thought it wasn't that bad. They hooked it up with chicken as well. As for all the water cup reviews, there's Starbucks at the end of the lot, just go grab a venti ice water before or after you go there. no biggie and its free!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 45, "review": "Didn't like this location at all. They don't give out water (not even tap water). The place was pretty dirty and the people were rude. I'd avoid this place.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 46, "review": "Food was good. Not the best L&L I've been to. \n\nSurprised they haven't looked at their online reviews and made improvements. \n\nUnfriendly staff, charge you for water, bathroom not in service. I would say 3 stars, but I'm giving 2 stars because they don't try to improve their service even while getting bashed on Yelp. \n\nLiterally all they need to do is message reviewers and apologize for bad experiences and then take the feedback and make things better for customers.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 47, "review": "Katsu chicken is great. Big portions and great taste. Minus 1 star because they don't offer water cups and the place was roasting inside. To the owner, don't be cheap and not use a lower temp on your AC unit.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 48, "review": "Definitely like this L&L opposed to all the other ones in San Jose because these workers are actually nice, they are always friendly when taking my order. If u plan on coming here for lunch on weekends I suggest calling in your order because it can get pretty packed up in there. I usually order the spam musubis before work because it's a good snack but then again I eat like 4 so maybe it's a meal also the bbq chicken is flames and the katsu ain't half bad either. Check out their bathroom here it's pretty sick. Oh yeah spend 5$ and up to use your card, so u might as well ball out ya feel me.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 49, "review": "DO NOT EAT HERE. Too many other great places in the plaza that will appreciate your business. At this location, customer is always WRONG!\n\nCustomer service is the worst! I asked for some extra cabbage with my meal and the lady said \"oh, that's garnish. You want cabbage? You have to buy a side dish\" it was a really hot day and I asked for a cup for water while waiting on my togo order. The lady said it's \"$1 for water!\" Never coming back to this location again!\n\nAfter receiving my order, I mentioned to the lady at the counter, who turned out to be the owner, that the customer service was pretty poor. She proceeded to yell at me that cabbage is expensive, $40/box. That she'll go out of business if she gives extra cabbage.  I asked her to stop yelling and she yelled back not to shush her. Absolutely surreal.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 50, "review": "Okay service. Good food. Quick style. \n\nLove their mac salad and the masubi is good here, too. $1 for egg, but it's also hella good. Love the chicken BBQ, particularly masubi style. \n\nLots of places charge for cups, so people be trippin' giving them a 1 for their anger, but also, management needs to start thinking about giving customers cups, so they don't anger everyone!\n\nLocal love from a local girl, \nRenee from the Bay", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 51, "review": "Go to a lot of L&L Barbeques.   This one gives the rest a bad name.   Used to come\nto this location often, but forgot exactly why stopped.   Came back and remembered \nimmediately after asking for a water cup.   The owner Min used to be a  good guy to \ncome in and visit with.   Not sure when they lost their sense of customer service.   This location refuses to provide tap water to patrons.  Must buy either bottled water or soda.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 52, "review": "DO NOT GO HERE, I repeat do not go here! If you look at my reviews I'm really a nice guy and like to give a good review. Then steps in L&L BBQ San Jose. I usually go to the Santa Cruz or Reno location. I LOVE their masubis. I though I'd try something different. It was AWEFUL. I asked if I could just get some masubi's instead. They said \"IT DOESN'T MATTER IF YOU DONT LIKE IT. YOU PAID FOR IT, ITS YOUR PROBLEM\" they called the manager and they said the same thing. SHOCKING!!! I was in the Restaurant business for years, I would never force someone, especially a regular to pay $16 for a meal so gross. And obviously I'm not the only one. Whoever runs this place and the person running the front line are in the wrong business. Go get a job where you're not working with the public. And BTW. They don't even have water. Good bye and good riddance. I'll be sure to give good reviews to the other locations as I've never had an issue and the food is great. But at this point, I'm speechless.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 53, "review": "Their customer service is terrible! The Vietnamese lady who works the cash register was very rude to me and wouldn't even give me a water cup! Never coming back here again! 0/5 stars! She was also yelling at an employee while taking my order smh. Smash burger gave me a water cup with a smile even if I didn't order anything from there will probably go there next time for better food and customer service.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 54, "review": "I have eaten here for several years now. The food is always delicious and the proprietors are always friendly and courteous. Being a kamaiina from Hawaii, I appreciate having the local cuisine from time to time. \n4 years ago, I was ordering a lot of food for my sisters funeral and the owners were very helpful in preparing the menu and delivering the food to the church. Even today, whenever I eat there, the owner still greets me by name. It's nice to experience the \"Aloha Spirit \" so far away from Hawaii.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 55, "review": "Obviously their food is 3.5/4 stars but their CUSTOMER SERVICE is horrible. The ambiance at other L&Ls is more energetic and welcoming. The cashiers were monotone, showed no excitement or any greetings when we ordered. It's sad... honestly, I can understand if you're having a horrible day but don't take it out on your customers. Words of advice to the managers, please re-train your employees with improving their customer service skills or hire the right people with a positive attitude, demeanor and who want to be the face of your restaurant.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 56, "review": "Food is always fresh and good. Service is always decent. Would have given 5 stars but no water cups are given", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 57, "review": "Look, this has got to be the worst L&L in the Bay Area.  The place does not give out cups for getting water!  They say that this is due to soda theft, however they are located in a decent area.  Every other place has no problems with providing water to their customers.  They are either scamming their paying customers or extremely and illogically cheap.  Never going back again.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 58, "review": "I am big fan of Hawaiian food so I've been to many L&Ls, and this is one of the worst. They are often short-staffed and the food takes forever to come out. They also do not serve free water and have a $5 minimum on credit cards, so you may not even be able to get water unless you have cash. I would recommend avoiding and going to one of the many other food options in this plaza.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 59, "review": "This strip mall has a lot of food options clustered together. There is Unamas, Smashburger (yum), Panda Express among others.  L&L is just OK and if you are tired of the other places here, you can give it a try. My go to item here is the katsu.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 60, "review": "I had ordered from a different L&L Hawaiian BBQ place before and I loved it. This time, I ordered to go from this restaurant without looking at the reviews because I had assumed that it would taste the same. I ordered 2 half and half: one with chicken katsu and BBQ beef, and the other with BBQ chicken and short ribs. I was not only disappointed when I came home with my food because they messed up my order and gave me BBQ beef instead of short ribs; but I was also annoyed and disgusted that they gave me RAW chicken. I mean, I usually love Hawaiian BBQ, and I love the generous portion, and the rest of the food was ok. But this is offensive. I will not come back here. Just be aware of their chicken !!!", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 61, "review": "The musubi was packed with way too much rice and just fell apart the second I picked it up. And they don't offer any water. You have to buy a drink and are only allowed one refill. Very shady business practice. Will not return.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 62, "review": "Food is okay.  But I'm giving this place 1 star because apparently they will NOT give out cups for water.  They only allow you to buy their bottled water.  That's really lame and cheap on their part.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 63, "review": "Finally decided to try this restaurant and it wasn't the best in my experience. Conveniently located in San Jose Market Center, I found difficulty parking so expect that especially if it's a weekend during dinner time.\n\nI ordered the chicken katsu with rice and macaroni. I asked for a cup of water and they didn't have that available...? What the hell? I waited about 10 minutes for my order and dined in. The meal came with gravy and the chicken definitely tasted better with it. If you just eat it without the gravy, it just tasted dry.\n\nOverall, the chicken katsu was good, but there wasn't enough rice that was given. Also, the whole \"no option for water\" is ridiculous.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 64, "review": "I am from Hawaii and there is no aloha here (and I don't think they care). The staff should not fake it by saying it. No water cup is just wrong. Will not return.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 65, "review": "This L&L suuucccckkkkssss. The girl up front is not the the sharpest tool in the shed. I can not come to this location again. I just came so I wouldn't have to drive to the other one. Keep the story short, she got my order wrong after I explained to her multiple times what I wanted.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 66, "review": "The owner is stingy with condiments. I asked for soy sauce for my to go order and she didn't want to give me more than 2. Her excuse was she had\nto order more. \nOn my previous visit, I was refused a cup of water.\nTERRIBLE SERVICE!!!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 67, "review": "I couldn't believe how much attitude I received from the girl at the cash register. I asked for what I usually get and she basically told me they didn't have it. She just started listing other things that they had, without trying to work with me to help me get what I want. She rolled her eyes at me and I didn't appreciate it at all. I ended up leaving without ordering anything. Never going back.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 68, "review": "Garbage service! Girl behind the counter tonight could not have been any ruder. Can't count how many times she rolled her eyes... won't be back. Did not even eat there due to the service.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 69, "review": "I work in the area so I come to the location at least once a month, sometimes more.  Service is a little slow so I like to call my order in so it's ready when I get there and I can have lunch and do a little shopping in the area.\n\nToday was like no other.  Placed a phone order, came in, paid and sat outside to eat.  I took 2 bites out of my plate and a huge bug/bettle/insect/whatever you want to call it landed on my macaroni salad.  I went inside informed them of what happened (even tried to show them the picture I took) and was hoping they would accommodate me and replace my plate.  Unfortunately they did not care, said they don't replace it and stared at me waiting for me to turnaround and leave.  I told her that was too bad and that I come there often.\n\nIn my opinion it's just good business practice to replace it. I know that the cashier sees me as a familiar face since I go in often.  I will not be returning.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 70, "review": "I'm gonna make this short and sweet. The cashier was very friendly, greeted us quickly and was knowledgeable about the menu. I'm pretty sure he was the manager, later he offered me a free bottle of water as the no long give out water cups and I don't drink soda. This was my first time eating at any L&L's and I def will be back", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 71, "review": "The food was good. The only reason why they are getting the two stars is because of how the place is run. I do not support business that chose to break state law. They were trying to charge me the price of a small soda or the price of a water bottle because they ran out of water cups. The employees were not willing to take a cup and fill it with water and hand it to me. Terrible customer service. And they have a sign that says one refill on the soda machine. Not a great idea for a place that offers rice as a main part of the meal. Now I just have to find a different Hawaiian BBQ place that cares about the customer.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 72, "review": "Place is very cheap, they don't give you cup for water.  People are very friendly but under mercy of their terrible business owners.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 73, "review": "Spa masubi are ok the Milpitas one place is better this place doesn't take the time the masubi was sloppy falling apart not enough seaweed ugh I but I live spam so I can't be mad I ha e a 3 star so deal with it lol step up your masubi game", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 74, "review": "Skip this place please! Customer service is horrible here! Not only that the food is MEDIOCRE! No free water here, only ONE free refill sign posted, extra charge on sauces. Really???? My husband and I had lunch here and our order wasn't correct and also not to mentioned we weren't handed a reciept. When we approached Tom he said he had left it on the counter and we probably didn't take it. The rude manager starts charging out from the kitchen and started causing a scene and speaking loudly and embarrassing us in front on customers. She was bickering, rude, disrespectful, yelling at customers. This is a very bad experience and not what I expect from this place. We will never go here again. Would give them a 0 rating if I could've. This place ruined our lunch!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 75, "review": "Never coming back to this location again. Worst service i've ever had. The two ladies working were bickering in front of customers. I went up to ask for some more sauce and when I tried to get their attention they completely ignored me. When one of them finally turned around she didn't pay attention to me until another customer told her I was there first. When i asked her for more sauce she proceeded to ask me what I had even ordered? Then she said if i wanted more sauce I would have to pay for it. Understandable, but she was completely RUDE about it.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 76, "review": "I always think their food is great! The have a huge side of veggies, which I pair with a side of rice. It's usually too much food, but super delicious. The only down side is they so not give out free water cups.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 77, "review": "Pass!  \n\nTo start off, food is decent.  Nothing spectacular that would make me drive out of the ways to come here.  \n\nI work in the downtown area and happened to be in the plaza during my lunch hour.  I decided to drop by to pick up some lunch for my boyfriend and I.   It was a weekday, so there was an abundance of parking.\n\nThere was one person ahead of me in line, so I waited.  I could hear an Asian lady (owner) talking very loudly, taking orders.  She was clearly the owner because she was (very rudely) barking orders to her staff.  \n\nWhen it was my turn, I ordered a seafood combo and also a Kahlua pork meal.  The order came out to over $20.  While waiting for my order, I continued to hear the owner barking orders.  I'm Asian too, but I know what an \"indoor voice\" is. \n\nWhen my order was called, I came up to the counter and I saw it was bagged with only one bag.  Since I wanted to drop off food for my boyfriend, I asked for another bag (so I could bag it myself.)  The employee turned to her boss, and the boss lady came over.  She asked me what I wanted and I asked for an additional bag.  She gave me a look and proceed to lecture me \"if you want it bagged separately, you have to let us know next time.\"  Honestly, I didn't think it was a big deal because I could bag it myself.  She takes one look inside my bag and screams for her employee.  \"Come here!  OMG, look what almost happened!  Look here!  This customer only ordered these sides and you ALMOST gave her one free macaroni!!!  Look what would have happened if I didn't see this!????\"    Keep in mind, this is all in front of me, the CUSTOMER.  \n\nI stood in shock, as the owner screamed at her employee.  To top it all off, she removed the \"free macaroni\" from the bag and placed it back on the counter.  \n\nSeriously, what TERRIBLE customer service.  First of all, if you want to talk to your employee, do it in the back or at a later time.  Secondly, not that I want a free macaroni or anything, but it was already in my bag, so she should have just let it go!  \n\nWould I come back? Not in a million years.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 78, "review": "The worst L&L I've been. The lady in the register was rude.  She rushed me to place my order and when I told her I just want \"mini\" chicken barbecue, she gave me an attitude.  For my drink, I only wanted water.  She  sounded very demanding when she responded.  She said she only has bottled water and rushed to ask me , \"YES!\" or \"NO!\" When, she gave me the food, there was no napkin, no spoon.  I ordered brown rice but I was given white. I asked for steamed veggies as a side dish but I was given macaroni salad.  I pointed out that there was a mistake in my order. She did not apologize and showed me a grumpy face and continued being rude. I will never go back to this place. I wish I could rate this place ZERO.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 79, "review": "My favorite thing is the garlic shrimp, YUUUM but be warned that it makes you and your hands smell like garlic for a while after haha...\nYou can also never go wrong with the katsu curry \n\nI haven't had a problem with service here (apart from the slowness), my order is always correct. Sure they have a bunch of rules but it seems justified since they've had issues with customers in the past\nJust bring your own refillable water bottle if you don't want to buy a drink\n\nSince service is pretty slow, if you're planning on takeout I would recommend calling a bit ahead of time so it's ready when you get there\n\nAlso they have the cutest baby at this L&L!\nTry the pineapple soft serve! They sometimes give samples if you ask and it tastes like Disney land dole whip", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 80, "review": "I love this L&L.  Mainly because of the huge portions and the close proximity.\n\nThere are a few closer to my house, but I like coming here the best.  Why?  Their mini's are enormous!  I go to a few others, and their mini plats are half the size of the ones here.  Not to mention the assortment of milk teas and other delights you can find here.\n\nMet the owner Minh, and he's awesome.  Always remembers our names and asks us how we're doing.  Parking can be hard to find? But it's in a huge shopping area, so eventually you'll find something. \n\nI have rarely been disappointed by the quality of food here too.  My go-to's are the Loco Moco or anything Katsu.  They are always consistently quality and good to go!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 81, "review": "I'm glad I didn't look up reviews before going cuz then I wouldn't have gone.  I've never tried L&L before so I don't have the other locations to compare it to.  It was ok, not amazing. It did satisfy me though.  The tiny is enough for lunch. I'll prob go back when I'm in the area and I don't feel like eating panda or panera.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 82, "review": "This is by far the worst L&L spot around. Overly priced food that's not all that. Plus, they charge you for FREE water! WTF! Will never spend my money at the place.\n\nSLOW SERVICE TOO! expect to wait 25+ min for your food! If you are in a hurry avoid this place!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 83, "review": "Horrible service.  I wanted a cup of water with my meal, but they were out of the stupidly small water cups they usually give and they refused to just give me a normal cup to fill with water unless I paid for a drink.  What kind of stupid policy is that.  It's their fault they were out of the small cups so they should just give you a regular cup.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 84, "review": "They have great customer service clean restaurant also have an outdoor patio to enjoy. \n\nThey are way better than the one on Berryessa! Cheerful environment and sanitary.\n\nCame here with my dog to sit outside where I can enjoy a sit down.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 85, "review": "Worst customer service ever. They don't give cups of water so they can charge you to buy a drink. Be prepared to bring your own water bottle or drink if need be. Short lady at counter is awful. Very rude and immature. Could hear her talking with her coworkers about how we should buy a drink and not complain about cup of water. It's not the water, it's the customer service which she lacks. Find a better place to eat because you won't enjoy the short lady at the register.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 86, "review": "Decided to try out the loco moco since it's something that I've never had before and was pretty excited! However, when I opened the box (it was a to go order), the whole thing was completely covered in gravy! I'm not sure if that's how it was suppose to be but the gravy pretty much covered the whole dish to the point where the rice and hamburger patty wasn't visible. The only thing visible was the egg since it was placed at the top. I had to scoop out the excess gravy because it was just too much.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 87, "review": "The food was pretty good (loco Moco and katsu) both plates were assumed regular and not mini (typical sneaky tactics from retail fast food joints, almost expect it) asking for water was almost appalling to her, no free water only bottles, and she reiterated twice that we make sure we only get one refill( there is also a large sign on the machine) the Seagram's ginger ale didn't taste right, almost like a very light mix of mountain dew but a generic brand, cherry cola also tastes off brand, almost like diet. The katsu meal was pretty on point with every other katsu we've ever ordered, albiet slightly soft/squishy for being fried. The loco Moco was nice and slathered with gravey and two patties looked and tasted ok, but the eggs were partially uncooked, it's like they never flipped them at all but also took then off the heat early, as in it was still clear and boogery. I understand sunny side up is hard to do, but any other person would probably freak out, I simply buried the eggs under all the other food and let it cook a bit with the heat, it sorta helped but when I got to it at the end it was still slightly runny, I ate it anyways because I dont like to waste food, and I'm cheap and nonconfrontational .", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 88, "review": "Friend picked up dinner for us from here as she had a spam musubi craving. The spam musbis here are okay, but I think they put way too much rice. The ratio of rice to spam is about 3:1. Loco Moco is a fave here, but I prefer the kahula pork. A lot of food as always, but the pork wasn't as good as my old favorite place, Ohana Grill. \n\nAll in all, it hits your fast food Hawaiian craving, but a little too heavy and greasy for me.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 89, "review": "Not all L & L's are created equal.\n\nNot a review about the food. The food is USUALLY delicious and made well.\n\nThis L & L's service is terrible. The lady cashier here is never happy. EVER. Always with the angry resting face. Also... Why do you have a baby stroller behind the counter? It just makes the whole experience less pleasing. I think the lack of giving cups for water is down right stingy.  \n\nTip: Bring your own cup or water bottle because they won't give you a cup for water.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 90, "review": "We have L&L at our office very frequently. At least once a week. \nUnfortunately, today I found a spider on my food. My boss called the restaurant to get a refund but Min, the manager, refused to refund our food. He was very rude about it too. No one at the office ate their food because of this. He could've avoided this yelp review if he would've just given us a refund. Never eating at this place again.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 91, "review": "Food? Delicious. It's L&L so no problems there. But come on, this place is a well known chain restaurant so you better have high standards. This restaurant has haunted house like bathrooms, doesn't give free water and only offers 1 refill on drinks. Unheard of from a popular restaurant. \n\nWeird though...I still come here...", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 92, "review": "I love L&L's bbq chicken compared to other Hawaiian fast food joints.  The chicken is better and the rice and mac salad is so much better. My rating for this place is based on the hours of operation and actual hours that they are open.  We arrived 15 mins before closing and they're already closed. It's really hard to rate a place when it's closed", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 93, "review": "Hello,\n\nBad bad bad service I called to place an order for to go. I was told that I was not to call back and to go in person to pay for my order when I was just asking what type of chicken did they have fired or grilled . A women was not letting me talk and hung up on me . As I got to the place I was told my order 'twas never made .", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 94, "review": "Had to walk out without my order because they took to long - not a good place if your on a tight schedule for lunch. To many phone orders.  Did not appear to busy when I walked in  but then I notice most of the food showing up in the window was being set aside for phone orders.  I not like L & L but not this one.  I also take offense to the no water cups offered and the sign at the soda machine stating \"one refill please\"  - Makes me think they are cheep and stingy.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 95, "review": "The only L and L that wraps their Musubi's with a once inch strip of nori. \nAll the other chains cover the entire Musubi with nori. \nThe Store is saving a few bucks on Nori, but it makes my rice fall out everywhere. \nI can't get over it!!", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 96, "review": "If I could give less than one star I would. I paid $10 for a meal and was denied a cup for water. They will only sell you a bottled water. I will never eat here again.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 97, "review": "I enjoy going in this branch! It's actually my go-to spot for Hawaiian food in San Jose. The ambiance of Hawaiian music playing in the background is very calming. I also like going here because I occasionally see the owners and they're always so inviting and nice - even bring their child here on the times I've gone here.\n\nI order anything from here because I really like their food. But my favorite would be the BBQ chicken with rice and mac salad.... oh I order an extra side of mac salad but it's my absolute favorite from L&L :D I could it eat that by itself if I wanted too. I also like their Chicken Curry Katsu but just make sure you ask them to put your mac salad on the side so your salad won't taste curry-ish. \n\nI always order my food to-go here and there were times that the food takes long but I can't blame them since they get pretty busy at the peek hours of dinner and lunch.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 98, "review": "I'm only giving a star because I can't post without one.\n\nWe visited this L&L on 6/23/16 at approximately 7:34PM. Order was placed and when we asked for water we were told they didn't offer water - WHAT?!? This is ridiculous!!! How can you not give a customer faucet water??  If you want water you have to pay for it. Not good for a food business to do this.  Just Amazing. : (\n\nWe're sitting there eating our dinner and what do we see? The cashier (I have her name on my receipt) who took our order finds a wallet, goes through it and then runs in to the women's restroom! Now, why would you hide if you're not doing something wrong? There's no reason the lost wallet should have been taken into the women's restroom. Next you see another female employee walk into the restroom where the first person is, they're both in there for a couple of minutes, and then they walk out and the female who originally had the wallet walks over to a female customer and hands her the wallet and customer walks out. This is such horrible UNETHICAL behavior!! L&L how can you stand for this??!!\n\nI used the women's restroom before leaving and there's a ton of graffiti on the restroom door. Ugh! I know people do graffiti in bathrooms, but you would think this business would clean it up just as many others do. Bad for business.\n\nThis establishment has unethical employees (at least 2), does not give customers water, poor customer service and does not remove graffiti from the establishment.  \n\nL&L you really need to clean up your act.  I will not be visiting this L&L again. I will be taking my business elsewhere.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 99, "review": "Came in at 825 and they already had their chairs up. Ordered chicken with brown rice and a salad. She asked me which dressing and I said miso. Upon getting my food they tied it up super fast and I always check to see if it's right out of habit. They gave me white rice and macaroni salad. When I requested to have it changed they said it was made to order and the cashier told the lady handing out the food I was wrong and never ordered it to begin with. How could I be wrong when you asked me what dressing? Regardless of who was right which was me, they should have corrected the matter. \n\nBtw look at this ridiculous sign next to their soda machine haahah never coming back again ! Zero stars", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 100, "review": "My FAVORITE L&L by far (even moreso than the ones in Hawaii).  The service here is friendly, the owners are really awesome and try to give you information on the menu items if you're not familiar with them.  I've been coming here for 5 years now and they feel like family.\n\nThe food is what's great about this L&L, I'd say not all L&L's are created equal.  This one gives insanely generous portions.  A mini can typically feed an average eater.  For instance, a mini katsu compares to a regular katsu at other L&L's.  The food here is also always hot and fresh.  Their kitchen also seems to be very clean compared to some L&L's which makes the food that much better too (never cook katsu in dirty oil).  \n\nIf you're new and haven't had much Hawaiian BBQ before, I'd say go with chicken katsu, teri beef, or maybe teri chicken.  You really can't go wrong though because this L&L while it may not offer everything (L&L menus can differ between locations), they're good at everything they offer which in my opinion is a better way to appeal to your customers.\n\nAlso if you want some elusive dole whip, you can find it here!!!  Just be careful because I think they turn off the machine by 7:30pm.  \n\nOverall, this L&L is just that much better than other L&L's.  It's clean, friendly, and has great food.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 101, "review": "Beware they close at 9 pm which means they start putting chairs on the tables prior to 8:30 pm, and you can only order to go after 8:30 pm. You'll be eating dinner, and they'll be loudly stacking up the chairs up, a subliminal get out. Also, they turn off their dole whip machine at 8 pm so don't make a special trip expecting this dessert with your dinner if you're there at 8:30 pm. The lights were turned off by 9:15 pm. What happened to the Aloha spirit?\n\n2 adults in our party so we wanted 2 drinks.The cashier missed 1 drink order so I went back to get a cup and pay for it, but the $2 drink charge did not meet their minimum credit card charge of $5. I was annoyed since she had just rang up our dinner total of at least $20. No apology either. \n\nTheir menu board screens flash the items like a power point presentation which make the ordering process cumbersome as I am used to seeing all the items at the same time.\n\nThe first time I came was for the dole whip, and that's all I got and it was great. The dining experience here was not so great.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 102, "review": "The food was good but the lady who runs the place, is unbelievably rude to customers and her own staff. She fought with a customer who was giving her honest feedback about her behavior towards the young girl who worked for her. That made the lady very upset and asked him to never visit again. After the gentleman and his wife left - she started talking to customers in the line and complained about the guy giving her feedback. She even went up to tables to rant about receiving feedback. To top it she was very loud when she fought and reprimanded customers and employees. I am not going back there again.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 103, "review": "Their prices keep going up, quantities and customer service goes down. They make you buy a bottle of water because \"people steal soda\". That's just really bad business practice to punish everyone for a few people's bad behavior. It's the price of doing business, right? Even the bathrooms are locked and you have to ask for a key. Food took a long time for the amount of people here. Skip this location. No bueno.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 104, "review": "Soooooooooo disappointed. Called in an order for my lunch. When I arrived back to work and started to eat I see they left out the macaroni salad. The large plate has Chicken Katsu, fried shrimp and rice but no salad. It completely ruined my entire meal. I don't have time to go all the way back on my dinner break. I will never EVER go here again. I'll stick to the Campbell location.  My mouth was watering, so ready to enjoy my yummy dinner... And by someone's careless mistake my dinner was ruined.  when I called she offered me a free macaroni next time but that clearly doesn't help the disappointment I have right now. It's not about a free Mac next time, I want it now. Had I known they don't take their to go orders seriously I would of chosen another option for dinner. I just expected to receive what I paid for.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 105, "review": "First off I love the food and the employees, but the manager should be ashamed of her customer service. I've had PLENTY of incidents with her. She is rude, disrespectful, and depressing with her negative energy. She doesn't hand anything to you while you're hand is out when you ask nicely for extra sauce. She throws things in your bag and doesn't even wish you a good day. She has this face that if you go in there, you'll know who she is because of her mean mug. She should really get her shit together. It's not once or twice, it's every damn time I'm in there. \nHope you go in there when she's not there! Good luck!", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 106, "review": "Lucky I give two stars and not just one I usually like this place but today I was dissatisfied and disappointed I normally order the spam misubi and the spam was dry as fuck and  the rice tasted old smh really good place but needs better quality", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 107, "review": "Owner Min is really nice. I was inquiring about party catering and he spent a good amount of time making sure I was well informed about deliver (free in the area) and timing to ensure complete freshness of the food. \nWhat I've swallowed:\n\nSHORT RIBS: Good and tasty. I like to order a bit well-done so the edges get a little bit crispy.\n\nMOCHIKO CHICKEN: I didn't know they had this on the menu until I saw one of their 8x10 special signs and they offered to put it in my half-and-half menu. The chicken was tasty and the breading wasn't overpowering. Did a great job of fulfilling my mochiko chicken craving.\nhttp://www.yelp.com/biz_photos/l-and-l-hawaiian-barbecue-san-jose-2?select=nCNiJPFZMNvBOCt4Z7P0FA#nCNiJPFZMNvBOCt4Z7P0FA\n\nBBQ CHICKEN: It's always been consistent and the marinade is delicious.\nhttp://www.yelp.com/biz_photos/l-and-l-hawaiian-barbecue-san-jose-2?select=nCNiJPFZMNvBOCt4Z7P0FA#YUPiev9AkT77kz-FId7JlA\n\nSPAM MASUBI: I still can't get over what the gel is in the middle of the rice and the spam. I usually take mine home and nuke it a a bit so it melts into the rice. I also order my spam a lil' bit more cooked so it doesn't taste too raw. Masubi like it should be.\nhttp://www.yelp.com/biz_photos/l-and-l-hawaiian-barbecue-san-jose-2?select=nCNiJPFZMNvBOCt4Z7P0FA#a4_B25OP-6dC_ODThwD-Ug\n\nDOLE WHIP: Not as flavorful as the Dole Whip on Oahu but pretty close. The texture is a bit icey so wasn't sure if it was just a random icey day or if it's always that icy. We weren't impressed with it and we are usually full after eating half a combo meal so we've ordered this once but haven't ordered it since.\nhttp://www.yelp.com/biz_photos/l-and-l-hawaiian-barbecue-san-jose-2?select=nCNiJPFZMNvBOCt4Z7P0FA#B8iMktdcyijK_7vE3z6F8g\n\nWe've been to other L&L's (especially in Hawaii) and hate that it can really be inconsistent with the preparation of food. We find that the food is always cooked just the way we like it and the taste is very consistent here. The servers area also very friendly here so it's nice to come back when we are craving Hawaiian food.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 108, "review": "I can always depend on this place for a quick food fix.  I can order ahead of time and pick up when I'm too lazy to cook.  Customer service is very friendly when I order in person or over the phone.  I think it has much to do with the hispanic young lady in the front handling the cashier transactions and customer service.  She works hard from what I see, upon my occasional visits.  My mini bbq chicken plate with a spam masubi is always consistently tasty and same goes with the great customer service.  Always a good pick for me when I'm in the plaza.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 109, "review": "L&l is one of my favorite places to go to I have been to many an actually this is the only one that didn't not go over well with me the food was not done properly usually they give great portions but this place was very skimpy I had ordered the mini chicken katsu and 2musubi's also a mini chicken teriyaki the spam on on the musubi was not even cooked it looked an tasted like it was cut n put in a microwave the was no cabbage in the mini plates and usually u get plenty of the katsu but not here also same with the mini other chicken plate hardly no cabbage or chicken like I said not all L&l BBQ spot are like this so if you are ready this please fix the problem thanks loyal but upset customer", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 110, "review": "This L&L BBQ goes above and beyond what you think of when you think L&L.  It is very clean, organized and has the most friendly servers, first of all.  Then, they offer up healthy options, in case you are trying to be somewhat good or feed your kids something decent.  Option you can exchange for the typical white rice and macaroni salad include brown rice, broccoli and carrots, side salad, and more.  (Not that I'd ever give up their mac salad but... you get what I'm saying.)\n\nThat being said, they still have the traditional goodies, like spam musabi and the chicken bbq plate, so don't worry.  They also offer other goodies that are harder to find.  Stop in to check it out!\n\nIt's probably a good thing I can't tolerate much Hawaiian music or I'd be here a lot more often! :-)\n\nSee ya there!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 111, "review": "This use to be a place for decent quick food. After today i can say its my last time coming. My family and i order several plates.\n1. The gravey was like play dough\n2. My hamburger patty was something i could play hockey with.\n3. I asked for bbq w/no skin... It came with skin and was cold like if it was not reheated enough.\n\nThe new owner is a penny picker! To the point where she doesnt give water cups out??! She is very unfriendly.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 112, "review": "Really bad service! I believe they overcharged me and when I asked them about it, they were very rude and told me I was mistaken and that I was thinking of another place. Uhhh no. I'm SURE it was the same place. And these were the owners talking to me!!! \n\nI then asked for a cup of water and they told me no. I either had to purchase water or soda. I have never ever heard of a restaurant not offering free water to their paying customers. I was very disappointed in this place and the service offered by the very owners. You guys are better going off going to Ono Hawaii or another place. Don't waste your money here.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 113, "review": "I went this place after my boyfriend got a game from the Gamestop. \nWe had choice to go to Panda Express, which is everywhere. So we chose to try out this place. The cashier was really nice, asking us if we were ready and waiting for us to order nicely. \n\nMy chicken was good, especially the macaronis :) However, I hope their chicken should be little more salty because it doesn't taste that much, which was bad about it. \nAlso, their beef teriyaki is really bad I would not recommend trying it because their beef taste so rubbery and chewy...", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 114, "review": "This is a HORRIBLE place to eat!! Run quick!! The cashier has horrible customer service and cannot get the order correct. They have a sign up that says once the ticket is printed no changes...well what if it's not a change but a mistake on your employees behalf?? Still refused to remake the order. Wow! Then my Mom goes to eat her spicy shrimp and they are raw and were not cleaned!!! When we asked them to remake the shrimp they refused. The cashier called the manager on the phone and handed it to me. He was yelling at the top of his lungs saying he will not let them remake anything and no refunds!! WTF!?!?!? I'm pregnant and if I would have happened to try one of my Mom's shrimp me and my baby could have been very sick!! I'm reporting them to the health department...smh...HORRIBLE JUST HORRIBLE!!!! If I could give zero stars I would!!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 115, "review": "Not my favorite restaurant overall. I went in here a few days ago and ordered the short ribs with white rice...I've had better before.\n\nThe ribs had a nice flavour to them, but they were very tough to chew and slightly on the dry side. The rice wasn't as sticky as I would have liked it to be either, but I enjoyed it nonetheless. One good thing is that they give you plenty of food for the price, which is always nice for folks like me who are going to school and trying to save some money in the process.\n\nService is lackluster here to say the least. No friendly greeting when I walked up to order, no \"thank you\" when leaving either. I'm a firm believer that first impressions are everything for a business, even if it's a food joint. Service is also very slow here. My meal wasn't very complicated at all, yet I waited around for a good fifteen minutes even though there were very few people in front of me.\n\nWouldn't recommend this place to anyone really. They need to at least step up their service if they want to bring in more customers.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 116, "review": "Went for a quick dinner at L&L Hawaiian BBQ a few days ago because I didn't want to spend money Downtown SJ so this was outside of Downtown, FREE parking, not too far from Trader Joe's where I wanted to shop afterwards.\n\nGot the grilled garlic tilapia w/ 2 sides: mac salad & brown rice.  Fish was very garlicky which I liked, too salty not what I wanted, kinda greasy.  Went ok with the brown rice & mac salad.  Slice of lemon on the side too.\n\nYou can charge it if total over $5.  Mine was $7.34- Yay so I could charge it.\n\nOne unisex bathroom you need a token to go inside - ask the cashier.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 117, "review": "Major fail. Despite the fact I spent money on food they would not give me water cups for my kiddos. They will only sell bottles of water for .99 cents. Seriously disappointed. Should have driven to the one at the plant they give water cups. Plus I had to bring in Clorox wipes from my car to clean the high chair. \n1 Curtner Ave\nUnit 80\nSan Jose, CA  95125-1086\nUnited States", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 118, "review": "A week ago I visited this dinning establishment for the first time.  I ordered my meal and then requested a cup for water.  I was advised that no cup for water would be provided, but I could buy a bottled water for $1.  This is rather disconcerting considering that there were cups aplenty next to the register and there was a water dispenser available as part of the soda machine...not to mention that water is a basic bodily necessity.    The same day, I completed an online comment to the company, but they have not responded to my email.  Apparently customer service is not important at this L&L Hawaiian BBQ, and perhaps the company at large.\n\nSetting aside the above critique, the food is neither great not bad, but average.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 119, "review": "Below are few reasons as to why this place gets ONE STAR! If I can give ZERO I would! \n\nThis place has definitely gotten worse over time!!! Been going here since 2008, but haven't been here the past year. I finally came back today for dinner (an hour before their closing time) since my boyfriend and I wanted to get our Hawaiian food fix. \n\nFirst of all the lady in the cashier, which I believe is the owner has a VERY ANNOYING VOICE! I'm not sure if she was yelling at me or that's her normal voice? But she definitely was not talking nice to me, RUDE!\n\nSecond, after we placed our order, I went ahead and asked for a water cup. And to my surprise, they do not provide water cups any longer!!!! She told me to either buy a soda or buy water?!!!!!! I know we're in drought but WOWWWWW. From that moment I did not even want to be in there, I pretty much lost my appetite.\n\nThird, boyfriend and I sat down while we wait for our food to come out which took about almost half an hour for a Katsu and BBQ Mix! While we were waiting for our food, one of the worker started putting chairs on top of the tables and cleaning up. There was about 45 mins until closing time!!!  It is RIDICULOUS, because people were still coming in ordering food! \n\nLastly, when we finally got our food, my katsu sauce was missing so I went ahead and asked for it. She was about to charge me for something that she forgot to put in our tray!!! But she finally admitted that she forgot, so she gave me my sauce!\n\nOverall, this experience ruined my night and my appetite. I love my Hawaiian food but definitely will never get my fix here ever again! If you want your money's worth, please help yourself and get your fix somewhere else! \n\nP.S. This place raised their price up like crazy compare to other L&Ls!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 120, "review": "Bring your own cup. They don't have water cups!!!\n\nA full house and they start putting chairs up 45 mins prior to close. Everyone is leaning against the walls for there food to come out. Bad bad bad. \n\nGo somewhere else food your Hawaiian bbq fix.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 121, "review": "They charge even for cup of water. Also their stuff are not nice. Other branches are better. Don't waste your money here.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 122, "review": "First time at a fast food Hawaiian place. I ordered Garlic Tilapia (about $7) and they give you a choice of 2 sides (brown/white rice, broccoli and carrots, French fries, garden salad, and macaroni salad + maybe something else). Big portion of savory garlic tilapia with LOTS of veggies for such a good price, and the food was delicious as well. Well worth a good lunch!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 123, "review": "How can you be so rude? I like their food but just the woman at the register ruining our experience. \nI've been other L&L Hawaiian restaurant, never got that rude attitude. Sad.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 124, "review": "Short ribs were tasty but expensive. The comically miniscule portions at first were disappointing but later turned out to be a blessing as I was crapping my face off about 2 1/2 hours after eating them. The 2nd star is for the one friendly lady working in there.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 125, "review": "How cheap do you have to be when you can't even give free cups of water to your customers, especially when it's an order costing over $20 dollars?", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 126, "review": "Very friendly staff. I came in after the gym and right as they were closing. Took my order with a smile and gave me a free bottle of water because I just came from the gym. Aside from great service, the food is amazing...I'm coming back", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 127, "review": "- Didn't pick up the phone when I called\n- No longer serve short ribs at this location (apparently because it's too expensive for them)\n- No free water\n- Very slow service\n\nThere are definitely better Hawaiian options (and other L&L locations) around!  Go elsewhere...", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 128, "review": "My family and I eat L&L every single week and it was our first time at this location the other day while we were shopping. I'd spent over $30 worth of food and when I asked the cashier for a cup of water she said they charge 99 cents for a bottled water. What??? I couldn't believe it. I had to hold my composure from cussing her out. This is the first time I've ever been to a restaurant where they DON'T give out FREE tap water to customers. My family don't drink soda. What do you want me to do? Buy a nasty bottle of Arrowhead for $1 or buy a cup for $2??? I'm already spending over $30 on food, the least you can do is give me tap water. I couldn't believe it. I walked my ass down to Target Starbucks and got a free cup of water. I couldn't believe it. My husband couldn't believe it. Very upsetting, very disappointing, never coming here EVER again. My loyalty will stick to our REGULAR LOCATION since we eat this weekly.\n\nBesides their stupid water policy, their menu had hella threw me off cuz it doesn't look like the typical L&Ls. I guess cuz this one is newer so its more modern now with the moving screens. Their prices are a bit higher than your typical locations. The highchair was sticky and had hella food on it,  I had to clean it myself.\n\nI ordered the loco moco and the patty was straight up burnt. After I finished it gave me a stomachache and I had to take a #2. Strange cuz I have a pretty strong stomach and rarely have a bad #2. \n\nOverall this location is a bit more pricey than other locations and they DO NOT GIVE OUT FREE WATER which is ridiculous. How can you build customer loyalty with a policy like that? I bet the cashier hates telling the customers that and gets shit about it all the time. Cuz I was about to go off. Anyways, never coming back to this location because they do not give out free water and my loco moco was burnt and made me take a #2.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 129, "review": "Flat screen menu boards have too much motion: so you start to read, then it changes - bad implementation. Too hard to follow and make a choice. \nOrdered brown rice with orange chicken dish, but was served white rice.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 130, "review": "The best thing about L&L is the mystery.\nThe menu (there's only one in the place, and the screens only display certain items at a time) has no descriptions, so every dish is a surprise.\n\nAlso, food was not great.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 131, "review": "I was very disappointed with this L&L. I ordered a chicken katsu which came to about $10. My friend ordered the same. I was super thirsty so I asked for a cup of water. The lady said they don't give free cups of water. I don't understand why I can't have a small Dixie cup of tap water when I just spent $10 on a meal?? When the lady at the counter gave me my food I asked for katsu sauce and she said that would be 50 cents. I then asked her why I would pay for katsu sauce for my katsu chicken. She then proceeded to tell me that I ordered barbecue chicken. My friend and I both told her I didn't. She then said yes you did and walked away. What awful customer service! Worst part is she didn't even give me a receipt so I couldn't show her what I actually ordered. I will not be coming back to this location!", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 132, "review": "Got Spam Saimin for lunch after shopping at the nearby Marshall's store.  Conveniently located and lines are quick even if it's lunchtime.  I usually get loco moco or spam musubi here...but you can't go wrong w/Portuguese sausage, eggs & rice plates.  My boyfriend always likes the BBQ chicken bowls...but I prefer BBQ beef w/a side of kimchee....AaaaalooooooHA!", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 133, "review": "HORRIBLE SERVICE!\n\nI would not come back here again! Our workplace had a Christmas party set for the 18th of December. I phoned in the order 2 days before, which was the 16th. According to their menu, only select items needed a 24 hour notice prior for pick up. Just to be safe, I ordered the food 48 hours in advanced. I ordered the small family combo that included beef and chicken and a small plate of chicken katsu. When I finally got there, the line was long (which was to be expected since it was during the lunch hour rush). I finally get to the cashier and I asked for my order. I was rudely greeted by an Asian woman (I don't want to sound like I am pointing at one race, but that was who she was.) Bellow will be the dialog that I had with the woman: *Note that A=Asian Lady and M=Me\n\nA: What can I help you with? *in a very rude tone\nM: I came to pick up my order under (gave her my name.)\n*Goes in the back and later comes out\nA: It's not yet ready. You should have called earlier.\nM: I called on the 16th so that was not early enough for you?\nA: You should have called before you came to make sure it is ready. *in an annoyed tone\nM: So I have to call at least 24 hours in advance, which I gave you 48 hours instead, and then I have to call again before I pick up? (I'm already annoyed at this point)\nA: Yes you have to call because we are very busy.\nM: In other words: I can't trust that my order will be ready by the time I asked for it? \n*next set of dialog will be the turning point of the conversation on as to why I don't want to do any more business with this L&L\nA: Can you move aside and let me handle the next people in line so we can get this going?\nM: Excuse me, but 1- I didn't get a reason as to why my order was not ready on time. 2- I didn't get a time estimation on my order as to when it will be ready now that it has been screwed up, and 3- I wish to speak to your manager.\nA: I AM THE MANAGER and it will take 15 minutes for YOUR order to come out.\nM: You don't have to yell at me. Looks like you need to go back to customer service training and get re-trained for how to deal with these situations. \n\nAfter another 30-45 minute wait, after she told me that it would take another 15 minutes, she called me up like I'm a \"nobody\" saying: \"YOU, you're order is ready.\" When I finally paid she didn't even offer anything, not even a \"sorry,\" as to why my order wasn't done on time. By the way, I had to carry all this to my car.\n\nI will NEVER come to L&L again! Poor and RUDE customer service.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 134, "review": "You know how you could go to any McDonalds, Starbucks, or other major chain and pretty much be guaranteed that your order will cost the same, be prepared the same, and the service will be the same? That's definitely not the case at this L&L...\n\nI get the same dish at every L&L I go to. Unfortunately the chicken here tasted bland and flavorless, and the macaroni salad seemed to just be macaroni and mayonnaise. I didn't even finish the meal (which is usually never a problem at any of the other L&Ls I've frequented because the food is so juicy and tender!)\n\nThere are no free water cups, only bottled water for $1. They don't serve short ribs I'm assuming because of the markup in price they can't justify. And there's no station to prepare little to-go cups of your favorite sauces (ketchup, sriracha, or teriyaki sauce) - instead they charge $0.50 per sauce so make sure you pour it over your to-go dish before you leave. \n\nSMH.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 135, "review": "This is by far the best l&l establishment ever. Anyone who is willing to give this place any less than 5 stars does not understand that the reason this place is so special is primarily due to DOLE WHIP. made famous from Hawaii and Disneyland this is not a dessert that you run into very often. \n\nThe food is what you would expect at any Hawaiian BBQ place. The facility is clean and the workers are friendly. \n\nI have driven up to 25 miles 3 times a week for dole whip in San Diego and upon moving here from san diego I thought I would only get dole whip at Disneyland. Boy was I wrong. \n\nThis place deserves 5+ stars. If you haven't tried dole whip try it!!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 136, "review": "Seriously?! No ribs - after someone already mentioned something about it two months ago? Okay, I guess, some restaurants are just bad at coming up with good strategies. Fine, but please add some extra meat into my BBQ mixed plate - don't just take out the ribs...\n\nAlso, no water cups. So, you have drink either soda or bottled drinks.\n\nFinally, the person at the register must be having a really bad day, or she simply has a bad attitude.\n\nOverall, this location is not very service-oriented and is nothing like the other L&L chains I have visited.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 137, "review": "sometimes the food takes awhile to make but just means that it's well prepared.  good selection here, cheap prices--fan!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 138, "review": "2.5 stars \n\nWell.. not the first L&L on my list of chains to go to. \n\nThe food takes forever here no matter how many people are in line. \n\nThe katsu was burned..... (sad face). Fortunately the love of my life shared his pork. \n\nAt least the mac salad was consistent with other locations \n\n\nOne plus: outside seating... where I saw a Smashburger and was immediately jealous. \n\n#shouldhavegottenaburger", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 139, "review": "One of those spots that can never ever fail me is Hawaiian barbeque.  Plenty of good food with lots of flavor at a cheap price?  Yep, that's where it's at.  Usually my two choices are chicken katsu or the Hawaiian BBQ chicken, as it's really hard to go wrong with either.  I was actually pleasantly surprised at how much this location gave for the regular size, that much food all at once is almost too much!\n\nMacaroni salad = addicting like crack.  I might love this stuff as much as I love the chicken.  And also love how they actually have the brown rice option as well.  I mean, this isn't exactly the healthiest option in the world, but there are certainly far worse options.\n\nDefinitely one of those solid comfort food options for sure.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 140, "review": "I've been to many L&L's here and in SoCal. This location is pretty decent. It's clean, has the usual L&L Hawaiian decor and chill Hawaiian music playing when you walk in. \n\nAs for the food... I had a bbq chicken bowl. It was great! The BBQ chicken was perfect. Not over or underdone. Marinated just right and not over the top salty. I didn't order the Mac salad... It just sucks that they add tuna to it. I like mine simple!\n\nThey are pretty good at keeping the dining area clean. After each customer leaves, the person at the counter wipes down the used tables.  It's located in a shopping plaza with many other stores to visit and a lot of parking.\n\nI'll definitely be back.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 141, "review": "I love their musubi's. We always ask for them to be cut in half but it was never a problem before. Today they said they charge 49 cents just to CUT a musubi in half. Seriously?? That's just ridiculous.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 142, "review": "This location does not offer free water, you are forced to buy a drink.  Strange.  Food was on par with other HI BBQ .  Service was ok.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 143, "review": "Food is okay. Service is terrible, especially compared to other L&L. Also pray that you don't choke, they would rather have you die than give you some water to help you.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 144, "review": "The shadiest L&L or restaurant for that matter! No courtesy cups for water... Only bottled water that they sell and $0.25 to use their bathroom!! Really??!!!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 145, "review": "Ok- so one star because they don't give \"courtesy cups\" for water... Even when you buy food.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 146, "review": "I came here for the first time by myself, and I was very impressed!  I don't usually eat fast food in general, but this Asian-like fast food was so delish!\n\nI ordered the regular chicken katsu and thought it was pretty pricey for a fast food restaurant.  But I was wrong... THE PORTIONS WERE HUMONGO!  I literally thought the mini was going to be a mini portion, so I ordered regular to suffice my hunger.  Oh my.  They literally gave me an entire chicken, which was so tasty.\n\nI've only heard good things about the chicken katsu / chicken katsu curry here.  I saw that they had loco moco, too!  Such cheap Hawaiian delights, and here I was just thinking L&L was just your average fast food chain.  \n\nIt's super good if you're craving your chicken katsuuuuuu!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 147, "review": "I was extremely excited when I found out that this place serves dole whip since I'm a big Disneyland fan and always never fail to get the dole whip next to Tiki Room :D \n\nIt turns out that the dole whip machine is switched off at 6pm so there's only frozen ones available after 6pm. As a result, the dole whip I got was icy/ slushy and diluted. Definitely not the rich creamy soft serve ice cream I was expecting. What a disappointment :(\n\nI probably would give this another chance, maybe drive back here another day before 6pm to see if the fresh ones are any better!", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 148, "review": "The fast food of Hawaiian cuisine, don't be surprised if you're not satisfied with what you get. I've been to various L&Ls and I had gotten tired of their dry chicken katsu or questionable kahlua pork. I gave this location a try since my friend really wanted spam musubi. \n\nI've never had loco moco before and wanted to give it a try despite how artery-clogging it looked. I tried to be a little healthy and substituted the white rice with brown. Rice, covered with 2 beef patties and 3 sunnyside eggs, smothered in gravy, it was enough food for 2-3 meals. I was pleasantly surprised that it wasn't too salty for me. Though I felt guilty for eating something covered in so much gravy, the quality of food at this L&L location is better than others.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 149, "review": "Service: 2 stars, if you come 30 minutes before they close, they will ask you to take your food to go.  They wouldn't allow you to sit and enjoy  your food.  \n\nRestaurant: 1 star, Bathroom is not that clean, graffiti all over the place and nothing has done about it for at least 2 years.  They will not serve you water unless you purchase water, which is over price, or soda.  Table are dirty and no one takes care of the table.  They don't have water to clean the table.  \n\nWhoever the owner is, I think it's the little Asian lady, they are very cheap on everything.  I usually go to L & L but not ever again at this location.  This location is taking advantage of the franchise name.  I rather go to Panda Express across the plaza than this place during lunch.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 150, "review": "Been going here since I was a kid(I was born in Honolulu) so not much has changed. I enjoy L&L and most of their menu. I would rate it much higher than J&J, about the same as Ohana, and a little better and less greasy than Hawaiian Drive Inn. I wouldn't say it is better than Hukilau though, but then again Hukilau is more of a restaurant and not a plate lunch type of place. \n\nMy faves are the teri chicken plate or chicken katsu plate with spam musubi. I don't see one Hawaiian place on Yelp rated with more than 3.5 stars, so I think people are being a bit critical on Yelp.  I mean Hawaiian BBQ fast food is what it is, it's just Hawaiian plate lunch fast food. It's never going to be excellent and it's never going to be healthy, and it will always be greasy. All you can expect is cheap, fast and tasty food, that's all. I've been to multiple L&L locations in the Bay and they all taste the same to me - like it should since it is a chain.  I feel that it basically tastes the same as the L&L in Hawaii and it should, but my other kamaiana friends from Hawaii say otherwise.  \n\nAs with any restaurant, you have to know what to order.  Not everything on the menu is going to be good.  So giving a two star review just because you didn't like one item on the menu is unrealistic. And this is the reason why I stick to the teri chicken, chicken katsu and spam musubi. I don't even order the loco moco because I know it is not that great. If I want good loco moco I'll just go to Hukilau, or fly to Hawaii.  Even Rainbow Drive Inn in Hawaii is greasy and messy, but that's how Hawaiian BBQ is supposed to be.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 151, "review": "Their customer service is superb! This L&L looks really small from the outside but it's roomy inside. I love that they gave the aisle a big space but were still able to keep a decent amount of tables inside the store for dine-in patrons. \n\nThe night before a business meeting at work, I came to make a catering order.  I really appreciated the girls who took my order. Unfortunately some of the vegetarian options had to be given a 48 hour advance notice so I did not get to order those. But I did order medium trays of the BBQ chicken, chicken katsu, steamed rice. They were right on schedule when I came to pick it up and had one of the cooks help me carry it to my car so I didn't have to make two trips. VERY nice of them. Totally love this place and how willing they were able to take my short-notice order!\n\nThey do delivery but it has to be over a certain amount. I'm guessing that amount isn't $100, as my order was slightly over that but I was still unable to get delivery.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 152, "review": "If i could give them Zero stars I would. I went in to get an order of barbecue and rice to go. The most disappointing experience was being asked to pay 0.49 cents for a side of siracha sauce are you kidding me??. Last time i am bringing my business here. Like who charges for hot sauce after i am buying food from them. Pist me off i really just wanted to throw the cents in their face and be like keep the change to since your ass is starving.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 153, "review": "Good is good, service not so good came in at 8:15PM all chairs were already placed on top of tables I placed my order and I was told by cashier \"this is going to be to go\" they close at 9 and they were telling all their customers the same all orders were to go only.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 154, "review": "Quick service and good food. Good place to get your Hawaiian craving fulfilled.\n\nMy usual:\n-Masubi Platter-Spam, Chicken Katsu, Chicken Teriyaki masubi\n-Chicken Katsu or Chicken Teriyaki mini combo w/2 sides.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 155, "review": "Something that is new to me since moving to the west coast is Hawaiian food. Near my work is Wong Kok; in downtown you have Grub Shack, and within walking distance is L&L. Most of these places have similar items - barbecue trio of chicken, short ribs, and beef; musubi; mac salad, etc. Grub Shack remains my favorite.\n\nI walked in, and the place had a decent crowd for a Wednesday night. Looking at the Yelp reviews and restaurant statement - I went with the chicken katsu and the musubi trio, and a can of punch. The price was a bit high, but not when you realize how much you get. I left with two heavy Styrofoam containers and was wondering what I had got.\n\nMusubi Trio - I thought this was an appetizer, not a full meal. You get one spam, one chicken katsu and one chicken teriyaki. Each one is about the size of your phone, so I have to say I was impressed. Flavor is ok, just hope you like rice.\n\nChicken Katsu - got the full meal and was not expecting how much I was getting. At least three cutlets were fried and dumped in here. Easily could be a meal for two. Came with a lot of white rice and a small container of the mac salad. I felt this was a big miss as I like when the mac salad mixes flavors with other things.\n\nUltimately I was impressed with the portions, but not as much with the flavor. I would still stick with Grub Shack, but if I want something I can walk to that will be meal for 2 nights, this is an option.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 156, "review": "I'm amazed at the low yelp score. This place is great, the food is delicious and the owner is so friendly!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 157, "review": "I've been to LnL's all over the Bay Area. This is the only location that charges for extra dressing. I ordered a healthy chicken plate which comes with a  salad..... I got (and I'm not exaggerating) a tea spoon of salad dressing for a cup of salad!!! When I asked for extra the rude cashier was quick to let me know that they charge .49 extra for each little container.....RIDICULOUS!!!! I was willing to pay... I handed her my atm... She rudely handed it back and said it had to be cash because their is a 5 dollar limit! I will not give them my business ever aging and it's not about the money it's the principle.... Oh one last thing don't ask for a cup of water... They don't give water out either.... You have to buy a bottle of water!!!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 158, "review": "The worst place I've ever been to.  The customer service is absolutely horrible.  They charge you for water and they wouldn't give me one scoop of brown rice and one scoop of white rice even though there is no price difference.  The excuse was they had to walk to two different places, which are 10ft apart. WTF. HORRRRRRRRIIIIIIIBBBBBLLLLEEEEE.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 159, "review": "NEVER EAT HERE!! it has terrible costumer service and the mangers are ass! the are so stingy, they do not provide cups of water and only 1 cup for refills. the tables are always dirty and 1 of the cashiers are so lazy he goes to back on his phone sitting down letting the girl in the front do all the work and the managers don't seem to care. they just let that happen! their bathrooms are so filthy that it has graffiti written all over the walls and the doors and the only restroom that has locks are the women's. this one night after closing I walked past them to see if they are still open and literally the Asian boy was just sitting down with his feet on the table on his phone while the girl cleans the tables, broom, mop and restocks everything. if you don't want to eat at a well established and get good costumer service then you can come here. if you WANT to eat at a well established and get good costumer service then PLEASE PLEASE go somewhere other than here!!!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 160, "review": "I have been to almost every L & L Hawaiian Barbecue in the South Bay and I can honestly say that this is the best one. Now don't get me wrong, L & L's is a chain, and like most chains they are very americanized and they focus on speed above all.\n\nI always get the short ribs with brown rice and mac salad. How can you go wrong with short ribs? At L & L's I have never gotten a bad short ribs. They are always flavorful and juicy. I always tell myself that I am going to try something new, but not all of their food looks so great.\n\nThere really isn't anything too special or out of the ordinary about this place or their food. If you are hungry, on a budget, and you are craving some hawaiian barbecue, but you don't want to go to a restaurant, then L & L's is the perfect place for you.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 161, "review": "NO GO!!!! Unless you like to taken advantage of. The owners of the branch seems to be so greedy and STINGY!!!! I really can't blame the employees as they only work here and I understand they need to follow company policy. But if they are as stingy to their customers, I could just imagine how stingy they would be with their employees and the food they serve.\n\nYes agree with other Yelpers out there that employees may seem rude...but I think it's only because they get the blame for the stinginess of their employer.\n\nFood is good, I admit but then again they have to follow franchise rules.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 162, "review": "New cashier. New stank ass attitude. Don't tell me the grand total 2 milliseconds after I finish ordering the first item because I'm not done. I'm hungry and have a complicated order, lady. \n\nAlso, the whole no water cups due to soda theft thing is pretty sh*tty and says a lot about the attitude of the management. This location is literally the worst.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 163, "review": "ordered spam masubi and bbq chicken. got it to go and came home to realize they forgot to give us the spam masubi. guess I should've checked before I left but I really didn't expect them to forget half our order.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 164, "review": "Lazy wife's little helper! When I'm too tired after shopping, I get Hawaiian BBQ to go. \n\nTry their Short Ribs. Yum!", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 165, "review": "After doing some damage (to my wallet) at Target, my family and I decided to stop by here for lunch. This was our first time ever as a family stopping for Hawaiian food - it's just something that's never on our radar, which is funny because we can tear up some short ribs like nobody's business. \n\n  First thing I noticed was their fancy schmancy digital menu above the registers - it's annoying. This was my first time here so I wanted to look at all my options and the screen kept changing before I finished reading. Luckily they did have a paper version nearby so all was good again. Second thing I noticed, it's a little pricey, BUT they do offer \"Small plates\" that were like $7 bucks, but they are small hence the name.\n\n  We ordered 2 small short ribs plates and 1 kids BBQ beef plate. My Husband and I were both pretty disappointed with the short ribs. They were VERY chewy and too fatty. I guess I'm just partial to the Korean short ribs that are thinner and cooked to where they get that slight char to the edges - sooo good - This was NOT that. My son DID enjoy his BBQ beef, and the piece that I snagged off his plate was very good. He gobbled up his plate so for that reason we will probably come here again - My son is way picky so if I find something he likes it definitely gets put into the rotation albeit a long rotation. Next time I'll stick to the BBQ beef and just avoid the ribs altogether.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 166, "review": "Ran by cheapskates! Only gave 1 sauce for the 2 orders we had. We could of course buy more. Won't go back there are plenty other places.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 167, "review": "I had ordered food for a BDAY party and decided to go with L&L since it's easier and most people like L&L. We had a lot of food. They also deliver as well if it's within a close distance.\n\nMinh helped us with the ordered. I was really happy with the customer experience. He had called me a few days before the party to let me know that the sort ribs that was delivered to L&L was too fatty so he returned them. He gave me the option to change to another dish. I think Minh could tell I wanted to short ribs. He kept me posted on whether he was able to get a new order from his vendor. He sure was able too and we didn't have to make any changes. \n\nIf you are looking for something easy for you to eat for dinner or your guest if you do a party...L&L at the Coleman location is a good option. Trust me not all L&L is the same.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 168, "review": "This place sucks. Sticky tables. Dirty chairs. And no cups for water so I bought a drink cup and tried to get lemonade and it was water. Lol. F--- this place. Don't go here.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 169, "review": "I go here only to get my boss lunch now because of my experiences. The woman at the counter/cashier is always rushed and rude. One time I came in to pick up a phone order and asked for chopsticks, she replied that I needed to tell her on the phone next time or I won't get chopsticks. So the next time I came in person and ordered, asked the cashier for chopsticks and she said ok. When the rude woman handed me the food, I asked for chopsticks again and she said that they do not give out chopsticks for that menu item. I have to use my hands to eat this now? I understand that this is a cultural thing, but I can't eat with my hands at the office. Terrible service.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 170, "review": "Great everything UNTIL....I paid too quickly ($25$) to notice the drinks on the left side of the counter. So I decided to pay by debit again but apparently the iced drip coffee and coconut pudding was under the minimum transaction fee. Are you kidding me? I just spent $30! Nope, not cool. The New L&L Fail!!!!!!!\n-tasty though. but bad policy :( Probably was a sign but I'm sure the \"owner\" would have put the 2nd transaction through if there was any sort of customer service. I mean, I wonder how much they end up losing for walking away on this?! I say owner because I placed my order with the trainee & trainer. I pretty much said, \"What a shame\" but I figure it was a sign to put the drank & puddin back :(\n\nI do not like that policy! A 2nd Minimum Charge block when I just spent $30 :( #fail #badproductivity?", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 171, "review": "I always come here and love the food. Informed that this location doesn't give out cups of ice or cups for water. I generally by one of the Hawaiian drinks and put it in a cup. But I guess I got to bring my own cup and my own ice  that's not very aloha.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 172, "review": "Yo just come here for the food! It's still good even tho it's not cooked by Hawaiians. Idk why they don't offer water cups but just go to smash burger and get a water cup. They're chill about it. Then walk back into l&l and drink the water in their faces!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 173, "review": "Drove here to get pineapple whip. You could tell employees wanted to leave early. Chairs were on the tables 30 minutes before closing and the whip machine was empty. Wasted trip because the employees don't care.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 174, "review": "l&l dole whip record: 0-2\n\n zomgz, r u srs l&l?  your workers are too lazy to make the dole whip concentrate and pour it in your functional machine?!?! it's 95 degrees outside.\n\nmy fault for not following my tip to call before you go.  but srsly, hand the machine over to another l&l if you're not gonna let teh baby roar.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 175, "review": "Their healthy BBQ chicken is AMAZING. It's a really big portion with two sides I had white rice and a side salad. Ranch for my salad sucked but I am very picky about ranch too so... The waitress was very polite and actually brought our food to us rather than just yelling out our number. We had a really great experience..", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 176, "review": "Your average Hawaiian bbq joint. What annoys me is that they don't provide water cups... I swear there's a law against not serving water... But anyways.. I usually get bbq beef for the post workout protein. Spam musabi trio to snack on which consists of a spam musabi, katsu musabi and a bbq chicken musabi. Also the sauce is like 50 cents a container... So yeah prepare to bring your own ketchup bottle and condiments or else prepared to drop bands for some flavor", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 177, "review": "I love L&L yes, it is the best, fast food, just wish that they would take their sign down that says they do not provide complimentary water cups due to soda theft. I have NEVER EVER seen this in any fast food place. Some people just do not drink soda, what if they are avoiding sugar or are diabetic? I see some places or just like McDonalds provide a small cup of water for customers premade. Just a suggestion. Gheez!!!! One can choke on their food!! Then what? Sue your restaurant? Bottled water is great, what if you are short of money???", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 178, "review": "Mediocre Hawaiian food.. \n\nWorkers were impatient..", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 179, "review": "Food pales in comparison to real deal in Hawaii. Katsu, teri-beef, ribs all bland. Even the mac salad was bland.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 180, "review": "Pretty good L&L place, the cashier also takes order from the phone and I was able to order my item to-go. The portion was just as big as the one in Campbell and the food was cooked, well just like any other L&L you would expect. The only problem is the place is crowded with other customers from the stores since this L&L is right in the middle of the shopping center on Coleman. Otherwise, if you do shoppings there, might be a good idea to get some L&L if you don't feel like cooking. Just make sure you order it over the phone if you want to get it quick.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 181, "review": "I am not a big fan of the L&L chain, but this one is the best one I've eaten at in the bay area so far.\n\nThe portions for the 'mini' are big.  Most LL's it's a small box.  Here they give you a regular sized box with enough food to fill you.  The large you get tons of meat and good if you're really hungry.\n\nThe food quality is good.  I got the Kuala Pork and cannot complain.  It was tasty and the sides were good.  \n\nOne of the better things about this place is that is super clean.  Most LL's are dumps.  This one they keep up nice and also the restrooms are nice and clean (for those with kids).\n\nThere is usually high amount of customers during lunch time so sometimes there's a long wait to get your food.  But that's ok, since I know the food is not sitting around but being made freshly for each new customer.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 182, "review": "HO BRAH!\n\nbeing born and raised in Hawai'i, I always get a little homesick.\n\nHawai'i for dummies: no ones kalua pig, spam musubi, loco mocos, teri beef/chix, kalbi ribs, or katsu is ever as good as their MAMAS!\n\nWe ordered a double order of the teriyaki chicken with brown rice and mac salad. +1, tabasco, shoyu, and tons of pepper straight into the mac salad, maui style. aurrryyteee.\n+1 thigh meat with the skin on, not as healthy but brah.. the fat makes it supah onolicious.\n+2 for the selection of food, including healthy alternatives of mixed veggies/brown rice!!\n\n***-1 star for the Hawaiian Sun prices. you shouldn't double the juice prices in an attempt to profit especially while offering fountain sodas. If you're concerned about margin from the $1 Hawaiian Sun at the quantities that these mainlanders buy 'em, the focus is in all the wrong places.\nIf 711's and ABC stores in Hawai'i.. and even Mitsuwa in SJ Japantown down the street can sell them for 80 cents, you can too... link up with their distributor.\n\n\nI always get a bit irritated when these haole cats from SD/long beach act all Hawaiian when they see my Hawaiian Airlines CC or me repping some local island gear. When I handed my CC to the owner, he kept it real and was a true island boy himself! right on!\n\nparking is always a breeze because it's located in the Coleman shopping plaza next to jamba juice, office max, Target, and trader joes!\n\nNO WORRY, BEEF CURRY.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 183, "review": "I really enjoy going to this place. It is fast, convenient and delicious! The manager/owner is often seen smiling and greeting customers.  She is a very nice lady.  I have never had a bad experience when coming here (I've been at least 40 times I think).  I love their BBQ chicken and chicken katsu.  Their spam musubis are delicious as well! This is definitely my go-to place when I feel like getting good food.  BEST PLACE EVER!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 184, "review": "Again, 0 stars! Nothing new. So aside from never giving me my drink that I paid for, I just got a really random message from the former Viet employee guy who was telling me he quit his job, and the non-Viets that worked there made up a bunch of stories to save their asses from getting fired. Because even though they messed up my order, they had to lie and say that I made that guy employee give me freebies and extra stuff just to get that guy fired even though he would \"quit\" on his own anyways. \n\nUmmmmm.... don't the assholes that make the food in the kitchen have full control over what food is MADE AND COMES OUT OF THE SQUARE PEEPHOLE? \n\nLMAO - This is pure comedy. The fact that the Viet middle-aged owner believes those liars is astounding. She is such a fob that she would believe anything those non-Viet employees are saying even when it is clearly a bunch of lies.\n\nUgh, I do wonder if she is really that dense.\n\nIf I really did get all the extra food that they claim I got, wouldn't that be coming from inside the kitchen? What's the value of condiments (soy sauce? tonkatsu sauce? ketchup?) anyways? Oooooh! Or forks and knives, or even spoons! =P\n\nI hope people start realizing how crappy this place is becoming with all those very low-class/non-classy people working there. It's a complete embarrassment...", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 185, "review": "I love going here! It's actually my go-to spot for Hawaiian food in San Jose. The ambience of Hawaiian music playing in the background is so calming. I especially like going here because I occasionally see the owners and they're always so inviting. \n\nBut recently, I started to notice something I didn't like. The cashiers in the afternoon. Most of the time I go here, I'm never greeted with a smile. It's as if they just want to get their shift over with and go home. One of them I really don't like because she has gotten my order wrong twice already at different visits. She never clarifies the order, I have to do it for her. I think her name is Celeste. I really hope the owners/managers see this post because I want to receive my food with some decent Aloha. I don't get it with these cashiers.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 186, "review": "Hawaiian food is very rich and heavy, so I only like to eat here once in a blue moon.\n\nI came here to have their chicken katsu, which was okay. Not very flavorful by itself, so it's almost a necessity to have their katsu sauce with it. Which is also a bit disappointing, because they don't give you very much of it, even if you order their larger portion. As for their macaroni salad, you either love it or hate it. Luckily I'm a fan, but like I said earlier, it's very rich, so don't be surprised if you feel like dosing off after a meal here.\n\nService was pretty standard. It was a bit of a wait, since I came in during their lunch hours. Otherwise, L&L is okay. Nothing about it makes it stand out, other than their sodium-rich menu.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 187, "review": "I have been going to L&L's around San Jose for years. I have never encountered worse service. Their prices are $1 more then the other locations. They charge you for additional sauce ie. Siracha. The staff is unbelievably bad at the couner. I have been multiple time to this location. NEVER have I been greeted with even a smile. A gentle man that ordered food before me complained about it being dry and ask for mayonnaise to make it better and they were charging him .49 to have them squirt mayonnaise on it. He was taken back at the fact that they would charge him and ask for a full refund on his entire order for his family. \n\nHands down worst service. Too bad their food is good, it's the only reason people come back.\n\nTip: change your stupid policies, treat your customers like you want them to come back, and fire your staff that works the resisters.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 188, "review": "This place has the worst customer service. Asian lady(owner) is so rude and disrespectful.Asked for soy sauce she gave me ONE package and wouldn't give me anymore. All she gave me was a dirty look! As I was sitting there multiple people ordering asked for water cups and she meanly said NO due to soda theft no longer FREE you have to buy the water bottle! Many customers were like WTF? seriously? Avoid this place !!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 189, "review": "If you want to just have water with your meal, you need to bring your own.  They don't provide water cups any longer due to soda theft.  Really....you are losing that much money with those tiny water cups they used to give? Yet you charge 1.79 for a regular size soda, I'm sure you make enough to cover a few soda thefts.  There are other ways to address that problem besides taking such a rash decision.  How about turning the soda machine around amd have your employees be in charge or refills?\nAlso if you are open until 9pm then guests should be allowed to eat in your restaurant until 9pm.  Coming in at 8pm or later be prepared to take your food to go.  I only come here because its close to my house.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 190, "review": "No complaints here...I travel a lot for work and was craving a hamburger steak. Best one so far from any L&L in the mainland. Great location, clean and loving the Hawaii Jersey on the wall! Go Bows! Service was friendly, genuine, and professional. Liking the local tunes playing. Will return. Mahalo Nui Ame Maika'i 'Oukou.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 191, "review": "This L&L stood out to me because their portions were way larger than at other L&Ls I've been to! I got a mini bbq chicken with rice and macaroni, and it was HUGE. It was the size of a regular at other locations! My boyfriend got a regular thinking it would be...well, regular-sized. But it was double of what I had and I couldn't even finish my food. It was great!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 192, "review": "I got spam musubi and is pretty decent. The service was pretty bad,  the heavy girl who was working the cashier gave attitude to me and my friend and a few customers who came after me. I guess she doesn't like working there.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 193, "review": "Slow. Slow. Slow. SLOW!\n\nPut in an order to go and was told it would be ready in 10 minutes. Arrived 10 minutes later and waited another 10-15 minutes. Call me high maintenance but I hate rushing to pick up my takeout only to find out I have to wait later. \n\nUnlike the El Camino location in Santa Clara, the presentation of the food is poor and the service isn't very friendly. The only good thing was that the food was separated so the Mac salad didn't get completely mixed in with the loco moco. \n\n..WAIT! Dole whip machine?! Okay maybe I'll come back just once more to check it out. But if I wanted more Hawaiian I'll visit a different location.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 194, "review": "Not sure why this location has lower ratings as their quality of food is better in my opinion than the surrounding LnLs. The meat here is always good and the portion sizes are extremely generous. Other places use super thin cuts of chicken and over fry/cook them. Sure they don't have free water but there's places next door that do. Never had them mess up my order, the employees are very nice, the owner is kind as well. Always fast when I phone in. Never any confusion unlike my experiences at other Hawaiian BBQ/drive style places. All in all, if you're looking for good Katsu, come here.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 195, "review": "The two times I've been here, the whole place smelled like cleaning chemicals!\n\nThe smell was so strong I had to take my food to go.\n\nBut aside from that, good decent chicken + rice + macaroni plates\n\n*Tip: order the combo 1 or 2.. they are the same price as normal plates but it comes with a free drink!", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 196, "review": "Every L&L provides water for their customers at no extra charge. This L&L does not. The sign says because if soda theft but when i asked the manager about it, he said that people were rude to him and threw soda at him. All of this was said to me in a hostile manner. \nClearly he takes his misfortune out on his customers. What am i supposed to do with all of this salty food?\nPS. Dont forget when you order, to order your meat \"not burned\".", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 197, "review": "If it weren't for the Dole Whip machine, I would avoid this establishment at ALL costs! The owners are the cheap Chinese nazi types. The kind that put signs up to warn customers not to steal sodas or use the restrooms if they're not paying. And forget using any coupons you get in the mail. Tried to redeem a $1 Musubi coupon and they straight turned me down just so they could save their $1.29 they would make w/o the coupon. HELLA cheap a**es!\nThe one and only reason I will go there is for the Dole Whips, but otherwise will nto give them my business until an ownership change.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 198, "review": "Mediocre food, mediocre service and they will not give you a cup of ice.  If you need to charge something for a cup of ice, I'll pay for it.  I just want ice with my drinks.  How hard can it be to give customers want they desire.  Unless having ice is an unreasonable request.  Wonder if all other L&L have similar policies?????  If so, why???", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 199, "review": "I love L&L! \n\nThis particular L&L is quite awesome for having Mochiko Chicken. At other L&L's, you have to order a party platter to get it. Not here! They have it in the mini or regular plates on special.. although the special sign has been up there for a pretty long time lol.  If you're a fan of the chicken katsu then you will like this other fried chicken style. \n\nI do have to note that the wait time is longer than most other locations. Maybe they make it super fresh but every time I come here the food doesn't come in the order you order it. If you're pressed for time this may not be the best place for lunch. \n\nMinus points for charging for extra sauces on the side. This is the ONLY one that does that. So if you're a katsu sauce fan like I am, scrounge up 45 cents for extra!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 200, "review": "If I could give  this place 10 stars I would. I've yelped about this place once before bc the amazing owners introduced the orange chicken to my fiancé and I. Since then we've been back many times to order it over and over again! I just finished eating the delicious order of orange chicken right now! So I thought id come back on her and encourage everybody to try their homemade orange chicken that can only be found at this L&L   it's addicting!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 201, "review": "Food was good and the portions were generous, but the idea of not having water cups because people steal soda is crazy. I've never seen anyone do that in my life. On top of that, they say only one refill on soda. \n\nSoda costs 2 dollars too. With that markup, we should have unlimited soda refills.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 202, "review": "Fucking outstanding! I get the 3 piece chicken and rice, comes with a side macaroni salad (which is so delicious). I need to stop writing this review because it's making me hungry!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 203, "review": "Great friendly place.  The only L and L that has Pinapple yogurt ice cream!!!  After i finished my Roast pork plate covered with gravey and lg scoope Mac salad, i top it off with the Pinapple ice cream.  Then its nap time.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 204, "review": "Of the L&L's I've been to, I'd say this one ranks pretty high up there. In comparison not only to different L&L locations, this one also is pretty good against any other Hawaiian BBQ places in general.\n\nThe employees here are nice, friendly, and consistent.. and the cooks here know what they're doing. They are also generous with portions.. and even if you order a \"mini-plate\".. the tray still comes out chock full of food. Not one of the small trays.. no.. a regular sized one. I haven't seen many locations really do that. A mini-plate here is filling enough for me.. and for a student, that little extra drive away from campus is totally worth it.\n\nThere's a few other Hawaiian BBQ places that are closer to the SJSU campus.. but the quality and quantity of food just doesn't compare at all.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 205, "review": "Had to come to any L&L as our son who is attending a nearby university and hails from Hawaii was salivating and wanting to eat a loco moco upon we arriving from the airport to spend some days with him during his spring break. \n\nBeing that our flight from HI came after 9pm Thursday night, we had to eat somewere else, so we put this establishment on hold for another day. We had time for it on Friday night after 8:15pm and since we were shopping for something in the same center, we hit upon this location. \n\nWe looked at the prices and said, hmmm. about the same prices as in Hawaii, how come? We thought it would be less... We see differences from this L&L in California and those in Hawaii (Hawaii's L&L having a noticeably bigger selection, which could be Hawaii's shortfall). \n\nWell, we ordered takeout and while waiting for our order, we see many side tables with the chairs on top...like they're saying don't eat here..we're gonna close soon...Don't think they should do this...not good for customer service. People standing about when they could have been seated.\n\nWe order their loco moco (mini) with easy over egg and try their mochiko chicken.\nI was undecided on what to get but settled on that mochiko chicken, and see that everyone behind the counter is of a different ethnicity from what you would typically/normally see in a Hawaii-based L&L franchise. We are thinking do they cook as well? Well, read on...\n\nWe don't see the end result until we take it back to our hotel and become flabbergasted at the regular plate size of mochiko chicken...is NOT greasy, mac salad enclosed in its own plastic container (in Hawaii, they'd just place it next to the hot rice, which would make the mac salad warm), and the salad had TASTE, made with pride.  The mochiko chicken came with a container of light sauce, which we NEVER saw before when served at L&Ls in Hawaii, and added it onto the chicken...Result?\n\nI applaud whoever is in charge of the mochiko chicken recipe/preparation (don't know if it's just this L&L or all in Cali), as it is NOT overcooked, dry, or hardly tasty like that from practically ALL L&Ls in Hawaii (at least on Oahu). \n\nYour chicken was TASTY, SOFT, MOIST, and DELICIOUS and the brown rice option was NO additional charge! You could, no you SHOULD tell L&L's Marketing Director that your receipe should be copied nationwide!\n\nAs for the loco moco, the egg was cooked to a medium, so with not much run off goodness for my son's liking...and it was not much to talk about, but the wife and son was talking so much of this mochiko chicken find!\n\nKUDOs! \n\nNow do something about maintaining the front of your seating area, get those chairs down off the tables!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 206, "review": "Absolute worst experience here ever.  We come here at least 2-4 times a month and I am officially never coming back.  Food was terrible.  Waited 37 minutes for food and there was nobody else waiting for food.  They weren't busy.  They only had 11 people in this place.   \n\nThis place is absolute garbage.   Terrible customer service and I will never be coming back ever again.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 207, "review": "They don't give you water here, you must buy a bottled water. I didn't understand it because they do have a soda machine, it can't cost much to install a water line on it. \n\nService was fast but that meant your food will arrive cold. I had the BBQ chicken plate and the chicken was cold, what's with that? \n\nThey do have a clean store, I was quiet impressed. \nMac and cheese was good. \n\nCold food and the no water are deal breakers for me. I will not be coming back.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 208, "review": "My hubby and I stopped in here for a quick bite (for me). I've eaten at other L&L's and this one was great too.\n\nGood food, clean location, friendly staff!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 209, "review": "If you want Hawaiian BBQ in a pinch then I'd say this place would have to do. The service is slow, which wouldn't bike that big of a big deal if they weren't  so consistently rude. They charge extra for Katsu sauce? ...when you order chicken Katsu? Weird. And don't even get me started on the fact that they refuse to give you tap water but allow refills on soda. Seriously, make the drive down to Santa Cruz for amazing Hawaiian food and service and skip this place, it's worth it. Aloha.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 210, "review": "The staff is on point.  \n\nthe food is delicious.  \n\nI have no idea how the other restaurants nearby get any business when its so easy to walk in and eat here instead.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 211, "review": "This review isn't about the food, it's about the cashier and L&L no longer giving out cups for water.  I asked for a cup of water and she said they don't give those out anymore...ummmm what!?!!!  Then she rudely told me that if I wanted water I would need to buy a bottle.  If you don't like your job, quit!! So anyways if you come bring your own water because there's no more free water. -____-", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 212, "review": "Gave it another chance and the second time is worse than the first time around. Very poor customer service. Restaurant dingy/dirty. Food cold and vegetables not cooked through. Waste of money please do not enter that restaurant if so, at least you can say I warned you.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 213, "review": "The people are rude and the food I received was bad for $12.95 plus tax. That was a lot to pay for something that tasted bad and more than 1/2 the pork was blubbery fat. Asked if I could trade for something else and they refused. \nNever been to a place where they wouldn't make good when the customer didn't like. \nWon't be going here again. :-(", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 214, "review": "Yummy!  The food is decent.  Even though L&L is a chain, there seems to be a difference in the flavor of some dishes and sauces.  I like most of the foods here more than I do at some other L&L's.  The downside is that they charge you for extra sauce.  I understand charging for curry or something like that.  But they charge you for the to go cups that hold sriracha or soy sauce - stuff that sits out on the counter for dine in orders to use endlessly as they please.  not cool for take out...", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 215, "review": "We live in the area and have been to this place a few times. The food is ok but the customer service is horrible. They are stingy on the terryaki sauce for to go food. I mean really stingy, its not like we ask for an unreasonable amount. They dont like kids using the bathroom or buying candy from the machines they had. The lady owner will actually yell at ur kids. Some of our neighbors have had similar experiences here. We have all boycotted this place.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 216, "review": "L&L is the Panda of \"Hawaiian\" food, fast, convenience and consistent with all the other branches. From Sac to San Jose, you will get the exact same tasting food, which is comforting, but weird.\n\nAfter a long day of looking at cats, I just wanted two things: macaroni and BBQ chicken. Done and done. I can never finish a whole box so it's usually split into two meals, great for a lazy person like myself. I like the option of a \"mini\" meal which is just one scoop of rice and one less piece of meat or a regular meal. \n\nEverything is always a level too salty and if they just toned down the sodium and sauces, it would taste infinitely better.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 217, "review": "I was craving some hawaiian food and decided to head here for lunch before shopping at Target. They have the usual fast food hawaiian fare. I ordered the kalbi short ribs and hubby got the bbq chicken. Both were good. The wait was a little longer than other fast food joints. Plenty of seating inside and outside. P.S. they sell really good hawaiian cookies too!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 218, "review": "Lame. The customer service is lacking, they dont accept L & L coupons and its 2-3 dollars more expensive than other places. Oh and they don't give out water cups?? Is that even legal! #Fail #wtf #aintnobodygottimeforthat", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 219, "review": "Came here with my boy. ordered BBQ chicken plate with a chicken egg roll they ran out of chicken so they couldn't get me an egg roll so they substituted it with shrimp I was very pleased with the service!!! I would highly recommend this place !!!great food every time I go and great service thanks guys!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 220, "review": "Came here with my friend to eat lunch. I like this location because you can sit outside and enjoy your lunch. I began to order and got the barbecue mix plate. The Asian lady behind the counter asked if I wanted macaroni salad or steamed vegetables. I told her macaroni salad but when I got my order it was steam vegetables. No big deal I went back in and told her I actually ordered macaroni salad instead. She said OK bring your box back in so I can take out the vegetables.. ok are u serious it was only a few pieces of broccoli but whatever I didn't  want to argue about how cheap she was being. I like this LnL location because the food is good but the asian lady behind the counter which is probably the owner is the most rude and cheapest person ever. What also made her cheap was I asked for a to go bag for me n my friend she was ok just one! Go somewhere else maybe she'll learn how to how to read her Yelp reviews and make a change.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 221, "review": "Food portion is large an cd it's fresh so you can't go wrong. Lunch time is pack but it's worth the wait", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 222, "review": "Sorry L&L. This must be your most challenged location. Last night I stopped in for dinner and was greeted by dirty tables and overflowing trash cans. There were two people ahead of me. 31 minutes later I finally received my food. 31 minutes at a place where you have to go up to the counter to pick up your food? And for one dish? You can do better than that. The loco moco was mediocre at best. Completely different taste than the other locations. I'll have to get my loco moco somewhere else, sorry.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 223, "review": "It was a bit salty. Everything tasted similar as if they're all marinated the same..?? I got the BBQ Combo which was bbq chicken, bbq ribs and bbq pork with 2 scoops of rice and a side of mac salad for less than $9.00 !!!! The price is definitely worth it. I really enjoyed the chicken! \n\nThis location is quite clean and there's enough seating for everyone :).", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 224, "review": "Over priced. Small portions. It Def used to be better. Girl at the register was rude. Can't even get water at the place. 99 cents for bottled water only. Stay away. Go to another L&L.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 225, "review": "I am sitting in here eating at this place for the first and last time.  The staff was rude to every person I saw her interact with.  She refused my wife water after we spent $37 on food.  Then when she didn't give us cups for the soda we ordered she made us wait when we came back to get them.  Then, never even gave us katsu sauce.  It got so bad that i asked to speak to a manger and she said there wasn't one here but i could call.  I called, she answered, said please hold, and left me on hold until i hung up.  The food is barely average.  Seriously, if you read this review respect yourself more than this place will and eat somewhere else.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 226, "review": "Clean-ish L & L, but the girl straight up lied to me and said they don't have water and that I would have to buy a bottle of water. That's pretty messed up! I bought a soda, and sure enough, there was a water option on the soda machine...and guess what!? Water came out of it! Please don't lie to your customers, that's how you lose them", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 227, "review": "I'm in love with L&L's spam musubi. Absolutely in love. The rice is so nice and soft, and their sauce is so yummy! My roommate, who's lived in Oahu for the past 10 years, loooves this L&L, so that definitely says something about the quality of their food.\n\nOnly thing is, the wait is usually on the longer side, and one time, they mixed up my order! They called my number, gave me a bag, didn't check my receipt, and I walked out with someone else's meal. Uhm. Good thing I checked before I got into the car... Came back, told them, and they took it back [...is that sanitary? I mean, I didn't touch the food, but still! I don't know if I'd want food after someone else took it..].. and gave it to the people who ordered it without any apology whatsoever. Uh. Not professional.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 228, "review": "My food was hot. The order was right, the haupia was OK. The thing that did it for me was the teriyaki sauce. It's the consistency of water, which in my previous times dining at this establishment, it has never been. It has always been, you know, saucy consistency. I ordered two take outs, are my order in store and had to dump practically half of the bottle of teriyaki sauce. When I asked for extra sauce for my friends order, I was told they would have to charge .49 per sauce!?  ARE YOU KIDDING ME? I'm not sure if management believes this this is a more cost effective method, but if you have a customer who has to use 4-5 times the normal amount of \"sauce,\" than you normally would, then you'd be using that much more sauce per customer per day. Seems to me it would add up rather quickly. I also was not charged for the extra sauce that I ate while I was dining in so why would you charge for a takeout order? Come on now!", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 229, "review": "Kind chicken crap that they don't provide water you have to buy a water bottle for $0.92.  I have never seen this in the Bay Area.  Short sided and cheap in my mind.  They claim because people steal soda. Ha! Food is good though but the water thing frustrates me.  Nice patio and quick.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 230, "review": "Good food good service and family friendly. What more can you ask for. Chicken Katsu is great and you can't leave without trying the spam musubi. ;) as my Samoan friends would say: cheeehooo!!!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 231, "review": "I made the mistake of coming here again. The prices are higher here than other locations & they dont even take the L&L coupons we get in the mail. Its conveniently close to where i live but now i'd rather drive a lil further for Ono instead. Until i hear tgis location lowered its prices, i wont be back.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 232, "review": "The food is great, customer service is awful ,\nI went in Saturday to order food for my son' s graduation, the cashier \" rosa\" was very very rude, she did not care about my business , she was very rude answering my questions, she told me that they will charge me a fee for catering because I was about 5 miles away, I told her that the girl the day before( very nice) said it will be free delivery after $200, anyway I left my number for the owner to contact me with the delivery fee, he was very, very nice and delivered my food for free, right at the time we agreed on.\nL&L needs to talk to their employees or they will be losing customers!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 233, "review": "I think this place needs to reconsider refusing to give free fountain water for their customers.  What a terrible way to do business.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 234, "review": "This is by far my favorite L&L. I come here a lot, mostly because it's on my way home, but also because their food is simply the best. \n\nThe BBQ beef has way less fatty/gristle than any of the others around town I've been to(Campbell, Almaden, The Plant-all fattier than here). In addition, they make the miso themselves, a special recipe with carrot, and not all L&Ls have the same dressing, certainly no others have their miso. \n\nAnd then, of course, there is the Dole Whip, a little slice of Hawaii/Disneyland right here in San Jose. \n\nAs for others disparaging the customer service/closing issues...I've always been helped kindly, quickly and with a smile here. No matter the server. Also, they have a small baby, and are clearly trying to make a decent life for their child, so to those getting mad at them for charging for water, because customers were asking for \"water' and stealing soda, which I've seen people do in the past give them a beak. And I think the rent of the shopping mall is the reason for their slightly higher costs--give them a break. They're nice people and they serve good food. The baby, also probably the reason for closing at 9.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 235, "review": "Refused to provide water with food purchase on 90 degree day. Won't ever come here again.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 236, "review": "3.5 stars\n\nI came here on a whim because I was hungry. I just got a small order of BBQ Chicken Masubi. I have had Spam Masubi before and wanted to try something new. \n\nThe chicken was placed on top of the rice- I'm used to it being between the rice. Thats not a complaint, just an observation. The chicken tasted good. The only reccomendation I would make is to not have as much rice.\n\nI also split a Thai Tea with pearls with my girlfriend . It was surprisingly really good! The tea wasn't too sweet and the pearls were done very well, even better than some places that specialized in milk teas and smoothies with pearls.\n\nFinal Thoughts: A good place for a quick bite.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 237, "review": "I've eaten here over 10 times. The place is pretty clean and the food seems always fresh. The macaroni salad is good and the chicken and beef is too. \n\nNegative 1 star for the bathroom tokens, I mean this is america and there isn't a bum or drug addict problem in the area so why are they being locked up. Are we being to cheap on the supplies and cleanup duty for good customer service?\n\nNegative 1 star for the no water cups. I mean water is probably somewhere in the market of a couple cents per gallon from the water company. Can you not afford to give your customer 1 cent worth of water?\n\nNegative .5 star for the pricing. The pricing is high for a chicken/beef combo with rice and macaroni salad it is 11 dollars and change. Seems pricey. You can go to a sitdown diner or somewhere for around 12-15 for a meal with free water and bread.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 238, "review": "Very greedy company. They won't give out a cup for water and try to force you to buy a drink. What if I choke on the food?", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 239, "review": "Place has gone downhill...no more water cups for paying customers and smaller quantity of food", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 240, "review": "I love the service here. They never throw attitude unlike other L&L's I've been to. My roomie & I always call our order in ahead of time & they have it ready for us right when we get into the store. The portions are sooo huge, it takes me three sittings to finish a regular sized chicken katsu.\n\n& since when can you substitute white rice for brown rice?! Their brown rice is so good! Not too grainy like homemade brown rice.\n\nPARKING: It sucks. This Coleman plaza has sooo many businesses and not enough parking to accommodate all the customers. Or maybe I'm just being lazy.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 241, "review": "Cheap food not worth the price not to mention a teaspoon of ranch is .45 and it taste like cheap water down ranch. Portion size is small and its not even marinated with the sauces you pay for. personally i would not come back or waste my money id rather go next door to smash burger.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 242, "review": "OMG this is the worse L&L barbecue ive been to. First of all they dont give you cup for water. Second, the girl who took my order did not know what she was doing (I seriously dont know how you can mess up an order here.) Third, the manager was very rude! They messed up my order, which I understand is normal. Tell me why my Seafood and bbq mix plate didnt come with the bbq? Lol. So I went to the counter and told the girl that my order wasnt correct. The girl told me that she had to charge me extra (really, charge me extra for your mistake?). Next thing you know, I found myself in an argument with the manager. Telling me that she had to change my order again and that she had to throw away the food. Basically making it seem like it was my mistake. So I had enough and called it quits. Got my refund and said peace out lol.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 243, "review": "The teriyaki beef is marinated perfectly. If you are in the mood for an Hawaiian style plate lunch, the check this place out. If management would play some Hawaiian music it would add value to create an experience.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 244, "review": "I like coming here when I'm in the mood for \"local food\". It's probably the closest to home that I'll get here on the mainland. I usually get the Mochiko Chicken, it's great because it's moist with lots of flavor. I've gotten their Chicken Katsu, but I found it to be dry and not very good.\n\nOnce I called for a pan of Chicken Katsu and the service I received was terrible! The person I was talking to was very rude and not very helpful when I was asking questions. I probably won't be getting any more food catered, but I will be back for a quick plate lunch.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 245, "review": "If I could give NEGATIVE STARS on customer service I would the quite plump & young lady that works as a cashier is verY RUDE & has a nasty ATTITUDE like your bugging her when asking QUESTIONS. First of all i asked for a extra fork because i dropped mine and ahe TRIED TO CHARGE ME .49 CENTS, i was STUNNED that this girl tried to charge me for a fork. Then i asked for 1 peice of lemon and she said itll be .60 cents COMMON .60 CENTS FOR 1 PEICE OF LEMON, outragous.She has horrible CUSTOMER SERVICE, and ahould not be working in a customer based environment. The food was good thats the only positive thing. If the owner reads the yelps you should take into consideration having that lady for you, one loyal customer lost", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 246, "review": "No toilet seat covers, graffiti on the bathroom walls, need a token to use restroom, a ripped/broken take home container and absolutely NO customer service by rude cashier Laura. On top of hating her job and being rude, she charged me an additional 49 cents to have some soy sauce that should be free! And on top of that pricier than other L&Ls? I think NOT!!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 247, "review": "Owners got in an argument over giving out water cups.  Such a bad business practice to refuse water for free.  They told us to go somewhere else after we ordered. Water is not free.  The owner said tap water is expensive and so are cups. She said people steal soda. I have never seen this practice in the US in any other restaurant in my life. Be careful with the owners.  They can be mean!  Both were screaming and would not budge.  We had to leave. :(. They were so mad that we thought they might do something to our food.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 248, "review": "I usually order the mini chicken katsu and have been happy very time. The portion is pretty big so I always have leftovers. I've also tried the Tilapia Healthy Plate. It's good but too much garlic at times. \n\nThe restaurant is spacious and gets busy around lunch time. I always call in my order so it'll be ready when I get there. Service is good, but a lot of the times the worker in the front is texting on her phone. \n\nOverall I never had an issue with the quality of the food or the restaurant cleanliness. Sometimes the restrooms are out of order, which is a pain.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 249, "review": "I arrive at 8:35pm on a busy weeknight. Get in line and wait. It's now 8:38PM and my turn to order. The older guy whom appears in charge tells me he will only take my order if its \"to go\".  He mentioned they close at 9PM and I would only have 15 minutes to eat. I let him know I am traveling through town and have nowhere else to eat. It's raining outside and I have nice business clothes on. (not eating in my car)\n\nI ask for an exception since I can eat in 10 minutes. He says \"NO that they must close. \"\n\nFlipping idiot.....", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 250, "review": "The food is great. But experience ruined when I saw the manager scold the cashier for telling me what was in something. \"Just say your not the cook, they will buy it anyway!\" She yelled while at front counter. This was followed by a baby crying nonstop in kitchen. Good food but get it to go next time.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 251, "review": "I was at the San Jose Airport and had a craving for Hawaiian Food so I hit up L&L ,I like this one because it has a Bigger Menu and they run Specials. I ordered their Special Combo B which is 2 scoops of Steamed Rice,Spam, Barbecued Beef ,Chicken, Macaroni Salad and a Soda for $8.69 . What a deal . It was a filling and tasty meal for Hawaiian Fast Food.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 252, "review": "This is in my hood and I've eaten here several times. I don't remember when the last time was before last night.\n\nIt all came back to me. Food is pretty much what I expected. Taste is pretty good. I had the Kalua Pork with Cabbage. I picked the Small version. It was tasty without being overly salty. My company had the Katsu Chicken. It was moist and both of the dishes are plenty enough. I took some of mine to go after. We also had a soda to share. Total : $16+\n\nWhat's cool:\n\nI was surprised they offer brown rice as a choice. They also offer broccoli as a side choice instead of the usual warm macaroni. I thought that was cool!\n\nWhat's not:\n\n#1. Everything is styrofoam this and that. Can't recycle styrofoam. Hope they will switch to something more acceptable.\n\n#2. The whole set up could be better. The print on the menu board was so tiny. If it was any tinier I would have to jump on their counter to order. The place could use a little sprucing up. I swear their floor could be cleaner.\n\nGreat potential here to be cooler than they are right now decor-wise. This branch shares a long block with Cost Plus, PetCo etc on a strip mall. Parking is abundant.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 253, "review": "The food tasted fine. However, I can not support this place for the vibe I got from my one and only visit. The no cups for water was my first clue.  The cashier didn't bother explaining why when I asked but just kept saying they don't provide cups and pointing to the bottled water.\n\nI didn't have quite the level of rudeness others here have reported but I did get not so warm responses when I asked about the water and the sauces. I'm glad I didn't need to use the bathroom there.\n\nSo yeah, the food itself was fine, but I just didn't feel welcome the whole time there. I don't see myself ever coming back.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 254, "review": "late evening shopping and stroll...nine:thirty pm dinner...order and awaiting name calling...a longer wait than others...simple spam saimin ramen...spam musubi and a regular chicken katsu...saimin broth quite salty here...two slices of spam browned right...enormous brick of rice and single spam slicing in the musubi...dip in watery teriyaki and acceptable...standard l&l deep fried and crunchy katsu...thin pork center...side of rice and mayo mac...roughly $fifteen meal for two...dislike a forty-nine cent charge for one small container...dislike the cleaning and chair stacking when customers present...do it after closing...", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 255, "review": "Hawaiian BBQ, how can you mess that up? Dirty bathrooms, no free cups, no ice, charging for condiments. The cashier lady was extremely rude and looked like Princess Fiona from the Shrek movies. Although we purchased a drink she would not give us a cup to pour it in without a charge. Also she refused to give us ice without a charge. Is L&L Hawaiian BBQ going to charge us for breathing the air inside the restaurant too? Definitely not \"da kine brah.\" I asked to use the bathroom and the cashier yelled that it was open, it was not. I'm surprised they didn't charge to wash your hands too. I finally use the bathroom and there's Reese's peanut butter cups spread all over the seat. Decided to forget about it. By this time the food is ready. We ask for condiments and are greeted with a 49 cent charge per. Food was okay can't really mess up fried eggs and hamburger patties. Next time, try a different location or just pass the poy mahalo.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 256, "review": "Great food, will really fill you up!\nHowever, their food is pretty unhealthy.\nGet the chicken katsu curry, it has been my favorite for almost 2 years now, but every location of L n L has a different tasting katsu curry. It is really delicious at this location!\nAlso, they have a huge assortment of beverages: fountain drinks, snapples, and a bunch of tropical drinks from hawaii. One of my favorite drinks to get is the guava nectar (tastes a little more raw compared to Kern's juice).\nThe owner of the shop is also really cool, I've been going to that location for 2 years and when I come in, we seem to pick up our conversations where we left off last time (and sometimes I wouldn't go back for weeks).\nGreat atmosphere, good music, very relaxing place.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 257, "review": "About the same as ono hawaiian bbq but with better portions.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 258, "review": "Really?  Charging me 1.79 + tax for a soda I barely touched because you don't want to give free water?  Isn't that Illegal?", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 259, "review": "Came here to order chicken saimin, and asked for a cup of tap water and the cashier said I had to pay $0.99 (what? Tap water is free!). Got my food and started to eat and it tasted like they put tons of salt in my food. Too salty to be able to have another bite, so I decided to tell the cashier. Her reply was \" we cannot do anything because it would take too long to boil water to dilute your soup!\" (Wth!) but I insisted that they must fix it because I couldn't eat it. Yup exactly like how she said. They just added hot water to my soup but only took in 10 seconds! Horrible customer service! I would not recommend this place.  I would give a -5 stars if I could.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 260, "review": "I ordered some food from this restaurant last week for a special occasion\nI worked directly with the owner, who was nice and more than generous\n\nWhen I picked up the food, it was ready on time and packaged nicely\n\nEveryone enjoyed it and the restaurant was more than generous with the portions\nI would highly recommend this place if you are planning a party", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 261, "review": "This place deserves zero stars. I've been here a few times before, never had a problem with service. Well today, as I opened my to go container, a fly buzzed out! I was so disgusted. I moved the chicken around to find maggots! Yes, maggots!!!! I immediately called and explained what was going on and took the food back. The owner was so rude. He stuck his fingers in the maggots and rubbed them together, he said it was part of the chicken! Excuse me...that is not chicken and I'm not on freaking Fear Factor here! Really wish I had taken pics to post. Anyhow, all I wanted was a refund. I was not going to yelp about this but he was so rude and didn't bother to apologize. Super disgusted! :( Totally eek! Me thinks not.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 262, "review": "It's no secret that L&L is my favorite place to eat like ever. This location happens to be my fave. I go there so much that the staff knows my name and what I am going to order before I step up the the register. \n\nIt's always clean. The food is always fresh BUT, I do have to agree that the staff is not the greatest. The new-ish girl they have working there for lunch probably should not be working there. She has poor customer service skills. She needs to put her phone down and work. Hopefully the owner gets enough complaints and puts an end to that because it's annoying. I mean... Who wants to have their order taken by someone who is either texting or on a obvious personal phone call. She's also very lazy I've noticed. \n\nAnd she is the only reason why I did not give the full 5 stars.\n\nMAHALO", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 263, "review": "Their \"brown rice\" is actually overcooked barley.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 264, "review": "BBQ Short Ribs (flanken cut), any Chicken Katsu rice plates, and Spam Masubi makes me happy.  Healthy portion but not so healthy food, unless I listen to my wife and swap the mac salad for steam vegies and brown rice, and cut the size to a mini.\n\nLove their BBQ Short Ribs.  I will even gnaw at the connective tissues or rubbery parts near the bone.\n\nPlease note, they no longer accepts L&L coupons that we receive on the mail.  So, kiss good by to the 99 cent Spam Masubi.\n\nTheir regular size's portion is big, especially the Chicken Katsu.  You get plenty of breaded n' deep fried chicken cutlet, with two scoops of rice.\n\nI do wish they make their own iced tea.  No points taken down for this.  It's just that I hate seeing more and more fast food joint using syrup or insta mix iced tea.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 265, "review": "Probably the best L&L around in my opinion. Food is always good when I'm in the mood and their customer service is sensational. I came here minutes before closing while they were cleaning up the kitchen and they still let my friend and I order! The lady even let me use the bathroom as well even though it just got cleaned and mopped. After we received the food my friend and I ate at the tables outside. Upon eating outside the worker walked to us before closing and asked us if we wanted any water with our food. Lastly, the lady putting away the outside chairs and cleaning outside stopped what she was doing when she came nearby just so my friend and I could finish our meal.\n\nBecause of the sensational service and hospitality of the lady working I am giving this place 5 stars. This L&L location definitely put their customers as a main priority which is hard to see in a lot of chain restaurants these days.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 266, "review": "I'm probably never coming back to this location.\nTonight while I was there, I ordered a meal that was nearly $10 and asked for a cup for some water instead of paying for a drink because I'm a broke college student. Even though it was wrong, I opted to put a little bit of soda in my cup. Not 2 seconds later, I had the Asian woman sitting behind the counter literally yelling at me to pay $2. I poured the soda out of the cup into the soda reservoir and got water. As I was going to sit down and wait for my food, she began making a scene, yelling that I had to pay the $2 or she would call the cops. \nIt really bothered and embarrassed me so much so that I ended up just putting $2 on the counter so she would shut up. \nPutting aside the fact that a cup of soda costs the restaurant approximately 6 cents, I think her reaction to the incident was uncalled for, especially since I come into this location often and spend a decent amount of money here.\n\nAlso, I'm not sure if it's a safety hazard or not, but that woman sits behind the counter with a baby on her lap every time that I've been there. It's pretty unprofessional and I don't think safe for the child.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 267, "review": "Don't really care for this location.  Ordered 2 Mini Kahlua and cabbage....my kahlua portion was drenched in the meat juice...which made my rice a little soggy.  Probably won't be coming back to this location...and if I do..I will make sure to eat there...to address the disatisfaction.\n\nI will stick to my East Capitol location near Aborn.  THANKS", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 268, "review": "Pineapple dole whip = Disneyland in Norcal.  \n\nThis is the only L&L's where you can find delicious soft serve pineapple dole whip for only ~$3!  It came in a \"large yogurtland\" sized cup, or you can have it served on a cone.  Did I mention it tasted amazing and that their employees are super friendly?  Ok, well they are.  They deserve five stars all the way!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 269, "review": "The only reason I give this place a one star is because I have to. Any place that leaves you with no choice but to pay for a bottle is bs. I thought it was against the law to not be able to provide customers with a water cup but guess this place is to cheap to do that. Also when you pay for a drink you're only allowed one fill which is also bs. I recommend going to the one on homestead and Lawrence where they aren't cheap.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 270, "review": "2 1/2 stars....Decent food, mochiko chicken was not crunchy though. Minus 1/2 star because they do not have courtesy cups for water and counter person couldn't bring our food to the outside dining area because she did not know what sauce we wanted, she said she was going to tell us our food was ready when I stepped in.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 271, "review": "Always a go to if you need quick and Hawaiian style food! I'm loving the healthy plates they offer now. The garlic shrimp and BBQ chicken are delicious!!\n\nAlways get a Hawaiian sun w it. And even a spam musubi mhmmm\nDon't miss out!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 272, "review": "This is my favorite menu choice for an L&L in the south bay.  It usually has people in it, and an interesting mix of clientele honestly.  they take longer than some, and I assure you for the amount of traffic they have, I think they are reasonable about how fast they turn around food.  Why does this place get 4 stars?  I don't think L&L could really get a 5 stars, but this one does have more than the usual fare. It also has spicy chicken, mochiko chicken, and the other options vary, depending on the day.\n\nI don't know why people expect food to come out instantly just because it's casual food.  They fry to order people... adapt! Also, if a place is called a Barbecue, I would focus not on saimin, but on the grilled and fried foods. I know that L&L carries saimin, but I have never been to one that has good saimin. Most of the negative reviews are for that.  \n\nFavorites for me are:  mochiko chicken, chicken katsu, BBQ beef and ribs.  When I feel like I need to just have something dense, I'll get the loco moco, with a sunny side up egg.  Their mac salad is always solid, and get steamed white rice, not brown, unless your diet really requires you to.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 273, "review": "Good food! Love Hawaiian style BBQ especially their new fried tilapia. Only complaint was that the inside tables was a bit messy but they were really busy the time I came to this location", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 274, "review": "The owner of this please is really rude with people works with her. Horrible food! The owner will kick you out if u get more soda. U only can have one refill .. Don't go there", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 275, "review": "I asked for a glass of water, and they informed me I would have to buy a bottle of water. I ended up paying $1.99 for a soda so I could fill it with water. Seriously? I'm paying $9 for a meal and you can't afford me the convenience of a small plastic cup for water like every other fast food joint? Definitely won't return to this location, but overall L&L has decent (yet overpriced) food.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 276, "review": "Anyone's that been to the Dole plantation on Oahu knows that Dole Whip is amazing. And that it's distribution is extremely limited. So when I found out that this L&L location had it (or something similar, I don't know, I didn't get to try it) my husband and I went out of our way to go get some one night. We walk in to a busy restaurant full of people eating, and the girl behind the counter says they just turned the machine off. We gave them a wtf look and turned around and left. We thought, well maybe they're closing soon, but it was only 7:15. We tried to find their hours but they didn't even have them posted on the storefront.  It would have been nice to try some of their Dole frozen yogurt, but I guess the employees are too lazy to keep the machine on until closing. Maybe that's just too much to ask for...", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 277, "review": "I like going here since their chicken katsu is very crispy and the sauce that goes with it is very good. Also I usually don't like cold macaroni but this place has changed my mind. The macaroni has a creamy, sweet and salty taste. It sounds weird but it's really good. Every time I go in the evening, there's no line. Food comes out pretty fast and fresh. The only thing is that it's on the pricey side so I can't really come here as much.\n\nAnd I want to thank the girl working at the counter who ran out to give my friend her purse when she had forgotten it at her chair. Their staff are all very nice people.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 278, "review": "Their mini is mini in name only, as it comes served in a regular sized box. This is the first L&L that I've seen that serves such a large portion for a mini. Sure, the mini price is higher than at other L&Ls, but I was still pleasantly surprised to receive such a generous heaping of meat. \n\nThis place is also notable for the fact that it's cleaner and that their staff is more friendly and receptive than at other L&Ls *cough Palo Alto L&L cough*\n\nLastly, regarding taste, my usual (BBQ Chicken) tasted more savory than it usually does at the Mountain View and Palo Alto L&Ls.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 279, "review": "this review isn't even about the regular food there..all honesty I could careless about their Hawaiian food..its about the dolewhip..they will continue to get my business because the dolewhip is SOOOOOOO GOOOOOOODDDD....MUST BUY MACHINE!! NOM NOM NOM NOM", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 280, "review": "BBQ Chicken and/or chicken katsu = LOOOOVE \n\nI've been to several L&Ls and I am not sure if we just hit this one on a fantastic night or what the chicken katsu was PERFECT and by far the most tender, juicy plate of it I have ever had (well, from an L&L anyways)", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 281, "review": "This place gave great customer service! I got a catered lunch ordered for my work and everyone in the office LOVED the food! We ordered the Chicken Katsu, BBQ Beef, white rice and macaroni salad. Many people in the office couldn't believe how food the was... one person even though the chicken was pork since, as he put it, \"it tasted WAY TOO GOOD for it be chicken.\" Everyone was full and there are still leftovers!\n\nNot only that, they were really helpful in assisting and reassuring me that the amount of food I was ordering would be enough for everyone. Usually they do not deliver but they were awesome enough to offer it for us which was SUPER HELPFUL.\n\nWe will definitely order from them again!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 282, "review": "L&L is like a little bit of hawaii in california.  If you want to know what people in hawaii eat, and the portion size they devour, this is the place to find out.  Of course it's a franchise, but for some reason i find it amazing how accurate the taste is to the same establishments in hawaii.\n\nI love the Katsu Curry, but the last time i was there they were ultra skimpy on the curry...i was a little upset.  By the time i received the meal, there wasn't any curry except for what had soaked into the chicken katsu...usually there's at least enough to spread on the rice a little...sheesh!\n\nThe portion size is large and you probably won't go home hungry.  I typically recommend the BBQ plate to people that want to try a little bit of everything since it includes Teriyaki Chicken, Teriyaki Steak, and Korean BBQ Ribs.  I typically DON'T recommend the Manapua and many of the \"side\" items because they are just way too expensive for what you get (Manapua = $2.25, but you can get them in Hawaii for $1 or so).  It's not like they don't have the Char Siu Bao (bbq pork pun chinese equivalent) somewhere else down the street for even cheaper.\n\nIn the end, these places are really only as good as the last meal you've had there (and i wasn't really happy with my last meal there), and honestly, i've spent too much time reviewing this place in the first place.\n\nHappy Eating!", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 283, "review": "Food is okay here but the 1-star review is mainly due to the customer service. Earlier this year, they gave me an extra scoop of rice in place of the macaroni salad even though I didn't make such a special request. When I pointed out the mistake, the cashier gave me attitude - where was the aloha spirit??? Unfortunately, my friend was waiting for me in the car so I didn't have time to deal with this B.S. I'm not expecting 5-star service here but any restaurant should make corrections for their mistake instead of giving the customer attitude. Haven't been back there ever since this incident.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 284, "review": "I'm a big fan of chicken katsu, and by far, this L&L has the best chicken katsu variation there is in the Bay Area chain. Other L&L's don't have their katsu as crispy on the outside, and appropriately tender and juicy on the inside - this L&L has that perfect crisp:tender ratio I look for! Not to mention that their katsu sauce is, for some reason, distinctively different from other katsu sauces of the chain. Only downside is they charge extra for the saaaauuce!\n\nAdditionally - other L&L's kind of skimp out on the mini portions. Order a mini here and you'll question yourself whether or not you ordered a regular!\n\nThey've got brown rice in house, which is always a plus to knock the wind out of your guilty pleasure sails (and promote bowel movement - hehe).\n\nThe tables outside make it perfect for me to take my German Shepherd pup out there on a long sit, and enjoy the sunshine while we both grub.\n\nManager/management is great - he says hi to me all the time by name, but I forget his name!!! Sorry man, but here's a Yelp! review to kinda even that out.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 285, "review": "I came in one day, I was out in the neighborhood and since I dance hula, we were out leaving show materials and sharing Aloha in the community.  I went in, ordered food, left some cards for the luau we are having.. I always see cards related to good island music.. so I figured I'd share.  I was very surprised to see the owner go over to the cards and toss them in the garbage.  So let me re-iterate.. She owns a Hawaiian based business, she serves Hawaiian food, the business model and decor is all Hawai'i and Hawaiian based, but she does not support other Hawaiian places in the community.  Can you say Aloha leech?", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 286, "review": "I save 5 stars for a top notch experience, so I typically start with 4 stars.  \n\nMinus one star for charging .50 for katsu sauce.  The main ingredient is ketchup for god's sake!\n\nMinus another star for putting all the chairs up on the tables at 8:15 when you close at 9pm.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 287, "review": "Went there with my family to have a quick lunch before getting on a plane. They wouldn't give me an extra plate for my kids, as we were sharing the dish. They asked me to \"cut in half\" the styrofoam plate/lid containers and use that as a plate!!!\n\nWhen we were done, we had left overs and wanted to take them with us, so I asked for a to-go box. They wanted to charge me $0.49 for that. I was upset. First they didn't give me extra plates to share the food with my kids, and then they would charge me for a to-go container! \n\nI spoke to the manager/owner and he wouldn't budge and still insisted on the policy of charging $0.49. This should be part of the cost of running a business. It's common in any restaurant in this country. Sad to see the customer is not valued much at this place.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 288, "review": "I love L&L  This is the closest one from my house. I usually dine in here when I'm doing errands.  My partner and I would always get the BBQ plate and share, portion is just enough for the 2 of us. Spam is my fave food but their Spam Musubi is just ok. I could barely taste the spam because it was cut so thinly. I can make a better one at home :(", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 289, "review": "most of the complaints are around customer service. if you focus on the food, it's an good place to grab a fast meal that tastes good and won't break the bank. if you think that you should be treated like royalty, you're in for some heartache.\n\ni don't like the macaroni salad at this location - it has absolutely no flavor at all. Also the beef tends to be tough and stringy. the chicken is usually good whether you get the katsu or bbq. the gravy fries are pretty sweet too.\n\nso run in, grab your food and get the hell out...everybody will be happy and nobody's feelings will get hurt...", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 290, "review": "Feeling nickel and dimed! They don't provide water cups, so I had to buy a soda just to get water. Lame. What's up with the bathroom tokens too? C'mon L&L you are better than this.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 291, "review": "Been wanting to try this place and had a coupon which for some reason they didn't accept.  This place is not well kept, food not very good and prices are high compared to comparable places. Won't be back even if I have a coupon and they honored it.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 292, "review": "The location is good. I ordered two spam musubis. The spam musubis were good as usual.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 293, "review": "The food is good but this rude lady of Asian decent is so mean and is basically yelling while she talks to you. Her customer service is so bad !!! She said my friend and I couldn't share a drink. It's our money isn't it ?", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 294, "review": "The food is pretty good but the service is the worst. Showed up at 8:25pm and they would not let us eat there although they say they do not close until 9pm. The chairs where being picked up around everyone and it was pretty much please leave as soon as you can. Don't think I will be wasting my there, looking for a new alternative.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 295, "review": "This Target plaza has EVERYTHING. \n\nCompared to the L&L I've been to in Sunnyvale off of Homestead this place wasn't as good but it did give MORE food. \n\nI only order the Loco Moco, side of Macaroni salad, and Masubi. \n\nI liked the Masubi the best. \n\nI'd be down to try the Pineapple dole next time! \n\nI wonder when I actually going to HI will I still like L&L....", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 296, "review": "I usually go to the L&L's in Aborn but I went here instead because it's close to my boyfriend's workplace. Anyway, I like how the place looks really clean and spacious. Food here seems a lot fresher than the one in Aborn so my bf was very happy when he got his usual bbq beef.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 297, "review": "Fail.  \nI get here at 8:30, they close at 9. I'm told they are only doing take-out because they are closing soon. \n\nThey monitor soda refills. Customers are policed and cannot get more than 1 refill. The actual cost breakdown for a soda is maybe 10 cents. \n\nThey charge for any substitution. If you want tartar instead of katsu sauce. They ding you every time. \n\nThe bathrooms require a coin and don't lock. They have been tagged beyond description. And have been since they opened.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 298, "review": "Used to love this place because it was quick and easy.  Now its simply overpriced. Idk if it's just this L&L but it didn't cost you almost $10 to get chicken katsu.  If price weren't an issue i would say the mochiko chicken is a good here but it pricey is.  If you looking for a good deal,  go to Hawaiiann Drive inn near SJSU during happy hour. Even if it's not happy hour it still beats this place.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 299, "review": "Delicious food and quick service! I get the BBQ Chicken plate with rice and macaroni, but there are many options available like pork, fish, and beef! All Hawaiian style!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 300, "review": "I like their food a lot but have not been in a while. My most recent visit I ordered my usual BBQ chicken plate for a total of $9.73. What really upset me and may keep me from coming back is the nerve they have to not offer water cups. I mean I'm a paying customer. I get not giving out cups to just anyone but please. It's not like it's the cheapest lunch on the block. Very greedy if u ask me.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 301, "review": "Lately I've been craving mitsubi.  Probably b/c I am the only non-muslim in my family, but somehow the thought of warm SPAM, tethered to a dense clump of rice by a belt of seaweed is just ON MY MIND!  You know how that is?  \n\nAt the L&L, they have something better!  It's called the Trio Misubi and it's three misubai (what's the plural of misubi?!).  One is SPAM, another is chicken catsu and the other is terriyaki chicken.  Darn!  It's primo comfort food.  They throw in a catsu sauce (sweet and sticky) and you grab some terriyaki sauce and you have a carb overload with no vegetable-redeeming value.  Sometimes that's all you need.\n\nSo what is heaven?  Lying on the bed, eating misubi and watching the Giants hit the ball, throw the ball, catch the ball.  The only thing that is better than that involves sanguine conte charcoal pencils and rough watercolor paper that you can get at the art store (Michaels) right next door.  How cool is that?!  Life is good.  Don't hold my lust for spam against me.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 302, "review": "When I am super hungry and don't have a lot of brainpower left from work, this is one of my to-go places.  The staff is super nice (shout-out to Patty and Minh!), and the food is always as good as the last time.  The only things I order from L&L are Chicken Katsu Mini, Spam & Eggs with a side of Mac Salad, or Spam Musubi.  YUM!!\n\nI recently had a dinner party catered by this location, and they did an awesome job!  I got everything I ordered and it was ready for pick-up at the exact time I specified.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 303, "review": "DO NOT COME HERE! This place is the biggest rip off. They continue to jack up the prices while the portions get smaller. To top things off they won't give you tap water b/c they claim that people are stealing soda. Are you serious? First of all the tap water cup is tiny so they need 50 refills of that to make a dent in your profits. Everyone knows that the mark up on soda is huge and it literally only costs pennies. This is the worst location with the cheapest owners. They are just out to gouge you to make a big profit. Go somewhere else please where they will give you free tap water.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 304, "review": "I wish I could give this place zero stars if it was possible.  Their customer service really really SUCKS!  First of all I placed my order with the so called manager that was also on the phone at the same time.  She repeated my order back to me correctly but when I actually got my order, it was wrong.  I ordered BBQ short ribs, but instead she gave me BBQ chicken.  I politely told her that my order was wrong and she just went crazy on me!  Yelling very shamefully in front of all her customers acting like a complete childish fool!  I finally got a refund after all her yelling (even though it was her fault for getting the order wrong) and she told me never to come back...and don't worry cause I would never come back to a place owned and operated by a wretched old witch!  Maybe she should learn to put the phone down while taking her customers order.\n\nPlease don't ever go here unless you want to be treated poorly.  They must not want to make money here since they're so quick to be rude and shoo their customers away.  The owners are IDIOTS!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 305, "review": "Finally, an L&L that serves mochiko chicken.  Not just passable mochiko chicken, but onolicious kine!\n\nThis is is my Sharks pre-game meal place.  Great service, too.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 306, "review": "L&L has always been one of my favorite Hawaiian BBQ joints and this particular location is probably my favorite out of all of them in the Bay Area. At other L&Ls you get this dark, old, and a tad dirty feeling that you will be glad you'll miss at this particular location. The place is small, but the restroom, kitchen, and the dining area is clean. Something I appreciate at a fast food restaurant. \n\nMy favorites are of course their BBQ Chicken! Why? Because they leave the skin on...like totally the best part of the chicken! Besides the BBQ Chicken the BBQ Beef is quite tasty. I usually ignore the short ribs and katsus at Hawaiian BBQ joints because i find them no where near comparison to the real thing at Korean and Japanese restaurants. The spam musubi here though...is nothing to rave about. The portion of spam to rice was whack. Too much rice and not enough spam and it definitely needed more sauce. Not a huge fan. Oh yea and btw their minis are not minis. Also, $5 dollars for a mini is a bit too much. I wish they would lower the prices and make their minis smaller. Minis are suppose to be small and affordable! \n\nIf you want to grab a nice \"little\" lunch, then come to L&L. Just keep in mind there is a bit of a wait for your food during peak lunch hours.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 307, "review": "This L&L is a LOT better than the one in Union City.\n\nTheir Minis are no minis. WTF? I swear to god thats a regular... \n\nSo... what is a regular here then? a TRAY full of food? Eek. I think the mini is enough to fill me up (i couldnt even finish the rice and mac salad)\n\nAnother thing that i like about this place but didnt get to try is that they have softserve. That picture of what looks like an orange or pineapple/vanilla cream softserve they have at their window looks delicious.. Mmm", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 308, "review": "So this L&L wouldn't give me a water cup unless a paid a dollar so I decided to buy a soda an they won't take card unless it's 5$ or more all I wanted was a fucking glass of water while we ate our food an the girl with glasses and bow earrings an drawn on eyebrows just chuckled while I walked away back to my seat to eat my food.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 309, "review": "No butterfish in the laulau. False advertising all there is is pork. I asked the counter help and they said \"I don't know\".", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 310, "review": "The food is bomb, always come here I always get thw bbq chicken with brown rice. The staff is nice and they are very friendly with the customers great place.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 311, "review": "Very displeased with the customer service and the food. Not only did my order come out wrong but they would not fix it. All they said was \"It's called a RICE BOWL.\" I simply asked for veggies and chicken only. They could have told me that it doesn't come like that.... Thanks for belittling me today. Made me feel really stupid. Never going back.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 312, "review": "At first the Katsu here grossed me out due to it being the greasiest I've ever had, but yet every day at 12:30, what do I crave?\n\nYep, it's just as addictive as KFC, kids.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 313, "review": "Went here with 2 kids on a weekday.  There were only 2 people in front of us in line, but the same cashier was also answering phone calls and taking phone orders.  So, it took a while to just place an order.  After ordering the food ($30 plus dollars), kids were thirsty so I ask for a cup of water.  Nope, they don't give cups of water.  So, I decided I'll buy them a $2 dollar drink, but Nope, they don't accept credit card if it's under $5.  By the way, according to agreements with credit card companies, the merchant is not allow to set a minimum limit on when the credit cards.   However, many small businesses ignored that to save themselves a few cents here and there, but didn't expect it from L&L Hawaiian to pull this type of practice.  So, even though we ordered $30 dollars earlier, and no water was provided, we weren't able to get anything to drink for our kids unless we spend more money.. Won't come back again.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 314, "review": "FOOD:\n1.) Grilled Chicken = Mmm! Pretty good! Like a teriyaki chicken. Very simple though. Good for if you're in a hurry or something. \n\nSERVICE:\nFast foody, order / pickup at counter\n\nATMOSPHERE:\nIt's cool how I feel kinda like in Hawaii, with the background music and the few things hung on the wall. Albeit a fast foody place in Hawaii. heheh.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 315, "review": "I've been to quite a few L&L's including the ones in Hawaii but I have to say this L&L'd is by far the best.  Great service and for some reason the food just taste better.  They give you lot's of portion and it's so ONOLICIOUS.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 316, "review": "Horrible food. Not Hawaiian but Asian rice bowls.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 317, "review": "First time I went here and the food was good I might even go as far as saying really good.  I enjoyed the 'mini' portion of the Loco Moco, which I never had before and thought I would try.  The cashier was fine (not overly helpful and not a curmudgeon).  I have to give them props for being clean, for a fast in and fast out kind of place they did a good job keeping the tables clean and the 'front of house' looking tidy.  The prices were good, for two people to have lunch it was under $20, so that was also a plus.  \n\nI did note that they were a little slow I wasn't expecting them to take so long to cook/process my order.  I'm not complaining because it means that everything was cooked fresh and on the spot (well I like to think that is the case).  Maybe it was because I substituted the white rice for the brown rice (another plus in my book being able to swap out the rice).\n\nI'm not sure what lunch would be like during the week with all the people that come to this location from downtown and the surrounding areas but it would be worth a shot.  Personally I can't wait to go back and try something new...or maybe I'll just order the Loco Moco again.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 318, "review": "Love it.  I order take-out once a week and they are always so quick.  Mini kalua pork is big enough for me to have leftovers the next day, what a deal.  The only minor complaint is that they have messed up the order a few times before (though not recently).", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 319, "review": "B and I decided to try something a little different last night and share a plate at L&L.  We ordered a single plate with chicken and rice with a side of the macaroni salad.  The guy that took our order was so nice- he even gave B a calendar with all of the locations!  We took a seat and began to wait for our food.\n\n...and wait... and wait... and talk about politics, global warming, fine dining... and wait... and talk.   Finally B got up to go over and see what the heck was taking so long.  We probably waited 15+ minutes just for one plate!\n\nThe food was pretty good.  The chicken still had the fatty skin on so although the portion was really big, about a quarter of it was inedible.  The rice is just plain white but it had just the right amount of stickiness for eating with chopsticks.  I didn't like BBQ sauce at all at first but after a few bites I warmed up to it a bit.  I refuse to eat mayo (except on sushi) so I didn't try the macaroni but B said it was good.\n\nNot too shabby, just not great either.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 320, "review": "I would give them 4 stars just for the portions and the sauce but the quality of meat brings it back down.  I do like that they have canned drinks from the islands.  I always go with an extra serving of rice (fried rice the next day) because the macaroni salas is just starch with mayo.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 321, "review": "I like it. The manager (who always seems to be there) is really nice and provides good service. The portions are very good; a mini order is enough for me! \n\nYou can't go wrong with the Chicken Katsu but I tried the spicy beef and that was good too - it was bulgogi cut meat but spicy instead of a tad sweet.\n\nI will be a habitual visitor :)", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 322, "review": "good yummy Hawaiian BBQ and macaroni salad xD", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 323, "review": "Food is good. But the service sucks first time I went they were only taking to go orders and they didn't even close for 35 more mins. Second time going they charge me for everything extra. I never been to a l and l and been charge for extra sauce. Never going to this l and l again there plenty of them in San Jose.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 324, "review": "This is sad because I actually really like the L&L chain for the most part and have been to this location multiple times. I have even ordered catering services from this location. However, I will never do business with them again. This location has terrible customer service! They don't give water glasses? Okay, I'll buy two bottles of water. Can I have a glass then so my kids can split one? NOPE. All this said with a crazy attitude on top of the NO from both ladies behind the counter. If they were actually having soda thefts as they state, they should just turn the soda machine around and have their rude employees serve it. I guess management is really stupid or they think their customers don't know they're just trying to sell more beverages. Avoid this location at all costs!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 325, "review": "Extremely courteous owners  and staff!  The food was great and we were offered a pineapple yogurt, for free, to finish off our meal!  Couldn't ask for more!  Too bad 'locals' can't keep their graffiti off their restroom walls!  I still give them 5 stars for their special courtesy and good food!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 326, "review": "Bad service...cashier taking order with talking the cell ph...think abt it. \nNo greeting. will not go again.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 327, "review": "I've always been intrigued by Hawaiian barbecue and thought it would be unique and good. Alas, my expectations have yet to be met. This is the second Hawaiian barbecue place I've tried and my impresso meter is still stuck on \"Meh\". \n\nI had the barbecue chicken which was too teriakylly sweet. Other than that, the rest of it was brown rice and salad. Considering it was a barbecue place, it should've been better. Spam? Uh, no. I get all my spam via email thank you.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 328, "review": "4 stars or service!\nI'm wheelchair bound and I alled to see if they can take my order on the phone, and if I can have them deliver it to me once I got to the place.\nMinh (sp?) took my order, and graciously walked and personally delived my food to me at the parking lot.\nIm definitely impressed.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 329, "review": "I love the food but I WILL NEVER SPEND MY MONEY HERE AGAIN! I came in to order a take out and asked to be charged for an extra sauce. The very rude Asian woman did not charge me and then proceeded once I asked for the sauce to lecture me about EVERY sauce costing 45 cents extra. I told her to charge me, but she did not. I spend $10 in that restaurant and they want to hassle me over 45 cents...they must not like customers because like I said, I WILL NEVER GO BACK THERE AGAIN! Hope the sauce is worth it cause you just lost a regular customer...", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 330, "review": "I love L&L but this location has a staff in the afternoon was not the best . I walked in and there were 2 staff members behind the counter . Neither of them said a word to me .. Didn't get greeted at all until I was up at the register looking at the menu for a min . Not until I set my purse down to get my wallet to order did the 2 finally stop their conversation to day hi to me . After my food was ready it took me to say have a good day for them to stop talking again and say thank you to me . I'm not expecting a full on conversation with the staff but it would be nice to be treated like I was there .", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 331, "review": "This is a good place to go pick up a quick bite to eat. They have massive portions for a cheap price, I usually get the mini meal and still dont finish it off. It is right around the area that I frequent and therfore is a logical place for me to stop. Don't go out of your way to come here but if you are in the shopping area have 5 bucks and want something quick stop in here. \n\nI usually just get the chicken katsu meal and it has always been decent enough, just check it out for yourself. Noted I was the only female (non-employee) in a room full of 15 people....ahhh san jose....=)", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 332, "review": "The best of all the chains! Generous with their portions; you order a mini, they upgrade you to a regular size. Manager and workers offer superb service. The only one I go to.\n\nFood is always up to par! Three thumbs up if I had that extra finger.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 333, "review": "Disappointing quality compared to the past. I've enjoyed ordering from this L&L location before and it was always a treat. The past several months, however, have been very disappointing.  The most disappointing times have been when I ordered about half an hour before the place closed. I think that the poor quality is tied to the fact that I'm probably receiving the last items of the evening, but that's no excuse. I'm paying full price and I expect fresh food.  \n\nIn addition, putting all the chairs on top of the tables half an hour before the restaurant actually closes is pretty tacky. This display says to me that the people who work there are thinking more about wanting to get off of work than they are about providing good food and service.\n\nI doubt I'll return to this location.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 334, "review": "My family and I used to come here a lot because the food was great and the staff is friendly. Now, no cups for water, no Mac & Cheese on the side, the Kailua pork doesn't taste right. Even when I asked for a To-go container, the restaurant wants to charge $0.49 for it. It's ridiculous!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 335, "review": "I love Hawaiian food much less L&L, but do not have any love for this particular L&L.  It is nowhere as good as the Mountain View location.  Their BBQ chicken was definitely off.  Not as much sauce applied.\n\nI suggest that you skip this particular location.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 336, "review": "Does not provide cups for water because some people get soda. So they decide to punish everyone. Although getting soda is bad but honestly how much does it cost them to even give free soda? Pennies on the dollar? I will not be coming here again. Ever.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 337, "review": "I was going to pick up a friend at the airport and had about half an hour to grab something to eat.  I decided to give L & L Hawaiian BBQ in the San Jose Market Center a try.\n\nUpon enter the restaurant there were many patrons and only a few seats left, which I thought was a good sign.  At the counter I ordered the BBQ Mix which consisted of barbequed chicken and beef short ribs, served over some cabbage along with a scoop of white rice and a scoop of macaroni salad.  The meats looked good and were tasty, but they sure were fatty.  That, combined with the carbs from the rice and macaroni salad made for a pretty unhealthy meal.  I have had meals like this in Hawaii, but definitely not something I would eat very often.  The service was pretty quick, so this is a good place for a quick meal.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 338, "review": "If you're having a Hawaiian BBQ craving, this place does the trick. It was mediocre in my opinion. But you get a lot of food for what you pay for, so that was good enough for me. I ordered the seafood combo which came with chicken katsu, 3 fried shrimp and fried mahi mahi (i think...some kind of fish!). The portion was huge - there was no way I could have finished it on my own - and came with macaroni salad, rice and some cabbage for $8.95. Decently flavored, not too oily, just OK.\n\nTo be honest, I probably won't ever come here again since there are so many other restaurants in this plaza center that I would prefer to go to. But if you forced me to eat this, I wouldn't hate you. \n\nI wonder if this review is even helpful, lol....oh well. Happy eating!", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 339, "review": "When I am running low on cash, I seem to always come here. I get the Chicken Katsu mini meal and I ate pretty well for about $5. There is no reason to get the regular meal as it is way too big for one person. Well, that is if they are not Hawaiian. \n\nI met some pretty neat Hawaiians here one time. They had a big group and they ordered a lot of food. As it turns out, they were tired and hungry from rugby. Their legs were the size of my torso and they was pure muscle. I would not want to play rugby against them.\n\nAnyway, if you want a good, cheap lunch - then L & L is a solid option.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 340, "review": "great service every time I come ( eat here once a week.) Kind employees. Food is always fresh.  Employees are always kind.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 341, "review": "Great mac salad! very good chicken! good price, very friendly,", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 342, "review": "I was told that when I experienced the bad food at the Campbell location this one would be much better... \n\nI got the regular size chicken katsu which smelled really good actually... there was a huuuuuge amount of chicken in there and two scoops of white rice which was expected when paying about $8 something per plate... I should've gone with the mini though there was no way I was finishing that... \n\nThe sauce wasn't what I expected it was good at first but I grew tired of it really quick so I didn't eat much chicken mostly rice.  I left over half of the chicken in the plate, I wasn't really impressed.  \n\nNot that I had a bad experience, I'm really picky about my chicken.. but I don't think I'll come back unless I have to =P", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 343, "review": "As a family that is hooked on this chain of restaurants, I have to say, I was pretty disappointed in this place. We rarely ever spend less than $40 for any meal at L&L.  The food was pretty good as usual, however the owner (vietnamese middle-aged woman) was very mean.  Dont even think of letting your child take a sip of your soda because she has built her name as the \"drink nazi\".  She actually came to us and said that we are not allowed to share.  Then she proceeded to tell all her employees what we did...OUT LOUD so everyone could hear.  Not only did she lose us as a customer that night, but she lost us as a customer for life.  I mean seriously, those fountain drinks costs them less than 50 cents and she just ruined it for our family.  Too bad because its one of the nicer L&L venues too.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 344, "review": "I just happend to be in the area, and once my eyes landed on the L&L sign..I was suddenly craving for Hawaiian bbq.  I bought the Half and Half combo chicken katsu and bbq chicken to go for $8.95.  The half and half basically means you can choose any two entrees and have half of each.  Portions are HUGE.  This can feed like 2-4 people depending on how mch you eat lol.\n\nIn my opinion,  the chicken katsu was yummyy! The combination of chicken katsu + macoroni salad + rice in your mouth..yumm...unhealthy..but yum....\n\nThe order did take a while to come out though,..slow pokes.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 345, "review": "Normally, I like L&L.  This particular location, however, not so much.  \n\nMy first experience with L&L was in San Diego, next to a Starbucks where I worked.  Obviously, us food service workers quickly bonded.  So I may be biased in that department.  \n\nStill, my order's pretty straightforward.  Mini BBQ chicken, all rice.  As in, no macaroni salad.  Not too hard, except I've gone to this place twice and they've screwed it up.  Service is also so-so, nothing too quick.  \n\nI was just disappointed by this place, given my good experiences at the L&L I used to go to before.  I may give it another chance if I move back up, but given the other places to eat in the shopping center, maybe not.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 346, "review": "I can never go wrong with L&L for lunch. I usually have the fried mahi mahi mini plate. They call it mini, but it is a lot of food. I couldn't even imagine eating the regular sized plate. They have really good prices for the amount of food they give you. The fish is usually a hit or miss on being really good or just ok. The rice and macaroni salad are always delicious. The staff are decent. They don't seem too excited to work there, but they do their job.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 347, "review": "When I first walked in I asked what the difference between a \"Mini\" and a \"Regular\" sized meal was. The difference is a LOT!!! I received almost 2X the meal with only a $2-3 difference! The customer service was spot on great! \n\nI ordered Kalua Pulled pork and asked it to be mixed with cabbage and some Brown Rice.  It was tender, moist and flavorful! Adding the condiment sauces that L&L provides was heaven to my tastebuds!\n\nI also enjoyed their Chicken Katsu with their curry sauce! DELICIOUSNESS in a spoonful!\n\nI enjoyed  my experience here at this L&L establishment and recommend those in the area to also come here! They played authentic Hawaiian music that gave the place a \"chill vibe\". Bon Apetit!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 348, "review": "I have been going to L&L for their BBQ chicken and chicken katsu since they first appeared in CA, but this location is by far the worst when it comes to customer service. I would give this location a better rating if the lady owner wasn't such a b*tch. She is by far one of the rudest most stingiest Asian ladies I have ever run into. Her husband should be running the front of the restaurant while she is behind the scenes. To make matters worse, they start putting up chairs nearly an hour before closing! Who the heck does that? Terrible customer service for mediocre food, not worth my dime.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 349, "review": "This used to be my favorite L&L, good food, good service, back in the day they even used to hook up an extra scoop of rice with your Loco Moco.  The extra rice stopped a while back but my most recent trip was horrible.  The dining room closed early, the food was burnt, and they wouldn't even give me a water cup!  WTF do you mean you don't give out water cups.  Eating burnt food in the cold with no water, needless to say I'll never go back to this location.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 350, "review": "They count each napkin you used, each drink you refilled. My husband and kid have diarrhea every time we eat here.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 351, "review": "I can has L&L cheezburger?!\n\nThat's about all I order here and damn it's a good burger. Probably best in the Coleman complex, even though Carl's Jr is good too. Their fries are a little weird since they are obviously Ore-ida crinkle cut frozen fries from Safeway, but they cook them nice and hot! I don't order anything else since it's iffy, but the bf liked their spam and rice when he use to work at Target. I DO NOT like their mac salad though, really weird tasting. I only come here for the burgers. Service is a little slow and the place is sometimes messy but hey it's fastfood, I don't expect white linen table clothes, just hot yummy food.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 352, "review": "I love L & L but this particular site charges for the tiny sauce take out cups. $.49 for a tiny cup to take a little teri sauce home. The sites in Campbell and Santa Clara do not charge and are much friendlier! Go to either of those instead. \nNo Aloha in the Coleman site. No mahalo!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 353, "review": "They used to accept coupons from the mail but no longer.  They also charge extra for refills at the Coke machine (a deal killer for me).  I like that they thoroughly cook the meat here; other locations sometimes did not.  Still, I recommend other locations without these policies.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 354, "review": "I tried. I really tried to give this place a chance. Seeing that it was so close to where I lived, I really wanted to like this place. \n\nThe first time, it was their Grand Opening. The staff was nice (well, it was their grand opening). I ordered Chicken Katsu, but was not pleasantly surprised to the side of violent food poisoning that came with it. I couldn't eaten chicken for at least a month. \n\nI figured, I'll give it another chance, since it was their first day and all. Maybe they were a little stressed about the opening. \n\nThe second time, I experienced the worst customer service ever. The story is too long.. but basically, the workers there obviously don't like working there. Or they just don't care. If I were the owners of L&L, I'd put cameras in to watch what my employees were doing. \n\nI will never eat here again. I'm sticking with Red Brick and Panera.\n\n1 star for the egg rolls. Even though the cashier said I would get 3 rolls instead of the 2 I got, they were decent.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 355, "review": "Quick hot food when my family is craving for rice something and quick. The menu is in tiny print so if it's your first time, grab a to-go menu to figure out what you want.  Be ready for some deep fried yummie-ness. Aside from a bed of sliced raw cabbage--vegetables are nonexistent. Carb and meat heavy-- not for the health-conscious.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 356, "review": "OK, who wouldn't love a place that sells spam rice and eggs!  Give me a bottle of ketchup and I'm one happy Filipino!\n\nThe chicken sandwich here is also really good!  I like sticking the macaroni salad inside my sammich.  Is that weird?  Well, its good.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 357, "review": "I love this L&L, been coming to this place for awhile for their delicious spam musubi, Hawaiian drinks, and their macaroni salad that is very addicting. My husband loves their barbecue and my kiddo loves their spam musubi of course. Service is always fast and the staff are super friendly, I asked how much this cute turtle plushie was for my kiddo and the guy there gave it to her for free!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 358, "review": "So disappointing!  I got the healthy brown rice and garlic shrimp bowl, which was over ten bucks. The shrimps still had their feet and skin on it!  i couldn't believe it!  How could you not peel shrimp in a garlic rice bowl!  I couldn't even eat it there.  Had to take it back to work to peel the shrimp and create my own bowl, which made it lose all the garlic flavor. I probably will try it again, but not go for shrimp because I do like that they have a brown rice and steamed veggie option.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 359, "review": "When you want some good ole Kalbi (the BBQ spare ribs - $7.00), you could do a lot worse than L&L. They take plastic, and serve a large portion. The coworkers got the BBQ Mix Plate ($8.00), and said that the beef was better than the chicken. There are chairs and tables at the restaurant, but beware the long line between 11:30-12:00, and just get it to go. Parking isn't a problem, since this place shares a mall parking lot with Target and a number of other stores.\n\nI'd go back here, and it is definitely worth it for the price.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 360, "review": "I'm a transplant from San Francisco to San Jose. I still work in San Francisco and do the commute. AND I SAID I WOULD NEVER COMMUTE. But I do this for my handsome Texan. \nSo I decided to pick up some dinner last night. I ordered the 2 meat special for 8.25 each. You get your choice of 2 kinds of meat\na) bbq chicken with or without skin (please specify), BBQ boneless beef, bbq shortribs, chicken katsu, kahlua pork. It's accompinaments are steamed rice (2 scoops) and 1 scoop of mac salad. I have to admit that this is alot better than the Daly City location. The meat was tender, tasty and OMG the portions were off the hook. this is good for two meals. The people were fast, friendly and very accommodating. One thing that sucks is the rice was a little too al dente. Please fix L & L, but I still love you\n\nLocation is in the mall near Asquew, Michael's, Target, Chevy's, Payless Shoe Source, Red Brick Pizza\nParking: Huge parking lot", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 361, "review": "Hmmmmm. I have never been to an L&L so I really didn't know what to expect. I used to see coworkers buy it for lunch, and it actually looked a lot like things my mom used to cook. Anyways, so this was basically my first experience. And first off I have to say that I was a little surprised by how high the prices were. I guess it's a little different from other fast food restaurants, so I shouldn't have been so shocked. I got a low carb meal and a drink. To me the food was WAY WAY too greasy. The chicken was really gross, but then again, I don't like BBQ chicken of any kind. The beef was definitely better. Props to this chain for even offering low carb options. And an extra star for offering ice cream! Overall, I like the restaurant itself, I just wished that the food was a little on the healthier side. But hey, you should always try new things.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 362, "review": "I have stopped here a few times.   I get the low cal plate with chicken and beef with and egg on top of a salad mix. \n\nSometimes is it very good, tender and tasty.  Other times the meat is overcooked and I quit getting the beef because it had so much gristle. \n\nHit or miss.  Guess is depends what day you go there.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 363, "review": "Went here with a friend, and the food was pretty good. The people at the cash register were very nice. I ordered a Chicken Katsu bowl, and a Spam Musubi. The only thing I believe could have been better is if they added a little bit more sauce tot he Musubi, otherwise it was delicious and so was my Katsu bowl. For the Katsu bowl, a drink and the Musubi it came out to $7.04, so it wasn't too bad. Glad they had the special!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 364, "review": "I've read through some of these reviews and I can't quite agree with them. The employees seemed to be pretty nice. They were conversing with the customers and they even asked me how the food was when I was about to leave. The place was packed during lunch time and it looked like everyone in the store was enjoying their food. I ordered a hamburger meal and for some off reason it just tasted so much better than anything I could have gotten at any other chain.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 365, "review": "Greasier than a mofugger...\n\nI've been to quite a few Hawaiian eateries to be able to judge what good Hawaiian food is and what isn't. My co-worker and I decided to eat here one day for lunch because we know that Hawaiian food is usually packed with protein.\n\nWhen we got there, it seemed like your average Hawaiian fast food place. We were looking at watch people were ordering and noticed that they were giving huge portions of food for their price. So I proceeded to order the salmon and short ribs. After we got our meals, we sat down and opened our boxes, and it was filled with oil. You could literally pour our a small cup of oil. I know that Hawaiian food is usually a bit on the greasy side, but this was ridiculous. Before even being able to eat the meat I had to use a gang of napkins to dab off all the oil. I was only able to eat half of the rice because it was just swimming in oil. The only thing that made it worth while was the macaroni salad. Thats what the second star is for.\n\nBeing a protein fiend and meat lover, I finished my food like a soldier. I seriously thought I was going to get a heart attack from that meal. I wouldn't go here again, unless I'd like to take a couple of years off my life...", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 366, "review": "Great place (friendly staff, good food, clean bathrooms, lots of parking).  Highlight: Dole pineapple sherbert!  Low: nickel and dime on extras (e.g., bowls, sauces)", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 367, "review": "I am quite surprised by the amount of bad reviews. Granted, when we go I almost always get the same thing: the katsu curry--so I may be a bit of a neophyte when it comes to Hawaiian food. Service is quick and friendly. Portions are HUGE, even the mini! The macaroni salad won me over at the Alameda location years ago... I hated the stuff before trying L&L's. Now, it is the first thing I eat. \n\nFor fast, cheap filling food, little beats this place.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 368, "review": "My rice was hard!  It wasn't cooked through, big no-no.  Otherwise, food wasn't bad.  Got the seafood combo which is fried shrimp, mahi-mahi and your choice of one bbq meat, I got the short ribs which were yummy.  But the wait at lunch is pretty bad, they need to figure out how to work out the lunch rush.\r\n\r\nUPDATE:  Went back yesterday and got the mini chicken katsu.  The mini is a ton of food and it still comes with macaroni salad and this time the rice was cooked through.  L&L isn't bad for a lunch place.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 369, "review": "It's your basic L&L, but I do love it.  I almost always get the spicy bbq beef lunch combo, which comes in a cheaper mini size if you're not feeling super hungry.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 370, "review": "OK, the 4 stars are for the food. I love the fact that for under $9 you can get enough food so that you're STUFFED. All the L&L spots I've been to have really good macaroni salad. And I tried the gravy fries for the first time. Simple but AWESOME.\n\nThe service was so so though. The girl behind the counter, heavy set, maybe hispanic or mixed aisian, was rude and pushy. There was nobody in line behind me when I got there, and she was rushing me to make my order. I ended up messing up my wifes order. Luckily she didn't notice or seem to care. But still, show some better customer service. Don't act impatient, especially when there's no line. I took my order to go, so I really can't comment on the condition of the actual restaurant. It looked ok though, not dirty. I'll go back for to go orders, but I hope the owners actually read these sometimes, and retrain that girl.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 371, "review": "this place was awesome!  portions were bigger than expected!  i decided to try something other than my usual chicken katsu.  i wanted to try the spicy chicken.  unfortunately, it wasn't spicy enough for me.  in fact, it wasn't spicy at all!  it's ok.  sriacha fixed it!  \n\nservice was EXCELLENT!  dude at the counter was really helpful and friendly.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 372, "review": "Typical Hawaiian food in typical Hawaiian portions - big.  They do have smaller sizes (mini) and low carb options.  The place is small, but does well during the lunch hours.  They are constantly revising their menu to include more variety as is evident from posted print-outs hanging below the standard menu.\n\nThe writing on the menu above is rather small, but they seem to be aware of it as I have always been offered a menu to look at while I wait to be helped.  \n\nI was surprised by the good natured attitude of one particular cashier during the lunch hour rush.  She, while appearing somewhat spent, gave me a genuine smile and listened intently to my order....exactly what I would have expected if I were in Hawai'i.  \n\nHer name was Yuki.  Kudos to her.  She's definitely an asset to the L & L at that location.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 373, "review": "So, I was reading other Yelper's reviews on this place and almost wasn't going to try their food. Until one day, I smelled this sweet, smoky, gooooooooooood BBQ food from 2 cubicles down in my office. I immediately popped my head out of my cube and asked \"What's THAT? Please, P-L-E-A-S-E tell me where you got that from???\" - came to found out my coworker was eating L&L Hawaiian BBQ.\n\nI went there around 1pm, just around the lunch time and this place was packed! I was overwhelmed by the \"special menus\" hanging under the \"regular\" menus in different colored papers, and there was another white board filled with today's \"other\" specials on the counter. But I got my focus back and ordered what I was there for, the BBQ Beef. My co-worker ordered garden salad with BBQ chicken.  We ordered, paid, waited for about 5-7 minutes and jet out of there....mission accomplished!\n\nTaste of the food.... yes it might not be the most sophisticated and sensitive food on earth but that is not what Hawaiian food is all about. I think Hawaiian food is more about homey food, simply prepared with simple ingredients but large quantity that will fill you up without spending a lot of money. I used to live in Hawaii so I ate a lot of \"local\" food, and this place serves pretty authentic homey Hawaiian food from my point of view.\n\nMy BBQ beef (mini size - $5) was pretty yummy and there was nothing \"mini\" about that. Came with a big scoop of white rice and macaroni salad in a cup. Salad looked very fresh and the quantity was huge. I'd like to come back to try their Tonkatsu, Spam musubi, Poke etc... this is a better fast food than french fries :)", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 374, "review": "I stopped in after a marathon shop-a-thon at Target.\n\nFood was good, didn't seem that healthy (but I hear there's a low carb menu), I had teriyaki chicken nothing great but it hit the spot.\n\nIt is good for take out.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 375, "review": "It's in the gigantic shopping center near where I live so I just go here when I'm in the mood for Hawaiian BBQ. \n\nThey have a low carb menu!! Gotta love that. They also take atm/credit card.\n\nThere is soo much food! If you don't get the low-carb version then it comes with TWO scoops of white rice (who eats this much rice?! shivers..) and a scoop of macaroni salad. Depending on which combo you choose, you get your choice of fried shrimp, bbq chicken, short ribs, and regular meat. They also have tons of sides including kim chee! The best part is the fried egg because eggs are yummmmy. haha.\n\nHowever, the regular meat is a bit salty for me. The short ribs don't have much meat but what do you expect. The chicken is great due to default. I didn't like the pulled pork and butterfish combo as much.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 376, "review": "What the hell is wrong w you Mimi T? LOL (I know her, I can say that)\nFirst off, Hawaiian bbq is not that bad, minus the fact that...I am not sure whats so Hawaiian about it. It's more...Japanese to me than anything.\nSecondly, WTF the KOREAN short ribs has always been good! Umm the BBQ COMBO!!! I recently got hooked on their Chicken Katsu..I havent tried the SPAM yet...just because um if I want SPAM I just ummm go buy it....in a can...oh well, the only thing Hawaiian at this place is the poi they sell haha. Anyway I like the Milpitas Location also, and this place is good damnit!", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 377, "review": "Very unpleasant visit. We went there for an early dinner and to begin the girl taking orders was very rude and had a real bad attitude (no customer service skills at all) she was rushing us to pick what we wanted to order.  After we did, we asked for 3 cups of water and she gave us a face. I ordered the chicken katsu, when I got my order it was very greasy and not at all crispy, it looked like it had been cooked before and re-heated in the oil again.  I ordered brown rice and got white rice and when I went back to tell her about it, again I got her annoyed face.  After that my husband went to ask for some slices of lemon for the water and was told very rudely that they don't give any lemons for the water, my husband said then give me a lemon for my fish and she went into this rant saying she will only give him one slice of lemon for his food.  After that the owner came out and he asked her why the cashier had such a bad attitude all he wanted was a lemon slice, she then proceeded to tell him this b.s. story about how they cut lemons for food with a special cutting board and a special knife and they use a different cutting board and knife for lemons for water. Anyway, by this time we were both annoyed.  We will not be eating at this place again, and I'll make sure no one I know will eat there either. Bad food and horrible service!!!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 378, "review": "used to be 5 star before they stopped serving mahi mahi . now its going down hill fast .", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 379, "review": "I love this place!  I come here all the time.  The manager is awesome.  He always provides good service and is incredibly friendly.  My roommate always gets curry so whenever we come in, he makes sure there's still curry.  He makes it himself, which is very cool.  They have a new soft serve and he went to the tables and gave out free samples.  He always makes sure we're happy with our meal.  \n\nThe cashiers are always nice and recognize us when we come in too.  They often let us order by name instead of just giving us the receipt number.\n\nThe food is really good.  The portions are really reasonable for the price.  They always have specials too, aside from the variety already on the menu.  I have eaten just about everything there and haven't yet been disappointed.  Great place to eat.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 380, "review": "(10/30/2007, update review, 1.5-stars)\n\nHmmmm.  Today's ahi poke was notably unseasoned.  not UNDERseasoned.  UN seasoned.  And it was somwhat opaque and dry.  Definitely not fresh (...they do have fresh sashimi-grade ahi poke on Thursdays and Fridays, in my experience).\n\nTumbling closer and closer to a 1-star review...\n\n===============================\n(10/22/2007, original review, 2-stars)\nSeriously, all L&L's are not the same...\n\nThis one in particular, IMHO, is not as good as the Aborn/CapEx store in East San Jose, or the 237/880 store in Milpitas.\n\nThe Q here is just greasy.  The katsu is fried all the way to a crunch.  And the pork-n-cabbage might as well have been hot-wet-shredded-paper...  And really?  Charging up to a $1 more than the other franchises because they use transparent plastic containers instead of the typical styrofoam?  C'mon...\n\nThe saving grace?  Ahi Poke.  (Although, I'll change this to a 1-star review if I get it and its over-salted like it was last time...)", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 381, "review": "I am a pretty big guy (185 lbs) and the mini size fills me up \nthe regular size should be considered a dinner for 2\nhahaha\n\nthe food here is typical of a chain fast food place\ni always order chicken katsu with all rice\n\nsave your self the money and just order mini unless you like to eat left overs the next day\n\neveryone here is pretty friendly and this place is usually sqweaky clean\nplenty of parking\nif you in the area its a good place to eat \nbut i wouldn't drive across town to eat here", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 382, "review": "Most L&L's can be hit or miss but this is one of the good ones. I'm a fan of the Dole whip and chicken katsu plates. They cook the food when you order it and I can never wait. So I always burn myself out of greed and hunger. Friendly staff, not too greasy and huge portions for not a lot of $.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 383, "review": "It's fairly close to my office, and while not the best local food, it is a hell of a lot better than some I've had. (see other reviews). Also, I LOVE being able to run out for lunch and grab some kalua. If they were open earlier, I'd swing by on my way into the office for a portagee sausage/eggs/rice breakfast.\n\nI've got no problems with the staff. They aren't bubbly, but they are polite. \n\nThe food might not taste the same as it does in Hawaii, but I'm pretty sure the best cappuccino in town isn't as good as you can get in Italy.\n\nIf in doubt, Chance 'um!", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 384, "review": "I absolutely love this place, they give you a lot of food for your money and it tast great. All the comforts of a Hawaiian Lua it is all here. BBQ Pork , macaroni, breaded shrimp and chicken, curry beef, teriyake meat and rice. The flavor is good you will get filled up on some good healthy eating, for fast food dining out. Better here than McD or the King or even Jack. And if you like flan they have one that is to die for. The staff here is friendly and you get your food quickly you can even pre-order online. If you have been to Hawaii here is a piece of it here in Cali at L&L Hawaiian BBQ.\nEnjoy", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 385, "review": "How well do you know your  (fast food) Hawaiin BBQ places? I have tried one too many, and not any where near enough!\nI'd take JJ's over L&L, going by my first impression; the sauces and meat may be just a little better.\nI had the BBQ chicken which wasn't bad, but it did have a bit of an aftertaste... my sweetie thought it was either a bit soapy or chemically, but it could have just been smokey (as it is a jerked flavor). \nThe Kalua Pork was good, but something was missing. I can't quite place it (and no, I don't mean the cabbage). The most obvious difference between here and JJ's is that the Kalua pork here is just a mound of pork, and at JJ's, it is mixed with some cabbage. I like that.\nThe macaroniu salad was alright...\nThe amounts are the usual for Hawaiin BBQ.\nI'll probably be back at some point.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 386, "review": "My bf likes coming here so I came along for lunch. Had the chicken katsu mini, the portions were huge!!! He had the Hawaiian BBQ mix. Everything was tasty and not as bad as i remembered. I guess this place isn't so bad for your Hawaiian cravings, but there are other places that make it just a little better than here. It's better to call in and order if you don't want to wait for your order during lunch hours.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 387, "review": "I have to agree with Beck B. here - I got a major stomach virus or something horrible after eating there mini \"low carb\" BBQ chicken plate w/ egg. It lasted a complete week - A WEEK!!! I had to skip work and live by the toilet - 'nuff said. I haven't been able to walk past this place without my stomach rumbling in fear. Oh gosh, the smell.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 388, "review": "This L&L is fantastic!  I patronize them regularly and have never been disappointed so far.  Clean and welcoming environment within a nice mall, friendly service, and (most importantly) very generous and tasty food portions! Compared to the other L&L outlets I've been to, this one ranks highest by far.  Two thumbs up!", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 389, "review": "I live near this location and have been eating here randomly since it opened. I don't like how the cooks always seem to be laughing or joking around...i can't tell if its something they are doing with the food or what. The only thing good about this L and L is the location. One time I got take out and one of my chicken katsu was raw under the breaded part. Another time my moms macaroni salad smelled like really really sour. And also, whats up with stacking all the chairs up on the tables when you are still open for business...you should wait until the store is closed to do that...", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 390, "review": "Maybe I just don't' like the concept here but cheap chicken with lots of skin and little chicken, rice and macaroni salad. That is just a nasty combination. I asked for more rice and no macaroni but that was a bad move, the rice was dry and tasteless. The chicken would have had good flavor had there been any chicken, instead I got tons of skin. I won't be coming back, crappy food and combos I am just not into.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 391, "review": "I always order the chicken BBQ to pretend that I am actually ordering something good for me, but the salt content on that is enough to swell me up for 3 days!!! And still, I keep going back. Just another comfort food...Did notice that the staff turns over pretty fast though... but what can you expect from a chain?", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 392, "review": "As part of my recent San Jose excursion, I wandered into L & L after a shopping , um, spree at Target. Happy to report that the rice does not seem to be hard any more, and the mac salad is nice and mayonnaise-y just like it's supposed to be (Hawaiian style!). But for me the true test was the SPAM Musubi (yes, for those of you in shock at the moment, I like SPAM!). Perfectly cooked, with just the right amount of rice, and deftly wrapped in nori that didn't fall apart. An all around satisfying lunch!", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 393, "review": "Place just opened up at the San Jose Market Center.  Ordered a plate lunch with the Hawaiian BBQ mix with beef ribs, chicken, and short ribs with the usual scoops of rice and macaroni.  Love the short ribs even though they are fatty and grissly.  Good flavor.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 394, "review": "Little did I kno the place gives HUGE portions.. Just the way I like it! I ordered the short ribs and chicken katsu. The short ribs are ok (Hukilau's way better) Chicken Katsu average... macaroni was good. Only reason why its getting 3 stars is average food, hella portions and the service was fast. Good place to hit up if your craving for some hawaiian food and want something quick/", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 395, "review": "The one star is for the good location.\n\nThe first week they opened everything was good. Not great. After a few weeks it seemed they sold the business to people who don't give a crap about the food and piss on everything.\n\nThere are handwritten menu items all over the place b/c they had to keep on adding items. For god's sake, perfect your regular items before adding more. Service was tacky and horrible, not to mention cheap. \n\nThey started to skimp out on the mac salad too.\n\nThis is the worst L&L if not the worst Hawaiian take out in the world!", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 396, "review": "I don't eat Hawaiian  bbq much so I don't know know how authentic their food are.  I do know their portions are huge so that's a nice for big eaters.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 397, "review": "Not my favorite Hawaiian joint but not the worse I have had. There was a time when there were not a lot of options for Hawaiian fast food but now places are popping up everywhere. My local friends don't mind it here and neither do I. Prices are not bad either. Oh yeah the friggin writing on the menu above the counter is tiny and my hapa asian ass eyes don't need to get any squintier!!!!", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 398, "review": "I love me some L&L, but I gotta say I was pretty disappointed w/this particular one.  I'm a huge fan of chicken katsu and was saddened by the fact that my serving of katsu here was poor.  The pieces were so thin, I almost felt like I was just eating the breaded part of the chicken.  Don't come here for the chicken katsu.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 399, "review": "The food is alright, but for some reason the L&L BBQ off of Campbell Ave taste a lot better and the portions are bigger.  I do like the BBQ chix and the spam musubi.  The low carb menu is a nice surprise, since when I think of Hawaiian BBQ, I think of lots of foods and fried foods.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 400, "review": "This place is really close to my work so we eat here a lot. The portions are huge and you always have enough left over for another meal. The BBQ Beef, Ribs and Chicken are all great.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 401, "review": "I have been used to the L&L in San Diego and those were consistently good barbecue, but this place really f's up the name. I was dissapointed with the short ribs being hard and very tasteless. I always order the macaroni salad but this place makes me not want to eat it again. I think they should really change out their cooks and the way they marinate their meats,", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 402, "review": "I love L&L Barbeque just because you get so much food for the price.  I always get the barbeque chicken.  It comes with rice and macaroni salad.  Again, it's a lot of food for the price...around $4.  The people who work there aren't really into customer service but it doesn't matter since I take my order home anyway.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 403, "review": "Usual large Hawaiian portions. Usual nasty macaroni salad. My friends and ordered a variety of food. The teriyaki chicken was okay. We were all equally disappointed with the chicken katsu sauce. It tasty like some cheap watered-down ketchup and BBQ sauce mix. Definitely not a satisfying dip for the chicken. I prefer J&J's Hawaiian BBQ.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 404, "review": "I am not too impressed with this place.  Their chicken is pretty good.  Their bbq beef was not good when I had it.  It was burnt, and hardly any meat!  Just a lot of fat...  I ordered their Ahi Poke which I would not order again.  When you order raw fish, you expect it to be fresh...otherwise you are taking a risk of eating it.  Their poke did not seem fresh.  I ate it, and didn't get sick.. but I was scared for a second there.  This place is near my work so I will probably go back.. but I won't order any more beef or poke.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 405, "review": "I had lunch with a co-worker there---the seafood special was tasty: breaded shrimp and mahi-mahi with pork kalua and rice. The shrimp and fish were fresh, and the pork was extremely tasty without being greasy. The portions are huge--had enough for two meals, really. I'll visit again soon!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 406, "review": "If you're looking for hardy tasty food and lots of it, something you might consumer after a long day of surfing or other strenuous activity, then this is your place.  My combo mix plate was basically, rice, piles of bbq beef, ribs, chicken, and mac salad.   It must be like 2000 calories.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 407, "review": "New locations are difficult to review. L&L is the Mr Chow's of hawaiian food. \n\nIf you need food quick and is ok, give this a shot. If you have more time, drive about 5 mins away to Hukilau for the best Hawaiian.", "name": "L&L Hawaiian Barbecue", "rating": 2}, {"index": 408, "review": "Fab-u-lous! The only reason this place is a 4 instead of a 5 is I've only been there once so I haven't tried much from the menu. What I did have (the #1 combo) was great. I'm actually excited that I couldn't eat it all so I'm taking the rest of it for lunch tomorrow.  The service was friendly, the atmosphere tropical and the smells heavenly. I am sure I'll be revisiting this establishment until I've tried quite a few other itmes from the menu.  I looked at their website and there will be new locations all over the place so find one near you and try it!", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 409, "review": "this PARTICULAR L&L's sucks balls.  i don't think they are hawaiian-owned.  they don't know how to cook anything here!  it's gross.  go to the campbell one, it is sooooo much better.  plus they play all the good kccn music like 3 plus and pati.  the best things to get are the mini lau lau, or the healthy shrimp meal.  also the poke isn't bad when they have it.  \n\nbut really if you want good hawaiian bbq, you gotta go to hawaii.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 410, "review": "Never been to one of these and don't often crave Hawaiian, but as far as fast food joints go, this one hit the spot.  Obviously do not come here if you're on a diet.  I came here for a mid-afternoon snack and got way more than I bargained for.  Extra points because they served a fresh, authentic ahi poke for a fraction of the price anywhere else (Hukilau, I'm looking at you) and servings of macaroni salad for 99 cents -- sometimes I crave the gooey, guilty delight that is mayo-laden mac salad, and I'm glad they have it in small, individual portions for juuust under a buck.  My boyfriend got the mini portion of chicken katsu and we still had leftovers.  Sauce was great, not too salty or flavorful, and the chicken was not greasy or tough.  Also had a smoothie, which was surprisingly good; I often find non-Jamba Juice store-bought smoothies watery or too icy, but this was fruity and tasty.  Can't remember which one I got, though.  Manager was friendly and we chatted with him for a few minutes.", "name": "L&L Hawaiian Barbecue", "rating": 4}, {"index": 411, "review": "This is my first time in L&L.  I got the chicken bbq with brown rice and salad.  As soon as I picked up my food at the counter, I couldn't wait to eat it because of the good smell of bbq.  Really good, big serving.  2 scoops of rice.  Not bad at all.  Planning to take my family next time.", "name": "L&L Hawaiian Barbecue", "rating": 5}, {"index": 412, "review": "I ate there a couple of times, and even though the counter service is awful, it's near my office, and the short ribs and loco moco were ok. However, the last time I ate there (and it is the last time) the macaroni salad was seriously off. Based on some of the other reviews, it seems like the Dept. of Health should shut this place down.", "name": "L&L Hawaiian Barbecue", "rating": 1}, {"index": 413, "review": "Pretty good. That's as excited as I'm going to get for this place.  The new strip mall is really near my house and this place always got my attention. The words \"Hawaiian\" and \"BBQ\"... how can you resist? My wife and I finally checked it out yesterday. I thought the chicken bbq was pretty good. Tender and flavorful. They got the white rice right and that's a big bonus in itself. It was topped with a healthy portion of spam! Yes, spam. And yes, I ate it. However I'd recommend they cook it like my old nanny did back in Manila. Dip it in egg, slice the spam thinly, and then fry it... Okay, back to my review... the egg rolls were good. My wife ordered the Katsu with curry. She ate about half of it and was disappointed. I thought, how could you get katsu and curry wrong? Well, I tried it, and they managed to get it wrong. It was very bland. I think the curry could have used more seasoning. The chicken definitely tasted like it came from the freezer. Overall, I thought it was  a pretty good experience and I'll probably come back again and just avoid the katsu. The place was very clean and had a friendly staff. I've read references to McDonald's in the reviews below regarding this place, but I'd have to give them way more credit than that. They're not even in the same category.", "name": "L&L Hawaiian Barbecue", "rating": 3}, {"index": 414, "review": "Nice friendly staff. Food is delicious and the place is pretty clean. They give you big portion for your money. I never saw a bathroom there as Farm S. stated.", "name": "L&L Hawaiian Barbecue", "rating": 4}]