[{"index": 1721, "review": "Took my son to Bill's Cafe this morning. I have been wanting to try Bill's for some time. At 9:45 we were seated as soon as we walked in and had no trouble finding parking as the other reviewers noted. Yep, it is crowded and loud but no different then any other popular breakfast spot in the bay area. We decided on a sugar high and opted for pancakes. My son had the chocolate chip pancakes and hot chocolate, and I had the regular buttermilk with a side of bacon. Everything was hot and tasty and served very quick. There's quite a selection of different types of pancakes ranging anywhere from \"Almond Joy\" to \"Hawaiian\" but I thought the standard buttermilk was a good starting point. Nothing over the top outstanding but very good nonetheless. Service was excellent, waitress checked back several times to make sure everything was o.k. and when paying the check at the register the gentleman asked if everything was good,.  They actually do care about what they are serving. They have a huge menu with a large variety of omelet selections and different varieties of French toast made with everything from croissants to cinnamon rolls.  I will be back to explore their egg Benedict selection (the smoked salmon and capers in particular) another day!", "name": "Bill's Café", "rating": 3}, {"index": 1722, "review": "OVERRATED. They sat us down in the covered patio area, and it smelled like pond scum. I suppose I could look past that, but the food was overpriced, and it was terrible. The pancakes were dry. The wheat toast was burned. Biscuits and gravy tasted like Playdoh. What a complete waste of money!", "name": "Bill's Café", "rating": 1}, {"index": 1723, "review": "this place is pretty good, never heard of it.. but a friend told me that all his friends were raving about it all the time and so we tried it out. its actually not that bad, very similar to stacks. i wouldnt say its the GREATEST out there, but it definitely has legit breakfast.  Good service all around also, very attentive and friendly waiters.  If youre around the area and are hungover or starving, this place is a good decent priced place to go and get your good ol' breakfast fix in the sj area.  this shits on denny's and ihop and makes them look like any old crappy chain restaurant.", "name": "Bill's Café", "rating": 4}, {"index": 1724, "review": "Pretty good brunch spot which translates to a forty-five minute wait for tables at brunch hour peak.  Saw the reviews for all the more popular options though went with the omelette.  Good eats.", "name": "Bill's Café", "rating": 4}, {"index": 1725, "review": "We've been looking for a good place to hit up for Sunday brunch. Bill's Cafe is great! I was a little annoyed that someone else took our spot and was seated before us! The manager apologized to us and seated us right away. I ordered the crab cakes benedict and hubby ordered the meat lover's omelette. I was eyeing the Hawaiian pancakes and the oreo cookie pancakes! But, didn't end up ordering it. I figured it's another reason for us to go there again. Food was yummy! Loved the crab cakes! Hubby's omelette was packed with meat. Service was great. Everyone was friendly. I'll be back!", "name": "Bill's Café", "rating": 4}, {"index": 1726, "review": "I am giving Bill's 4 stars and not 5 because my skillet was served cold once. However, the manager was quick to noticing the issue and had it fixed immediately.  That's why i continue to be a regular here for brunch. The food is yumy & the service is fast. Make sure you are hungry because the portions are huge. My favorite item on the menu is Bill's Original Skillet.", "name": "Bill's Café", "rating": 4}, {"index": 1727, "review": "This place is such a treasure.  Not only is the food great but the staff is outstanding.  Every single time I have been there I am blown away at how sincere and helpful each staff members is.  The service is unbelievable and it seems like everyone loves working there!  I even see the manager helping every one out on busy weekends, and offering people coffee etc.....  One particular waitress we had was absolutely incredible.  Her name was Suzie and she took such great care of us that we were all in a great mood after our brunch.  It was like scene out of a movie where the waitress is so sweet and actually cares about her customers:)  She took extra special care of me b/c I am pregnant and she made sure I had everything prepared exactly how I wanted it.  This restaurant, the customers, and the manager/owner is beyond lucky to have Suzie as an employee.  We are definitely going  to make this place a traditional weekend brunch place for our new family!!!  I wouldn't change a thing about this place - it's a rare find:)", "name": "Bill's Café", "rating": 5}, {"index": 1728, "review": "I was definitely in a mood to do damage to some tasty brunch food when I met some friends at Bill's today.  It was fairly busy but not packed, so I didn't have to wait.  The selection had a lot to choose from and I  drifted from the Jalisco scramble, to Parisian French Toast, and ended up on the Banana Bread Pudding French Toast.   The service was just OK, but that particular item made me a fan on its own.  What was happening in my mouth as I tasted it wasn't chewing, it was deeper than that, more intimate almost.  Yes, it was that good, and I'll be back for more.", "name": "Bill's Café", "rating": 4}, {"index": 1729, "review": "2.5 stars.  i had high expectations of bill's, but i was disappointed.  i had the \"chicken fried steak\" which i mistakenly thought would be chicken, but was country fried steak that did not even taste good.  the scrambled eggs had some cheese mixed with it, which was interesting.  the country potatoes had some mexican/fajita flavor which i didn't like.  the mimosa was interesting..not worth 5.95.  id definitely prefer southern kitchen to bills.", "name": "Bill's Café", "rating": 2}, {"index": 1730, "review": "Came here for a bridal brunch with a party of 15. They were able to hold a table for us in the patio which was perfect. This place had a mom n' pop feel.... and tasted like it too. Their french toast WAS SOOOO GOOD. I'm coming back. drool.", "name": "Bill's Café", "rating": 5}, {"index": 1731, "review": "I've had this on my \"to try\" list for sometime. My friend Lisa M raved about it so I knew it was a place I had to go to. A few weeks back I brought a bunch of friends here after a long night of drinking from a great wedding.  The first thing I notice is the free coffee and the display of beer they have for sale.  When we sit down for breakfast and finally get our meals, I smiled at how much food came our way.  I had the Parisienne French Toast and I expected something to look like a crossaint, but I got something so much more yummy. Plus I still had another plate of just side dishes.  Needless to say everyone's food was great and my friend who order a bloody mary barely good finish it due to the amount of alcohol in the glass. The bloody mary was actually almost pink. It was like a 50/50 mix.   If you are trying to watch your caloric intake, there are healthy meals too, but where is the fun in that?", "name": "Bill's Café", "rating": 5}, {"index": 1732, "review": "Bill's Cafe just opened this new restaurant on the Alameda, taking over the building that Cozy Diner once occupied.  We're regulars at the Bill's Diner in the Rose Garden, so when this new location popped up we were anxious to compare it with the other Bill's location.  We dropped in for breakfast the first weekend it was open.  Word on this new location opening up must have spread quickly, because the restaurant was full when we arrived at 9am on a Saturday morning.  For those that had frequented Cozy's Diner before, the decor has not changed.  For those that have frequented Bill's other locations, the menu has not changed.  The food?  Good.  A few things need ironing out, which is normal for a new staff.  When we arrived the busboy rushed to clean the table, and didn't do a very good job - we had to wipe off the seats and push aside some small trash left on the table.  The 1/2 & 1/2 hadn't been re-stocked, so we had to ask for more.  Bill's was serving free mimosas to celebrate the grand opening, and they were pretty good, except someone in the back forgot to wash off the orange that they sliced for garnish on the mimosas - it still had dirt on the outside of the rind.  Other than that, the food was OK - pretty comparable to the Bill's in the Rose Garden.  Apart for the fact that the  avocado on my veggie skillet was a bit brown, the rest of the dish was tasty.  My husband's muffin in the Egg's Benedict needed more toasting, but they have that problem in the Rose Garden restaurant as well (I don't know why they don't take the time to put a decent \"toast\" on the toasted muffin).  The waitress, although new, was doing her best to memorize the menu, and she was quite pleasant and polite.  The kitchen messed up my order but the waitress caught it before it came out, so my food came out a bit later than my husband's, but it came out correct, which I appreciated.  All in all, the new Bill's has a few kinks to work out, but what new restaurant doesn't?  We'll definitely be back, and give it another go.  I'm sure it will improve over time.", "name": "Bill's Café", "rating": 3}, {"index": 1733, "review": "Great breakfast place, delicious omelets!!! I'm also a huge fan of their mimosas. Usually good service and a friendly environment.", "name": "Bill's Café", "rating": 4}]