[{"index": 542, "review": "Clearly this is a new place because they haven't gotten the timing down yet. Good wholesome food but I waited 15 minutes for a bagel, and then they forgot the chai latte. I came in here thinking it would take 10 and it ended up taking 25 and I was late. Again good food but it seemed like everyone was all over the place the entire time. Will try again in  a few months to see if they've gotten any better", "name": "Crepes Bistro", "rating": 3}, {"index": 543, "review": "True to it's name my savory avacado crepe and sweet strawberry crepe were super delicious!!!", "name": "Crepes Bistro", "rating": 4}, {"index": 544, "review": "I actually love the food, so fresh and healthy, but they need to find a way to be more efficient and provide faster service!  Do not come here at lunchtime, do not come here if you don't have 30 minutes to wait for a single crepe order.  Still waiting...", "name": "Crepes Bistro", "rating": 2}, {"index": 545, "review": "These crapes ate amazing. Everything is super fresh and flavorful. Even the orange justice tasted freshly squeezed. You have to give this place a try!", "name": "Crepes Bistro", "rating": 5}, {"index": 546, "review": "I had a spicy arugula crepe and a sweet crepe. Arugula crepe was really delicious.  One bite and my palette could feel all the flavors. The sweet crepe was ok, nothing great about it. I guess with nutella and strawberries, bananas there is nothing special you can do. The strawberry smoothie was freshly made. Unlike Jamba Juice, I did not feel like I was having shaved ice.", "name": "Crepes Bistro", "rating": 5}, {"index": 547, "review": "We got the savory special, strawberry and creme, and banana chocolate crepes. They were all superb. The savory special had to be my favorite, it was very fresh and flavorful. Serving portions are fairly big, our group of three got three crepes to split and we ended up having leftovers. Great service, they were very nice and friendly. I'm really excited to go back and try the smoothies and juices.", "name": "Crepes Bistro", "rating": 5}, {"index": 548, "review": "Awesome is the word. We tried the soups and multiple crepe - all were the best I had ever had. Delicious, healthy, great portions.", "name": "Crepes Bistro", "rating": 5}, {"index": 549, "review": "Very satisfying vegetarian food! The savory crepes are delicious with fresh ingredients and a nice balance of sauce. The plain sugar crepe was outstanding--with the right balance of sugar and cinnamon, and a nice crisp texture on the outside and soft inside. Also a welcoming place for kids with a friendly ambiance and beautiful wood interior. The coffee is good too, and we usually only go to Chromatic or B2. And the whole wheat bagels are really good bagels!", "name": "Crepes Bistro", "rating": 5}, {"index": 550, "review": "I've only tried one dish and I always get it to go, the special crêpe is delicious and big. Staff is friendly, I would give 5 stars if they weren't so slow, although I give them credit because it seems like everything's fresh and made from scratch. I also would love them to be open for dinner time, I work nearby and sometime's have a chance to stop by but I would love to bring my husband and have a nice dinner, maybe then try the sweet creêpes.", "name": "Crepes Bistro", "rating": 4}, {"index": 551, "review": "Excellent quality ingredients and soooo delicious. I'll be coming here often! The crepes were great. I had the avocado savory crepe and the strawberry& banana crepe. Incredibly fresh ingredients and beautiful!", "name": "Crepes Bistro", "rating": 5}, {"index": 552, "review": "I LOVE this place. I have tried a few of their soups and they are amazing (and I'm not a big soup fan usually!) Their crepes, smoothies and juices are delicious and nutritious! They have always been really friendly to me. Service is a bit slow, but I don't hold it against them--they make everything right there, so it does take time. If they would offer a kids' size crepe, they would be perfect! Yum.", "name": "Crepes Bistro", "rating": 5}, {"index": 553, "review": "Found my new favorite place close to home.  So yummy and so fresh... Will be back soon...", "name": "Crepes Bistro", "rating": 5}, {"index": 554, "review": "Just drove by based on the good reviews and could not find the place like its not exist.", "name": "Crepes Bistro", "rating": 1}, {"index": 555, "review": "Excellent place for crepes, soup and healthy deserts.  We ordered Special Crepe, Simple Pleasure Crepe, borscht, and gluten free muffin.  There Russian Tea cookies are fantastic.  The service is very pleasant and quick.  The owner, Nathan, is wonderful.", "name": "Crepes Bistro", "rating": 5}, {"index": 556, "review": "My first time here and absolutely will be returning.   I tried their Special Crepe and Abundance Smoothie and both items were quality made.    My beau had the delicious Apple/Cinnamon Crepe with honey drizzled on it, truly delicious.  This is definitely a top notch healthy bistro.   We will back soon.", "name": "Crepes Bistro", "rating": 5}, {"index": 557, "review": "Everything here is awesomely enviro/health/taste conscious.  Plus, there are a lot of options all around.  I highly recommend the borscht.  The little touches really count for me and this place has them.  This includes: whole wheat batter, traditional eastern european fare, lots of fresh veggies, vegan options, gluten-free (and delicious) baked goods, really good coffee, eco-friendly \"to-go\" boxes, and most importantly their food tastes great.  I had their Savory \"the works\", the borscht, a coffee, and I tried a bunch of their samples too which were all good.  No beer or wine (which would have been almost too nice of a touch but it's understandable). My only real complaint is this: there are so few true crepe places out there that if you call yourself a crepe place, I'm gonna be a snob and come expecting traditional crepes which these are not.  They are almost heavy salad wraps.  This is good and bad.  If you're a food fan you will appreciate them.  If you're a crepe snob, you will be a tad disappointed because they are more wraps than anything else.  If you can roll with the punches, you'll still like it though and I certainly did.  It was a lot of food however and I ended up taking about half home.  next time I'll go with the piroshki cause I tried a sample and I loved that.  Also, the borscht was killer. Either way, I'm comming back when I can and I will probably stick to some of the more traditional items on the menu which are all made very health-consciously. So I guess the name is a bit of a misnomer and they didn't have beer or wine but otherwise this place is a perfect gem.", "name": "Crepes Bistro", "rating": 5}]