[{"index": 221, "review": "Very friendly staff, and tea selections are pretty good. It's a little disappointing that they don't have Thai Tea or snacks. I mean, I guess we're too spoiled by  all the other competitions in the area, that this is a big minus for them. They are slow too, but because they're cute and nice, it's bearable sometimes. I've been here literally every day since they opened, and although they need to improve so much more, I'll still come to support.", "name": "Sharetea", "rating": 4}, {"index": 222, "review": "Nice place , nice service . They got everything from boba tea to interesting drink. I had a boba tea with ice cream . Come out pretty good. Check it out", "name": "Sharetea", "rating": 4}, {"index": 223, "review": "I love this boba place! I used to only be able to go to the one in Berkeley so I'm happy they opened a new one more close by. The strawberry lychee jelly smoothie is so good!", "name": "Sharetea", "rating": 5}, {"index": 224, "review": "Went to the soft opening, the atomsphere is filled with tea scent. The store is very clean and staffs are very friendly. Ordered the okinawa pearl milktea and mango green tea creama, it was so good. All their drinks are made fresh, must try the rest of the menu.", "name": "Sharetea", "rating": 5}, {"index": 225, "review": "I went at 8pm and outside the sign said open. And walked in and they said its closed for private event. Then why have sign saying open if you're not actually open for business?? 1 star for no service. Not coming here again as there are tons of boba places that are actually open.", "name": "Sharetea", "rating": 1}, {"index": 226, "review": "I love Sharetea. The boba here is cooked perfectly! Not too squishy, just a little firm in the center. I got the taro milk tea with boba. I've had some taro that was too chunky, but they blend it all here so it was DELICIOUS and I didn't have to chew anything. I'll be back here fo'sho.", "name": "Sharetea", "rating": 5}, {"index": 227, "review": "FINALLY! A bona fide boba place in Santa Clara! I go to Cupertino practically everyday to get my tea fix for jasmine or oolong milk tea. I like fresh milk tea that is brewed fresh on the premises, not pre-made or powdered teas. This place fits the bill. The drinks are a little on the sweeter side, but you can customize sweetness (which I'll do next time). I'm giving only 4 out 5 stars, because while they brew the teas fresh, they do so in larger batches, not individually when you order it.", "name": "Sharetea", "rating": 4}, {"index": 228, "review": "I go here once a week with my sister or my friends. And because this place is super close to the house, I recommend it to customer who hasn't had boba before. \n\nNormally when I come here, I get the Okinawa milk tea with pudding and less ice. My sister normally gets the green milk tea with big pearls. And I recently switched it up to the mango green milk tea. The employees here are patient and nice. They give the most honest opinions, if you ask them for there opinions on the drink. There drinks are really good and I would definitely recommend it to customers who are unfamiliar with these kind of drinks.", "name": "Sharetea", "rating": 5}, {"index": 229, "review": "i have visited a number of times now and will surely be returning many more! it opened not too long ago (i think?) and the employees are very kind and even remember what i order :o they are also open late which is a plus and have fivestar rewards which is excellent! i'll be back many times, thank you for the good bubble tea! btw wintermelon w fresh milk plus pearls is wowwow. and mango iced w ice cream and egg pudding even more wowoow. can't wait to be back!", "name": "Sharetea", "rating": 5}, {"index": 230, "review": "9:30pm closed!! BS !!We drive 30mins and arrived before store closed !!we will not come again !!!", "name": "Sharetea", "rating": 1}, {"index": 231, "review": "Nice place! Clean and friendly. Always a long line. Expect to wait for more than 15 mins. But it's worth to wait, tea is sooooooooooo fresh!", "name": "Sharetea", "rating": 5}, {"index": 232, "review": "Excellent customer service! Friendly and helpful! They give out samples too! Paid my first visit yesterday and had to come back again today for the best taro milk tea! So creamy! Definitely coming back!", "name": "Sharetea", "rating": 5}, {"index": 233, "review": "Everything taste great and fresh.  Great custumer service. I read some of the good reviews and they wrre true.", "name": "Sharetea", "rating": 5}, {"index": 234, "review": "Finally there is one near where I work!! I went to the soft opening during lunch time and got my favorite drink. KIWI ICE JELLY. so good. Hurry up and take advantage of the soft opening discount they are offering!!", "name": "Sharetea", "rating": 5}, {"index": 235, "review": "service slow, we ordered 5 drinks and the waiting time is 25mins which they already have 3 people to work, I got my hot tea but it all seep out, for the cup cover not tight enough.", "name": "Sharetea", "rating": 1}]