[{"index": 141, "review": "This new neighborhood gem has 24 rotating taps and the diverse spectrum of beer styles will keep any beer drinker satisfied. The menu is simple but tasty and has options for meat eaters and vegetarians alike. A cool layout with outdoor seating in the works. One of my new favorites!", "name": "Taplands", "rating": 5}, {"index": 142, "review": "cool place, brand nee, great local beer selection and a chill corner location with a clean and breezy atmosphere.", "name": "Taplands", "rating": 5}, {"index": 143, "review": "Went in here with my buddy a few weeks after it opened. We both enjoyed the conversation we had with the owner who was very personable. Great beer selection and great paninis. Definitely planning to go back soon!", "name": "Taplands", "rating": 5}, {"index": 144, "review": "Yay! A wonderful place to sample a variety of beers! Our arugula salad was fantastic, as well. So glad to have a place to stop when we visit my sister in law!", "name": "Taplands", "rating": 5}, {"index": 145, "review": "Great place, nice staff, good brews, I had the Johnny Mac Wry Red, which was light and nice!", "name": "Taplands", "rating": 5}, {"index": 146, "review": "First time at Taplands, large group that all love beer. Stood at bar waiting for service for a long time. Next round same. Watched the two bartenders talk for several minutes as we stood there. Decent beer selection. Cost more than most other places both in San Jose and mountain view. Not bothering to go again", "name": "Taplands", "rating": 1}, {"index": 147, "review": "Amazing selection, great atmosphere, and an extremely nice, polite, and knowledgeable owner.  It was a pleasure to talk to him, and I look forward to making this my new go-to spot.  If you like beer, you would be hard-pressed to find a better selection.", "name": "Taplands", "rating": 5}, {"index": 148, "review": "Great beer - a good selection of microbrews plus some excellent ones brewed in-house. I didn't get a chance to try the food. Nice clean, modern decor. I'm planning to go back regularly.", "name": "Taplands", "rating": 5}]