[{"index": 62, "review": "The name may have changed but the quality and customer service has not, it's still OUTSTANDING!! Great food and great atmosphere. I ordered the tuna sandwich with broccoli cheddar soup and macaroni salad. The sandwich was higher quality then you get at subway or any of the other places and the soup and macaroni salad top notch! I'll keep coming back time after time on my lunch breaks.", "name": "The Sub Hub", "rating": 5}, {"index": 63, "review": "My sub was dry, looked as if it was not toasted and no sauces to choose from. Overall a bad sandwich.", "name": "The Sub Hub", "rating": 2}, {"index": 64, "review": "Great sandwich shop. My favorite is the Golden Gate. They also will do anything here if you want it as a salad protein style wrapped in lettuce. I go here all the time and would definitely recommend!", "name": "The Sub Hub", "rating": 5}, {"index": 65, "review": "Love their tuna sandwich. Wish it was more of a melt as opposed to tuna salad in a sandwich, but still tasty. Staff are friendly", "name": "The Sub Hub", "rating": 4}, {"index": 66, "review": "Great sandwich shop! Was on my way by and thought I'd try it. Really happy I did, I'll be back! The sandwich I had was great. Really tasty and fresh ingredients. Friendly staff and reasonable prices.", "name": "The Sub Hub", "rating": 5}, {"index": 67, "review": "I gave this place a 5 star.  I ordered the \"unforgiven\" and it was unforgettable.  Delicious!  It was also a great value for your money.  I've order a large since I'm a big eater, but should have gotten a small instead.  I was full.  Recommend giving this place a try  supporting your small local business.  Btw the service was also excellent.  This place is much better than a Quiznos...that's my 2-cents.", "name": "The Sub Hub", "rating": 5}, {"index": 68, "review": "Accidentally stumbled on this great place! Went to find Quiznos but found this place and ended up trying  a sandwich probably was 49ers; it was good!!. Friendly people and clean place! Will definitely go next time!", "name": "The Sub Hub", "rating": 5}]