[{"index": 0, "review": "Sharetea Santa Clara is the best milk tea cafe I've had in the bay! The milk tea has real tea flavor without artificial taste, the toppings are always fresh, and the employees are really nice!\n\nI try to order once a few months for my company in Mountain View because I know they always make it fresh and delicious! Definitely must-try if you want a real milk tea experience!", "name": "Sharetea", "rating": 5}, {"index": 1, "review": "I'm not one to be very generous with my food, but after coming here I've learned to love to share tea. \n\nThis small cozy boba shop off of homestead is one of my favorite boba shops in the South Bay. Living in the Mecca of boba it is usually very difficult choosing a place to get your boba fix. If you're ever I the area I highly suggest you get Sharetea. Their milk teas are skillfully made and their toppings are fresh and delicious.  I recommend their classic milk tea with boba or if you're feeling a bit sleepy, the coffee creama!", "name": "Sharetea", "rating": 4}, {"index": 2, "review": "Boba is good texture, service is quick and the employees are friendly! \n\nGet it half or 1/4 sweet for best results, since (like most boba places) full sweet can get a little intense.\n\nI always get the black milk tea half sweet (really can't go wrong here)", "name": "Sharetea", "rating": 4}, {"index": 3, "review": "I have been here few times. Parking is always an issue cause I am not good at street parking.\n\nI like grab a milk tea after dinner. Thus, high mountain tea is always my best choice and it is always good. (There is no caffeine in rice tea but they don't offer unfortunately). \n\nSome people may love their HUGE portion toppings, but it always makes me feel I need more tea. Then, I started topping free version... I like it so far.", "name": "Sharetea", "rating": 5}, {"index": 4, "review": "The drinks at Sharetea have a real tea flavor to their milk tea. \n\nI ordered the QQ Happy Family Milk Tea. It comes with a lot of different toppings: boba, mini boba, pudding, red bean, and lychee jelly.  I am not a huge fan of red beans in my drinks and since I did not think the lychee jelly would mix well with the other additions, I asked to only get the boba and the pudding. The tea was strong but not too powerful.  I ordered the QQ happy family milk tea because I wanted to try as many add ins as I could without having to pay for each in my drink. Out of all the toppings, I preferred the mini boba.  \n\nOverall, the drinks are good here.  I prefer the fruit drinks more than the milk drinks and I still prefer the mini boba over the regular size boba. The service is nice and they get the drinks out fast.  Parking is not really an issue and they are consistent with their drinks.", "name": "Sharetea", "rating": 4}, {"index": 5, "review": "Located near SCU (in the subway complex next to the courthouse) \n\nService is fast and easy \nPrice is affordable \nNot the best boba in the bay, but pretty good for convenience purposes.", "name": "Sharetea", "rating": 4}, {"index": 6, "review": "Oh you bubble tea you.  Popping up everywhere. I prefer a cup of the ol' joe, however on a hot day a caffeinated ice tea is Hun P and hits the spot (never used Hun P before and am not sure if i used it appropriately). \n\nQuick and friendly servers. \n\nParking might be more difficult when classes are in session.", "name": "Sharetea", "rating": 3}, {"index": 7, "review": "Solid place for milk tea, fruit tea, and boba!! I rarely come to this location, only when I am around the neighborhood. When I am, I make it my aim to stop by here for a quick drink!! \n\nEnvironment:\nParking isn't usually too hard to find as I come on weekends and the curb parking is open to anyone at that point (weekend has no limitations). The interior is fairly clean and polished. They do play their music really loudly usually though. So, I do wish the music wasn't always blasting when I went. Maybe I should recommend them to turn it down sometime. It makes me not want to sit inside and enjoy my drink. \n\nDrinks:\nThey have a good balance of fruit and tea flavors; same goes for their milk. I like that their drinks taste very balanced. Their boba is also very fresh. Although I have gotten it before where it tasted semi-overcooked. So I think they could improve with the consistency of boba texture. I have tasted some boba balls that were hard and shriveled up before too. Anyways, I don't complain because I am a loyal customer. Some of my faves:\n\n-Passionfruit green tea (30% sugar): I love this drink because I'm all about refreshing drink and fruit drinks. I recommend this drink 100% if you're looking for a non-milk tea drink! The tea and fruit ratio is perf!\n\n-Okinawa Milk Tea (50% sugar): Super satisfying drink! The brown sugar tasted delicious and the milk always tastes really fresh!\n\n-Peace Green Tea: Another one of my go-to refreshing drinks! I love the flavor of the peach--its fragrant and so tasty. The green tea is always on point too.\n\nService:\nPretty efficient service. The staff are always quick with their hands. They have messed up the sugar level on my drinks before, but were kind enough to remake the entire drink. Super accommodating of them! \n\nLast Thoughts:\nLove Sharetea and I believe that this location is pretty great and trustworthy! Hit this place up if you're in the area. May be one of the best boba/places in the neighborhood!", "name": "Sharetea", "rating": 4}, {"index": 8, "review": "I've come here a few times since the opening, with that experience alone I would give it 4 stars. The drinks are good and have some really tasty flavors.\n\nHowever, the last time I came with my brother and partner, the drinks weren't so great. Specifically mine. I often get the cantaloupe milk tea, 30% sweet and no ice. This past time it seemed a little watered down/didn't taste like it usually does. I figured I just needed to stir it so I left without saying anything. After drinking it for 30 min or so leisurely while we ran errands I realized there was too much of the milk powder or cream and it really started to make my stomach turn/gave me nausea. Another 20 min goes by and I ended throwing it up. \n\nI hate to give them a really bad review, but it really was a bad experience. Also, we were one of the few customers in there so it wasn't like our drinks were made in a hurry. However, rather than give this place 2 stars,  I take some responsibility for not saying something when I thought it tasted off. My brother felt the same about his team having too much cream/milk.\nNot sure if I'll come back given my experience, but I do suggest trying out your drinks before leaving the shop.", "name": "Sharetea", "rating": 3}, {"index": 9, "review": "There are really no excellent boba places in the Santa Clara area and Sharetea definitely fills that void. It's pretty easy to miss but if you're familiar with the area, its right across the post office. Unsure if its OK (or not) but we generally go when its after hours post office time so we park in their parking lot and walk over. \n\nMy favorite is the Hokkaido and Okinawan milk teas with white boba (if you haven't tried it, its kind of fun and different from the regular boba; recommend that too!). They can't make it terrible less sweet (I think the most they can do is 50% from what I remember). Unfortunate because the drinks are good but still just a bit too sweet for my liking. \n\nThe Boy is always disappointed when we come here because he forgets they don't have popping boba (we generally favor the regular ol' milk tea with poppin' boba). Still great boba for the area and convenient since he lives so close. We stop by after eating dinner or lunch out.", "name": "Sharetea", "rating": 4}, {"index": 10, "review": "My hubby and I decide to stop by here for drink as we waiting for our pizza order. The line wasn't bad and moved fast during lunch rush. I got myself mango green tea ($3.75) under fruit tea menu. The drink was without ice, without sugar and free topping black pearl (Yelp check in). \n\nThe wait for drink maybe between 5-10 minutes. The mango drink wasn't bad, and I'm glad I ordered non sweet because I think the drink was sweet enough for me. It didn't feel like tasteless. There's plenty of parking which behind the shop if can't get the street parking in front of the shop.", "name": "Sharetea", "rating": 4}, {"index": 11, "review": "One of the best Sharetea locations in the area, and I've been to many.\n\nService is always really nice and I never have to wait too long for my drinks, which is something I can't say for every location. Very consistent when it comes to flavor and boba consistency. They also have assorted board games in the back if you plan on staying a while.", "name": "Sharetea", "rating": 5}, {"index": 12, "review": "Absolutely great milk tea. Whenever I first try out a new milk tea spot I always order the same thing. Milk tea with no sugar or boba. I feel that if they can get this right all is well, if they can not... well I usually don't return. \n\nThis place was spot on! The taste was delicious  and refreshing. The tea wasn't too strong nor over powered by the milk. It was a very good balance. \n\nThe location seemed to have a healthy amount of foot traffic on a day and time I thought there wouldn't be any.\n\nRegardless of the amount of people there, they were able to get me my tea promptly. \n\nNext time I'm in the neighborhood I will definitely drop by.", "name": "Sharetea", "rating": 5}, {"index": 13, "review": "Awesome spot for some iced tea on a hot day! Thanks to the bay area heat wave, I decided to give this place a try as I figured some tea would cool me off.\n\nParking at this location is super easy with convenient street parking and a lot in the back. The menu is expansive and service is very friendly. There are also a good amount of tables and it looks like it could be a good place to meet up with friends, study, read a book, etc.\n\nI ordered the kiwi tea with lychee jelly and it was delicious. Not too sweet and perfectly refreshing on a sweltering day. I've also tried the mango tea with is great as well. I don't think you can go wrong here! I will most definitely be back!", "name": "Sharetea", "rating": 5}, {"index": 14, "review": "Sharetea is your typical boba tea shop. Although I liked the Oreo milk tea I got here more than I did at the first place I ordered it, all other drinks I've ordered here have been mediocre. \n\nTake the pea tea, for example.\n\nA few months back, we were desperately driving to different Shareteas to be able to try the butterfly pea tea series, which was being phased out. We finally found seemingly the last location to have it, but the employees were running around like chickens with their heads cut off (and no, it wasn't busy at all, there were only two other customers and it was 9pm). Not helpful at all.\n\nFirst, yes I know it is a fad, but I reaaaaaaally wanted to get my tea in the cylindrical bottle that was advertised on their Instagram account. It's a bottle that would have had many other uses, but unfortunately they were out of them. The cashier suggested I get the lightbulb cup instead, and it was my first time, so I gave in. \n\nIt took them a good five minutes to find a lightbulb cup, when it was right under the counter. Okay, whatever, we aren't in a hurry. Five more minutes later and to our foodie horror, the drink comes out looking like dirty water. \n\nThe drinks are advertised to have gradients. Pink to purple, purple to blue, yellow to purple, etc, each with pea tea. The collection had something to do with astronomy in the name. They look delicious on Instagram, but the one they handed me looked absolutely disgusting. \n\nI could have told them right then that the reason it looked so bad, in part, was because they didn't know how to make the drink they'd been offering for weeks. You can't pour one liquid on top of the other too quickly, or it will mix. Pour on the side of the cup, slowly. But whatever, I wasn't going to tell them to remake the drink just because it didn't look exactly the way it was advertised. Although I should have.\n\nIt ended up being very weak in every way--none of the flavors were very distinguishable. I was so upset that I just dumped it out to keep the cup.\n\nSharetea employees, if you're reading this, please train yourselves and each other to make ALL drinks you offer. Why wouldn't you? It's ridiculous.", "name": "Sharetea", "rating": 3}, {"index": 15, "review": "Yummy boba worth driving out of your way to go to!\n\nI recommend all of their drinks with Creama! I had the Mango Green Tea with Creama + Boba and it was the perfect combo of sweet and refreshing. The boba was a good texture and they put more creama in their drinks then Gong Cha! The drinks are on the sweeter side so if you don't have a big sweet tooth I recommend doing 80% sweetness. \n\nStaff were very friendly and explained toppings and drink flavor combinations. The inside is small but has plenty of seating. You also get free boba pearls when you check in! I'm excited that they are opening a location at the Westfield ValleyFair just a few minutes away. \n\nParking is street only and can be difficult to find but other than that I loved Sharetea!", "name": "Sharetea", "rating": 5}, {"index": 16, "review": "I know the check-in offer from Yelp is very tempting, but don't do it. The pearls were terrible! Not only were they not fully cooked, they completely Clump together and formed a giant mess that I was unable to even try to eat. The tea itself was okay, but nothing will compare to Ten Ren. I almost thought this was a one-time situation, but my friend says the pearls are always pretty bad. He is usually okay going to Share Tea because he only orders the Oreo frappe, but you may as well just go somewhere else if you want what amounts to (essentially) an Oreo milkshake.\n\nThe parking situation is also pretty bad, as there is limited parking on the street. I believe there is a parking lot in the back, but we were lucky enough to find an open spot in the front.\n\nAdmittedly, it is a great place to hang out with friends as they also have board games. You see a lot of college students as it is right next to Santa Clara University.\n\nThe grass jelly might be alright as an alternative to the pearls, but I am not eager to return to this location. Until Ten Ren reopens, I will probably go to Happy Lemon or Gongcha.", "name": "Sharetea", "rating": 3}, {"index": 17, "review": "It is a small hidden gem in Santa Clara. Clean interior and cute design. \n\nOrder: \nMilk tea with all topping \n\nFirst question I usually ask is, \"What do you recommend?\" The guy at the front desk is very knowledgeable about their tea. He recommend too many items that it got somewhat confusing. So, I went with basic milk tea and give me all the topping! Regular sugar and regular ice with that! The milk tea wasn't super sweet which is a good thing. There was large pearls, small pearls, jelly, and pudding in it. Also, I request no red beans in my milk tea, and I am happy that they do exactly as you request. \n\nThis is my new go to spot for boba tea in Santa Clara!", "name": "Sharetea", "rating": 5}, {"index": 18, "review": "This used to be one of my favorite places for having tea but they have gotten bad with time. The taste of drinks changes everyday and its not consistent which is not something people like. People like me want consistency in drinks as we tend to order the same thing every time. \n\nDrinks are refreshing but not the best. It gets crowded as Day proceeds because it is located next to santa clara university with a lot of young people around the area.", "name": "Sharetea", "rating": 3}, {"index": 19, "review": "Good place near campus to grad bubble tea. They have an expanse variety of menu for fruit flavors to more sweeter ones like chocolate, latte, or matcha. Their 50% sweetener is a great balance to the bitterness of the tea and is much more suitable than other bubble tea places. Their service is also great, it can be a little slow at times, but it's to be expected with the crowds.", "name": "Sharetea", "rating": 4}, {"index": 20, "review": "I've had Sharetea in the past at many locations such as the one in San Francisco and have been pretty pleased with my drink. I usually go for the Taro milk tea with pearls whenever I'm craving a milk tea over a non-milk tea. However, I'm sad to say that this might be the last time I stop by this location. My Taro milk tea tasted terrible. It was really watered down and tasted like milky water or bad coffee. My brother's Okinawa milk tea was no better. If anything, it tasted even more like coffee. The pearls were hard and flavorless. I'm disappointed because I really wanted to like this place being that it's so close to my house.", "name": "Sharetea", "rating": 2}, {"index": 21, "review": "After a good freaking meal at Toppings Treehouse I knew I need some refreshments because 1) it's still so hot outside & 2) milk tea always sounds good to me before, during, and after a meal.\n\nFunny thing is that I went into the car thinking I had to drive a little bit farther to get to Sharetea, BUT then thanks to YELP having directions I was informed that to get milk tea would be way easier than driving. Why? The store is just a minute or even less walk from Toppings! Score!\n\nIt's not that of a place upon entering. There's some seating but that's it. It's mostly a get and go kind of ShareTea. Loved how the new menu looks design wise. Customer service wasn't bad either. Nice ladies, very precise in their workings, and helpful.\n\nBrother dearest got his favorite Oreo smoothie with extra Oreos. I got my usual Jasmine Milk Tea with boba, no fructose. Well, sort of. What I like about ShareTea is that they can substitute their fructose (clear-ish looking sugar) for brown sugar. So I did 30 percent brown sugar.\n\nThe Oreo could have been mixed a little better. I still got a bit more chunks of Oreo than wanted. Then again, my brother didn't mind.\n\nMaybe because they were close to closing is why their boba didn't taste all too great. It didn't taste good so, but it didn't taste fresh. I did like their milk tea though. The way it tasted was great. Hit the spot! \n\n4/5 (boba knocked it down, but this place is still good!)", "name": "Sharetea", "rating": 4}, {"index": 22, "review": "Excellent drinks. on the pricy side, but a cut above the others in the area as far as taste and quality. the yelp checkin for a free small are large pearls helps too!\n\ninterestingly, this store maintains the quality of the one we visited in San Francisco. i would recommend sticking to this particular Sharetea because had an awful experience visiting the one in Valley Fair (which reminds me, i need to write a review for that one :p )", "name": "Sharetea", "rating": 4}, {"index": 23, "review": "First time here, ordered the Jasmine milk tea. It was pretty good. Great price for the big size.", "name": "Sharetea", "rating": 5}, {"index": 24, "review": "Decent boba near work has been hard to find in this area but Sharetea has always been consistent with their drinks every time that I've visited. The boba can range from normal chewy to extra chewy but I haven't had a bad batch yet. Sharetea has a bunch of board games on deck so it's a great place to catch up with friends. :) Staff is chill and always willing to help you figure out what you want and answer any questions about a specific drink. 24 minute street parking in the front and there is a parking lot in the back.\n\nBtw, they don't have Thai tea unfortunately. :(", "name": "Sharetea", "rating": 5}, {"index": 25, "review": "Yum for sharetea! This location has limited parking, but after regular hours, there is plenty of street parking. It's a bit loud inside, but very warm and inviting. I decided to try the mango/passion fruit black tea with boba. I did 50% sweetness, but will go for 30% next time as it was still too sweet. The boba....why this place gets minus 1 star is it was old boba mixed with fresh boba. Some were so hard and yucky that I had to keep spitting it out.\n\nThey accept fivestars as well!", "name": "Sharetea", "rating": 4}, {"index": 26, "review": "The sesame milk tea uses real ground up sesame. Because there were so many ground up sesames i could not finish my drink as i got so full from the sesame flavor. You should avoid the sesame flavor if you dont like Tahini.  The oreo milk tea you should get less sweeten as the oreos already add a lot of sweetness. The oreo milk tea is still delicious even with less sweetener.", "name": "Sharetea", "rating": 4}, {"index": 27, "review": "Pretty good Sharetea location! I had a passion fruit green tea with boba. I had mine half sweet and definitely recommend getting it this way as it is plenty sweet enough and still refreshing. If you haven't had actual passion fruit before, the seeds are quite hard so you might want to just swallow them instead of chewing. It is slightly strange because you're trying to dodge the seeds but also trying to get at that sweet, sweet boba but the flavor of the tea makes it all worth it. The boba was also pretty good - just a bit chewy and a good amount of sweet.", "name": "Sharetea", "rating": 4}, {"index": 28, "review": "My absolute favorite is the peach great tea with either boba or pudding. Hands down my go to for a yummy and refreshing treat! I'm so addicted to this place...just take all my money!!", "name": "Sharetea", "rating": 5}, {"index": 29, "review": "I love this tea all year round! I minus a star because of the really loud music...I understand the sales tactic to have loud music for people to order faster but if the cashier can't hear me, then it's too loud in general. Other than that I come all the time and love the variety of tea....", "name": "Sharetea", "rating": 4}, {"index": 30, "review": "I usually get my boba drinks from Teaspoon but decided I would try something difference hence Sharetea.  I ordered two milk teas and I was not disappointed.  The only disappointment was I ordered via Yelp 12 minutes before I arrived and my drinks were still not ready.  I sat on the bench by the register and waited another 10-15 minutes.  Then I realized there were several drinks on the table and I finally asked if any were for me.  They checked and said yes.  So why didn't anyone call my name out.  I was right sitting in front of them.  Those drinks were put there 2-3 minutes after I arrived so basically I waited an extra 10 minutes.", "name": "Sharetea", "rating": 3}, {"index": 31, "review": "I always find myself coming here when I'm near the Valley Fair area and don't want to deal with the parking situation at Santana Row to get Fantasia!\n\nThe Green Tea with Sea Salt Crema & Boba is my absolute favorite! The green tea flavor is really light and refreshing and perfect for those warm sunny days in the Bay Area. I also really love the pearls here since they're freshly made and have the perfect amount of chewiness and sweetness. I really can't complain!", "name": "Sharetea", "rating": 4}, {"index": 32, "review": "I had no idea this location opened. It's a great spot and addition to the area. I really like the variety they offer here. I usually stick to the basic milk tea with pearls. I ordered 50% sweetness and no ice, and that was perfect! Especially since their boba has honey on it, that adds some sweetness too! I really want to try one of their drinks with pieces of fruit in it! It's not my favorite drink place but I would definitely come here again!", "name": "Sharetea", "rating": 3}, {"index": 33, "review": "Awesome! My hot sesame milk boba tea was perfection... the black sesame seed paste was thick and flavorful, and the boba pearls kind of melted into them to create one oozy melange of perfection. Sad I don't live closer! I hope to be near there again in the future. It was also a nice mellow vibe on a Friday night.", "name": "Sharetea", "rating": 5}, {"index": 34, "review": "Came here to spill some tea - though not in the literal sense!\n\nMy friends and I arrived here late evening on a Friday. This Sharetea is located along the street, but has parking in the rear. It's a cutesy place with chalkboard-looking paint on the walls and super loud vocalists behind the counters LOL \n\nI didn't know what to order yet, but the super nice guy behind the counter said it's ok and to take my time. When I did decide what to get, he was all smiles. His whole attitude was awesome throughout the ordering process. \n\nI ordered: \nHawaiian fruit tea\nCoffee creama\n\nMy coffee creama was super decadent. I needed it though; I've been up since 4! My friend's Hawaiian fruit tea was different, but refreshing. \n\nAs we sat at our table talking, we were interrupted multiple times either by the super loud music playing in the speakers or by the super loud singing from the workers trying to end their day. It was super funny. Love that they were super lively even by closing. I would choose that over seeing dead-eyed workers who don't smile. \n\nWould come back if we decide to meet up for tea again! Also, they do 5-Stars rewards!", "name": "Sharetea", "rating": 4}, {"index": 35, "review": "I've been a fan of Sharetea for a long time- my favorite is definitely the Okinawa milk tea. This was my second time visiting the Santa Clara Sharetea and it was probably the best Sharetea service I have ever received. This Sharetea has a lot more options than the Sharetea stores back home and so I wanted to try something new. I asked the employee what the \"high mountain tea\" was and he described it as some sort of green tea. Then he asked \"do you want to try it?\" At first, I misunderstood him and thought he was asking if I wanted to buy one, but then he clarified and wanted to know if I wanted to sample it. I of course said \"yes, please!\" And so he went about making a high mountain tea just for me. He gave me the sample and it was love at first sip. I wasn't expecting it to be milky (it's listed under the brewed tea menu and not the milk tea section) but it was milky and frothy and 5/5 delicious. The green tea was flavorful (it's not matcha so it wasn't too caffeinated or bitter). It also had a sweet melon taste to it. I ended up getting it with 80% sweetness with light ice. Overall, 6/5 for customer service and quality milk tea.", "name": "Sharetea", "rating": 5}, {"index": 36, "review": "Literally came in at 9:45pm to grab some bubble tea, and as I walk up to the doors, the servers are locking the doors up. I understand that by close at 10pm, and that it takes time to wrap up and clean up the store, BUT if you are going to close at 9:45pm, PLEASE do not advertise that you close at 10pm on Fridays and the weekends. I understand that the servers probably want to leave the shop early, but the set operation hours were set for a reason. People drive out of their way to get drinks, and to have the store close NOT EVEN five minutes before closing, was a little unprofessional. I believe there were three or four associates working on 8/4, so it's not like they were understaffed. This wasn't our mistake, we even called their phone number to check if we had made a mistake on our end. \n\nNo sir. \n\nJust a visitor from outta town, and wanted to grab some quality tea - not sure if we'll be coming back to this location anytime soon. Very disappointed.", "name": "Sharetea", "rating": 1}, {"index": 37, "review": "I be rolling up in here sooooo often, ferserious. I had no idea they were here and I've been living in this area for YEARS ... damn. Wish I'd known sooner!\n\nPROS\n\n- Lots of toppings options\n- Synced to FiveStar, hooking you up with little promo deals and such\n- You can adjust sugar and ice and temp.\n- They have interesting / unique fresh fruit combos (so, more than the typical basic powder-based formulations) -- like the Hawaiian Tea and such. Watermelon is on there. Honey Lemon. Etc.\n- Open late\n\nCONS\n\n- Every time I've gone in there to order 3+ drinks, they get something wrong with one of them. It's not major, it's just tea, so I don't drive back and yell at them, we just proceed with the bevs as they are but, just be thorough and double check your order as you place it and pick it up. Because of this, I have been worried sometimes that they missed my sugar adjustment and put sugar in it anyway (like, when I say NO sugar, because I know the base of the tea is sweet enough, I worry that if it tastes sweet they ignored my no sugar request, which is bad)\n\n- NO snacks. They have ice creamy blended drink stuff but meh. Salty fried chicken is needed, fries, something!! But I'd rather they focus on the drinks first.", "name": "Sharetea", "rating": 4}, {"index": 38, "review": "Decent offerings, but not on the level of Sinceretea in San Jose. I had an Okinawa Pearl Milk Tea with pudding instead of boba. I ended up stealing my BF's black milk tea with coffee jelly. Much better flavor. It was my first time trying pudding in boba tea, just not a fan. Good if you're already in the area.", "name": "Sharetea", "rating": 3}, {"index": 39, "review": "One of my new favs for boba. I really like the creama matcha green tea, light ice, honey boba, medium sweet. The nights are busy with SCU students but during the day I can usually get in and out in under 5 minutes. The staff are always friendly and helpful with any drink questions.", "name": "Sharetea", "rating": 5}, {"index": 40, "review": "Had the Roasted Crema. Think roasted oolong with sea salt crema. It was was ok. I'm glad I cut back to 50% sweetness though because the boba is soaked in honey and gives it even more sweetness. The flavor of the tea was nice. Which it were a bit more overpowering though. \n\nSmall place. \n\nCheck in on Yelp and get free boba!", "name": "Sharetea", "rating": 4}, {"index": 41, "review": "This is my favorite boba tea place in town. It's conveniently located near my home, and they always make it the way I like it. The only bad thing is that they don't offer chicken .  Despite the fact they don't make food, I love their tea. One of my favorite drinks is the mango green tea, iced with sugar!", "name": "Sharetea", "rating": 5}, {"index": 42, "review": "The milk tea here is not bad, but don't get their \"Crema\" drinks. I got a Strawberry Crema drik, and it was basically 80% cream, and 20% flavor syrup, or whatever they put in there. I couldn't even finish it. It was like a Strawberry Milk Shake, but instead of ice cream, it was straight up cream. It was so undrinkable, the only thing I shared it with was the bottom of the trash can.", "name": "Sharetea", "rating": 2}, {"index": 43, "review": "Stopped by to grab a post-lunch boba and settled on taro pearl milk tea.\n\nThey use Five Stars which is A BIG WHOOP--a majority if not all boba places I frequent all use Five Stars. I usually try the taro milk teas at various boba shops as it is one of my favorites to get, and you can really get a feel of the bubble tea just by tasting their taro. I got zero sweetness as per usual and was satisfied with the end result of sweetness...not too sweet and perfect for my palette. When my sister tried the boba, we agreed completely that the lack of taro chunks gave it an unauthentic feel to the tea, and the boba was not consistently chewy. Some were yummy and QQ, but a few here and there in between were not at all.\n\nThe store itself is bright and with a clear menu overhead! The staff was quick and our cashier was a friendly dude. I don't usually drink Sharetea since there are a bunch of boba spots in South Bay that I would choose instead--TeaTop, Ten Ren, etc. However, if you're in the area of Santa Clara, Sharetea is a great option to have! Pricing is typical for boba, and remember to tip since you would normally tip your baristas right? Boba makers are just as qualified!", "name": "Sharetea", "rating": 3}, {"index": 44, "review": "I don't even have Jasmine tea, the basic one. Their classic pearl milk tea isn't all that good either. I keep coming here because this is the closest boba tea place to my work.", "name": "Sharetea", "rating": 2}, {"index": 45, "review": "Happen to walk by this place and decided to check it out! I'm usually really picky on my boba places but this place was really good!! \n\nPrices are fair and staff was very friendly and efficient with the drinks.\n\nThey have a good variety of drinks and a big menu! I had the coffee milk tea with honey boba and it was so delicious! Not to sweet and just the right amount of ice. Boba was fresh and chewy and had a good light flavor to it from the drink.\n\nDefinitely excited about trying other stuff on the menu!", "name": "Sharetea", "rating": 5}, {"index": 46, "review": "I love milk tea. Fruit tea. Boba. Pearls. You name it. So when I saw that the lightbulb milk tea was available here I went a little crazy. I was so smitten to try it out! Unfortunately they didn't have it at this location but was told other locations have it. So now I will be going on a hunt for the lightbulb tea. 2 of my favorites from Sharetea are the Taro ice Blended with pudding and the mango and passion fruit green tea. This particular fruit tea is quite sweet (which I like). There is a lot to try here.  And it looks like they are expanding their menu! I can't wait to try more!", "name": "Sharetea", "rating": 5}, {"index": 47, "review": "Taro tea fail.\n\nThe guy who works here is so sweet - really adorable. Cute place but do *not* get the taro milk tea. Doesn't taste like taro at all.", "name": "Sharetea", "rating": 2}, {"index": 48, "review": "Shareteas are opening up all over the place! Im happy this one opened up near my work and there is one opening up soon near my house. Location is a bit hard to find because it took me a min to find it, but its facing outwards towards the street a little past jackson. Its nice and bright and is inviting. \n\nTheres an entrance in the front and one in the back from the parking lot which is pretty cool. Walking in, the staff greets you as usual and the front is open with the milk tea stations. \n\nWhat i purchased was Jasmine Milk tea with 50% sugar and less ice. Coffee crema with less ice and regular sweetness. Both regular sizes. I wish there was a choice on sizes cause sometimes a regular size is just not enough. Both of them taste great! My mom enjoyed her jasmine milk tea because she usually likes it less sweet and she had the option of it to be less sweet for her. I like my coffee crema. It has a nice coffee taste mixed with the crema. I usually like getting the drinks with the creme on top, but this one tastes a little bitter since ive had sweeter ones before. But im not complaining because the coffee went well with it. We both put boba in both of our drinks. The boba is pretty good. Nice bite to them. One thing, as i drink my drink, the boba was all stuck together. Maybe they need to put more sugar syrup in the batch to help the boba separate. \n\nStaff is friendly and helpful. They were inviting and made sure i got what i wanted. \n\nI like this place. A nice place to hangout with your friends and just talk or enjoy some yummy boba.", "name": "Sharetea", "rating": 4}, {"index": 49, "review": "Came here around 6 it wasn't too bad, I actually like that it was empty. But overall I've had better I mean it's good and I needed a fix so I came but hm...there's so much around the area but if you're close and you need some I say it's a good place.\n\nI posted a picture nice tables plenty of workers it seems like a friendly place but I feel like it's too common. \n\nI'll probably try it again can't really go once and write a good review. so at least they have one more returning customer in me :)", "name": "Sharetea", "rating": 4}, {"index": 50, "review": "I managed to go here once on a day off from work because I really wanted to my fresh taro milk and did not feel like driving a super long time all the way up to San Mateo. I was really confused when my drink came out blended - I thought it was the wrong drink! When I asked the barista, they told me that the drink has always been a blended drink - which is untrue because the San Mateo (original) location used to make it like a milk tea drink.\n\nThe weird thing is when I returned to the new San Mateo location to confirm my suspicion, the drink came blended...it still perplexes me to this day...", "name": "Sharetea", "rating": 3}, {"index": 51, "review": "Another Sharetea, another five stars doled out! Sharetea is my absolute favorite bubble tea place ever! If you haven't tried their Okinawa or Hokkaido milk teas yet, give them a shot!\n\nThis spot has great bubble tea and is a great place to park and get some work done. There are plenty of tables, power outlets, and free WiFi!", "name": "Sharetea", "rating": 5}, {"index": 52, "review": "I really enjoy the creama drinks here. They make it thick and delicious. 50% with less ice and lots of pudding is my usual order and there has never been an issue. Occasionally it can be slow but the wait is worth it. I've been back here many times and I'd visit it whenever I'm in the SJ area. I recommend!", "name": "Sharetea", "rating": 4}, {"index": 53, "review": "Sharetea is my new favorite boba. The oolong milk tea (50% sweet, 50% ice) is the best I've ever had in the Bay Area.\n\nThey also have the bottled fruity drinks and pea tea drinks as well. I've had the fruity mango bottled drink at the Metreon SF location and this location -- they are both good! But $6.. pricey. Only on a \"treat yo self\" day.\n\nI'm a bit skeptical about the butterfly pea teas. I'm not sure what to expect.. but we'll see if I muster the courage to fork over $6 for the 'gram :~)", "name": "Sharetea", "rating": 5}, {"index": 54, "review": "Conveniently located next to Toppings Tree & Taplands Brewery in Downtown Santa Clara at the University Plaza, on the corner of Homestead and Jackson. It's a refreshing sight to see in the neighborhood, since there aren't any boba/milk tea places nearby! The service is exemplary, and the staff seem to be enjoying their jobs - making sure their customers are taken care of, and orders are taken correctly! Their menu is quite extensive, with various options to customize your drinks to your preference. Parking is aplenty, with both street and garage options, in addition to having ample seating inside. Highly recommended for those wanting that sweet tooth fix and/or refreshing beverages to beat the heat!", "name": "Sharetea", "rating": 5}, {"index": 55, "review": "I love every milk tea there. They never disappoint! The wait for the drink wasn't long and the workers are very nice!", "name": "Sharetea", "rating": 5}, {"index": 56, "review": "The first time I have ever been to Sharetea was when I went to the island of Boracay in the Philippines. And boy, was it a gem to find. Talk about variety...wish I can find the picture of the menu for their milk tea selection...yes, it was that many! And not to mention the different type of mixture you can add. Okay, just to give you a sample: I had a cocoa crema with sea salt, yakult, and cream cheese...got one thing to say: damn best cocoa crema I have ever had!!!\n\nSo when I go to Sharetea here in San Mateo, San Jose, or the one here in Santa Clara by Homestead...I always get the cocoa crema, but unfortunately they don't have the same ingredients, but nevertheless it is good! Can't wait to try the original one in Taipei...one great reason to take a vacay haha!", "name": "Sharetea", "rating": 5}, {"index": 57, "review": "i love sharetea santa clara so much! the employees are all so kind and helpful. i come here so often that one employee has my usual order memorized! it is a great spot to go with your friends and play board games (they have a nice collection in the back)! i come here frequently to study and get some school work done. the wifi connection is also very good. \n\nstrong wifi connection + delicious boba = productivity :)", "name": "Sharetea", "rating": 5}, {"index": 58, "review": "I've been here several times now, and although I personally have gotten tired of Sharetea's somewhat limited menu options, it's still a solid boba place close to Santa Clara University (one of if not the only decent boba place in walkable didtance). I will say that employees here are mostly local students who tend to be a bit slower than usual, but drinks are generally good quality.", "name": "Sharetea", "rating": 4}, {"index": 59, "review": "I was really psyched when I heard there's a new Sharetea opening in the Santa Clara area which is kinda more reachable for me. I've never been to any of the other locations cuz of this reason. it's also another tea shop franchise from Taiwan which is always a plus! at least to me, that better mean it's going to taste close to the real deal. \n\nthis Sharetea is located on Homestead Road in Santa Clara. it's pretty much just a few blocks from Santa Clara University so I'm expecting lots of traffic from college students here. it's in a small business complex next to a Taplands. there's street parking n there's also a small parking lot across the street that u can park for 2 hours. (on weekdays, there's probably restrictions for business only parking.) \n\nwhen we stepped inside the shop on Saturday afternoon, it was pretty empty except for another group. everyone was most likely still eating lunch. (we like to eat early to miss the crowds. : )) the space is pretty large n deep inside. there's plenty of tables to just sit n hangout. they also have games at the back of the shop to use. there's cute designs on the walls of Taipei 101 n drawings of their popular teas hung up. \n\nthe employees were helpful n friendly. their menu was extensive. they don't sell snacks here which might b a good thing. (focusing on the teas makes better products.) I was hoping they'd have the Earl Grey Series I heard they had at the San Jose shop, but alas nope. they still had teas I was interesting in trying though. I ordered a Honey Milk Tea for myself. it was pretty good! the flavor of the honey was definitely there! I would suggest getting it less sweet cuz honey is a pretty sweet flavor. I would definitely order this again or try their Hokkaido or Okinawa Milk Teas. I like teas with FLAVOR. : )", "name": "Sharetea", "rating": 4}, {"index": 60, "review": "I ordered original milk tea with small pearls. Easy parking and there was no wait. Service was great and we were in and out. No complaints about this location at all. Pearls were a little too chewy but the milk tea itself was just right. I would definitely come back here.", "name": "Sharetea", "rating": 4}, {"index": 61, "review": "Delicious drinks!!!! Got the peach tea with mini boba... and the guava smoothie with icecream for the kiddos.", "name": "Sharetea", "rating": 5}, {"index": 62, "review": "Good boba place close to my school! Very cute decor and they have nice selection of teas. I specially get their regular milk tea with boba. I always order it with half sugar because I feel like they overload it with sugar. Even with half sometimes it's still super sweet. \n\nThey offer white boba but don't think it has the same texture as regular black boba. It tastes more similar to aloe Vera than it does black boba. \n\nThe only downside is they don't provide bags. It costs 10 cents for a bag. I ordered three drinks and I actually do need the assistance. If I'm buying 3 or more drinks from them I expect them to at least provide a bag. How else am I going to carry all of this? Yes it's just 10 cents but I also think it would be good customer service if they include bags when someone is seriously struggling with four big drinks. A cup holder would suffice as well.", "name": "Sharetea", "rating": 3}, {"index": 63, "review": "Tea is good but are very unorganized as they serve their on line orders first and have walk in customers wait over 20 minutes for one drink/s. Order online if you are in a hurry.", "name": "Sharetea", "rating": 2}, {"index": 64, "review": "Not a big fan of this place anymore. All their drinks taste different/are watered down. There are much better tea places than here.", "name": "Sharetea", "rating": 2}, {"index": 65, "review": "I got the strawberry ice cream blended with lychee since I had my first one at the Hostetter location which was amazing, I had to have it again. This location, they put way smaller amount of ice cream and they sealed it. At the other location they have the round topper lid in which they're able to top it off with the ice cream. Was not asked the sweetness level. Customer service was eh. No enthusiasm or friendliness observed. It's a Saturday evening, I mean I guess I understand? And Santa Clara location charged more for this drink than did the Hostetter one. 25 cents more. Why? You gave me less...", "name": "Sharetea", "rating": 3}, {"index": 66, "review": "I highly recommend the Sharetea at the Santa Clara location! They truly make the best Creama Boba Drinks! I've had the Match Green Tea Creama, Coffee Creama, and the Orea Creama and ALL were SUPER YUMMY! I've tried the Milpitas and Berkeley locations and Santa Clara Sharetea TOPS them all!", "name": "Sharetea", "rating": 5}, {"index": 67, "review": "Share tea has decent tea for the price. Sometime your cup of tea would be made wrong and they won't redo it", "name": "Sharetea", "rating": 4}, {"index": 68, "review": "I come here SO MUCH that I cannot believe I haven't checked in or written a review. So I just checked my five star and apparently I have 29 visit.... HAHAHA wow I'm an addict. \n\nWhen this location finally opened I was ecstatic as there aren't any good boba places in Santa Clara that was close to my work. I typically get either\n-honey green tea with grass jelly (50% sugar)\n- green milk tea with grass jelly (50% sugar)\n- oolong milk tea with grass jelly (50% sugar) \n\nThey make their drinks really consistent which is why I keep coming back.\n\nMy only complaint is that the cashiers need to listen more carefully. Sometimes when I order a honey green tea, they make it into a milk tea, when I did not say milk. I've seen it happen with other customers too. We shouldn't have to say no milk when we order. Otherwise, the cashiers/workers are super nice!!", "name": "Sharetea", "rating": 5}, {"index": 69, "review": "Since its been a few months that Sharetea opened, they've been running a lot smoother from when they had their Grand Opening. Their drinks are consistent with flavor and the inside is kept clean. Service speed is still a hit or miss, it seems like there's new workers quite often that are being trained which is expected since its usually students who work at tapioca places. \n\nI rated this 5 stars based on service, always friendly and professional! \n\nThough I still dislike the TV menu mounting location, during the daytime you get a glare on the screen. But there are smaller menus hung on the wall to the right of the register counter.", "name": "Sharetea", "rating": 5}, {"index": 70, "review": "Best sharetea \nAll the workers are always accommodating, drinks are delicious and flavorful compared to other sharetea locations", "name": "Sharetea", "rating": 5}, {"index": 71, "review": "I recommend the mango green milk tea! It's sooo yummy, especially with boba! I love the little mango bits in it and I like that they have a check in special through Yelp.\n\nI am only giving them 4 stars because I wish they had healthier milk options/alternatives (such a soy or almond milk) and I agree that the sweetness level is inconsistent.", "name": "Sharetea", "rating": 4}, {"index": 72, "review": "Stardust bottles!!! Me and my friends waited over weeks for them and they finally came! They're super cute and worth the 20 minute drive.\n\nThe store itself is clean, and looks new. The atmosphere is pretty lively. It's about an average tea house. Parking was not too hard to find, but you might have to park outside of the plaza that this place is located at. \n\nService was alright. The workers were friendly and customer service was fine but they took a long time getting the drinks. It was not that crowded at all when I went so I did not understand why it was slow. It could have been understaffed, but there were at least three people working and my group only ordered 4 drinks. There did not seem to be a crowd or anyone waiting when we got there. It took nearly 20 minutes.\n\nThe drinks itself were pretty good. The one I got (the half purple and white one) tasted watered down, though. I could barely taste the flavor but it was still creamy, so that was the plus. All the others were fruity and sweet as well!! So my recommendation is to get the other three if you're into fruity drinks. Otherwise, stick to a normal milk tea there.", "name": "Sharetea", "rating": 4}, {"index": 73, "review": "DO NOT USE the order pickup option on Yelp because they did not get mine until I showed up in person to pick up my drinks. They do not have a working phone number that directly contacts the store (it is just a voicemail)--major downside when you're trying to call to confirm that your order even went through so that you can rely on your drinks to be ready ahead of time. The worker was super courteous and apologetic at least, but that doesn't make up for the fact that I am now late to a meeting.", "name": "Sharetea", "rating": 1}, {"index": 74, "review": "Good service, good atmosphere, games galore but the tea that we tried was meh. I ordered the Okinawa milk tea with small pearls, and the total came out to be $4. Pricier than most boba places but the size was ample. I got 80% sweetness, but I seriously regret not getting the entire 100. \n\nLet's start from the beginning. Okinawa milk tea is supposed to taste like brown sugar, I'm not sure why but that's what it said on the menu. I was feeling adventurous and decided to try it for the very first time. It tasted really different. I don't know how to explain it but it does have a HINT of brown sugar taste but if any of you are interested just get the 100% sweetness because I could barely taste a thing! I checked in and got free pearls and wanted to try small pearls for the first time. A good thing about sharetea is that their boba is soft with just the right amount of chewiness and they give a lot too! The small pearls I did not like. There were just too many and I guess I'm pretty biased considering I barely even like regular sized pearls. \n\nPlease note that the 2/5 stars is for the TEA, because the service was great don't get me wrong. My boyfriend ordered the oreo milk tea, and he was expecting an oreo milkshake kind of thing but it tasted really odd. I guess it's in the name because it DOES taste like milk tea with some oreo blended into it, but it was definitely not our favorite. \n\nOverall, I just wanted to see what the hype was about and now I know that I won't be coming back because the tea is just okay but the price doesn't make me want to return.", "name": "Sharetea", "rating": 2}, {"index": 75, "review": "As Tea places go, this one is really good. I like the small pieces of fruit that they put into the drink. Their tea actually tastes different than other tea places, which is quite amazing. Interior is quite nice, but no outside seating unless you sit at the subway tables next door. Outdoor seating would be a plus for sure.", "name": "Sharetea", "rating": 5}, {"index": 76, "review": "This place is awesome !! I might have a addiction to the Oreo milk tea . Lines aren't that long and they are super fast ! Staff is so nice. Overall the boba is very good here", "name": "Sharetea", "rating": 5}, {"index": 77, "review": "It was clean and fast, friendly staff... too bad the taro milk tea tastes like bubble gum vape juice.", "name": "Sharetea", "rating": 3}, {"index": 78, "review": "They suck at putting regular sugar & extra ice. Whenever I ordered mix pearls, they're fuck it up.  \nSan Mateo Sharetea is way better than this", "name": "Sharetea", "rating": 1}, {"index": 79, "review": "I'm a fan of the Sharetea San Jose location and came to their newest location in Santa Clara while I was in the area. I got my usual drink, the homemade taro fresh milk and was so disappointed. I asked for it to be well blended but my drink was super icy. \n\nWhile the workers there are nice, they are not as experienced or efficient at making drinks. They're still looking at the drink recipe guides as they work.\n\nAlso, I'm upset that they do not link this location with other Sharetea locations for their Five Star reward program unlike other businesses with multiple locations. I'm bummed the two stars I did earn here didn't go towards my Sharetea San Jose rewards because I don't think I'll be back at this location again.", "name": "Sharetea", "rating": 2}, {"index": 80, "review": "I've been complaining that there wasn't any good boba around my work for years, so I don't know how I've let months pass before realizing Sharetea opened a mile within my workplace! Now that I know that delicious boba is so easily accessible, I'm extremely excited for my taste buds but also terribly worried about my waistline. \n\nSharetea has already established themselves as one of the better pearl tea chains, and the fact that this one in Santa Clara lets you pre-order with OrderAhead and also has a decent amount of seating makes it even more desirable. They have plenty of choices for flavors, add-ins, ice level, and sugar level to adjust it to your perfect drink. The staff works efficiently, there is plenty of street parking, and the ambiance is rather welcoming. What more can you ask for?", "name": "Sharetea", "rating": 4}, {"index": 81, "review": "I like this place. I always get the jasmine milk tea with pearl. The tea sometimes isn't \"jasmine-y\" enough...but that's more of a personal preference. Staff is friendly and the tea is always good! I like it also bc it doesn't taste like it's loaded with syrup. Good stuff. But can get busy in the afternoon when the local middle school gets out.", "name": "Sharetea", "rating": 4}, {"index": 82, "review": "Amazing overall, empty most times i come and there are fun board games by the back while waiting for your boba or just to chill or do some work", "name": "Sharetea", "rating": 4}, {"index": 83, "review": "Haven't had a bad order here yet. Some clarifications that could be helpful:\n\n1. They use non-dairy creamer in their milk teas (standard) UNLESS you look at the Fresh Milk menu\n\n2. Classic Coffee vs Coffee Milk Tea - both have coffee and milk, but one has tea also for a tea flavor.\n\n3. Use their loyalty program for free toppings!", "name": "Sharetea", "rating": 5}, {"index": 84, "review": "My roommate loves this place and I've been a handful of times.\n\nWhat I've tried:\n- Sesame Milk Tea: I believe this one is non caffeinated and they do not offer it at the Sunnyvale location. So creamy and delicious!\n- Mango Green Tea w/ Pearl: The Boba is chewy and the tea was the right amount of sweet, even at max.\n- Black Milk Tea: So good, a classic. \n- Ice Cream Strawberry Milk Tea: this is one of the only boba places that offer a scoop of ice cream in lieu of milk or cream, it is a very unique and tasty offering :D\n- Taro: They do Taro a bit differently here and they can only make it with shredded ice (I'm guessing they keep it frozen). Unfortunately I am not a fan.\n\nThey do not serve food here but they have a large variety of drinks, and the location is very convenient being by the university. Parking on the street is usually abundant and they have nice large tables inside.", "name": "Sharetea", "rating": 4}, {"index": 85, "review": "I have not been able to find anything here I actually like! Everything is just ok. I always get my drinks regular sweet and it's never consistent. Some days it's not sweet enough, other days, it's way too sweet. Their drinks seem to be really milky tasting too, not enough of the tea flavor for me. The best drink I have had here is probably almond milk tea and apparently that is a seasonal flavor soooo that sucks. It's a convenient location for me to get boba but it's barely average.", "name": "Sharetea", "rating": 3}, {"index": 86, "review": "We were in the neighborhood and had a sudden craving for boba.  So far, the only drink I had at  Sharetea (other locations) was their coffee milk tea with boba and it was delicious.  Since i wanted coffee, I told my husband to make a quick stop here.  I walked inside and ordered 2 drinks: coffee milk tea & classic black milk tea, both with boba (one of the boba toppings were free from a Yelp check-in).  The drinks were good but my drink lacked coffee flavor.  I also ended up using the bathroom many times afterwards.  Also, at this location (not sure about other locations), you need 12 points (on FiveStars app) for a free drink.  Other boba establishments, only require 10 points.  Will I come back?  If I'm in the area and there's nothing better, I will definitely come back but it won't be some time soon.", "name": "Sharetea", "rating": 2}, {"index": 87, "review": "I would've given 1 star, but the workers were really sweet.\nBoba was hard, stuck together, uncooked and made my stomach cry. The ones that were cooked tasted pretty good though! I got a lot of variation- really didn't know which one I was going to get next!\nKind of sad :(", "name": "Sharetea", "rating": 2}, {"index": 88, "review": "Finally a Sharetea that's close to where I live. This location has two entrances. The back of the store shares a parking lot with several other businesses and you can find street side parking on Homestead.\n\nThis is a relatively a large Sharetea location with several 4 top tables against the wall. There is a bookshelf of board games if the mood strikes you and your crew.\n\nQuality of the drinks I have had here thus far are on par with the several other locations I've been to around the Bay. However, it did seem that the speed in which they are making these drinks is not up to snuff quite yet(I'll chalk this up to this location being fairly new still).", "name": "Sharetea", "rating": 5}, {"index": 89, "review": "The tea is fragrant and the pearls are usually cooked well to a nice and chewy consistency.  I hate when places undercook the pearls and they're still hard/raw.   I usually get the fresh milk tea with green tea.  I usually get the regular pearls or small baby pearls.  I wouldn't go out of my way to come here for tea, but if I'm in Santa Clara and wanting some milk tea, I would come here.", "name": "Sharetea", "rating": 4}, {"index": 90, "review": "My friend and I were near SCU and had a random craving for boba so we decided to try out Sharetea for the first time today :) I ordered the Okinawa Brown Sugar with less ice and 80% sweetness and my friend ordered the Mango Green Tea Crema with no ice and less sweetness. I couldn't really taste the brown sugar even with 80% sweetness, so it just tasted like a regular bubble milk tea with extra sweetness at your average boba place; I would recommend getting 100% sweetness. However, the drink as a whole wasn't bad at all, as the sweet and chewy pearls were able to compensate for the mediocre tasting tea. My friend's thoughts on her Mango Crema was that it was overall pretty good and it tasted a lot like Happy Lemon's Mango Matcha. \n\nThe location was lowkey hard to find and there aren't too many places to park other than near the court house. The inside seemed very similar to Tea Top in Cupertino, as the it isn't too big and there aren't very many seats. But overall, I would totally recommend for its chill environment to hang out as there is a large variety of drinks, a positive vibe, and board games!", "name": "Sharetea", "rating": 4}, {"index": 91, "review": "Love this place. I'm a vegan and they have drinks for me. Price is reasonable. Perfect for your boba fix! \n\nThey should install a bike rack out front though!", "name": "Sharetea", "rating": 4}, {"index": 92, "review": "They take incredibly long here to finish drinks compared to other shareteas I've been to and parking is small. On a positive note, you could hunt for parking in the 99 ranch lot. They also take 5stars!", "name": "Sharetea", "rating": 3}, {"index": 93, "review": "Been waiting for this place to open for a while. First heard about it when the girls at mygym were talking about the new boba that was being built next door. We usually go to class early in the morning and are gone by the time sharetea opens at 11:30am. A few Sundays ago I was craving some tea and decided to head over to this new hotspot to check it out. I parked in the back lot and walked through the back door. When I got to the front there was a line out the door! Wow this place must be good right?!? Turns out they take a while to make the drinks (be prepared to wait 10-15mins after you order your drink). First time I came I got the kiwi with ice jelly. It was delicious. The ice jelly don't really taste like much but it has a nice jelly texture. I like the kiwi bits too. Nice and refreshing. Second time I came back I got the peach green tea with lychee jelly 80% sweetness. Good peach flavor but way too sweet. I couldn't finish it. Seems like they only have one size too ( it's a pretty big cup). Hubby got the classic milk tea with boba and said it was alright. The boba was harder than he likes then. \n\nThey have several tables and some board games in the back. \n\nSo glad a decent boba place opened in the neighborhood :)", "name": "Sharetea", "rating": 4}, {"index": 94, "review": "Went here for the first time yesterday and was lowkey disappointed by the drink. Got a milk tea with mini boba, light ice and 30% sweet and I regret it. My friend told me to get 30% sweet because she thought the drinks were too sweet but afterwards we realized that's because she gets the fruit teas. Definitely going to come back again and try it with the regular sweetness to see if it's better. Service was fast and the pricing was average for boba. Their lack of different sizes was disappointing to my friend though who wanted a large. Overall like I said earlier I would come back to try it again to see if my opinion changes.", "name": "Sharetea", "rating": 3}, {"index": 95, "review": "What a cute, little, boba shop!\n\nThe menu here is pretty limited, but unique. While there are generic drinks like taro and thai milk tea, Sharetea has it's specialities such as the okinawa milk tea.\n\nOkinawa Milk Tea: $4(-ish) and comes with boba, has a light taste, not sweet, not a super strong tea taste, good blend of milk and tea\n\nTaro Milk Tea: comes with boba, strong tea flavor, doesn't taste like the traditional taro powder made boba, not sweet. \n\nThey're customer service was good, and the boba shop seems like a good place to hang out with your friends and study because of the atmosphere.", "name": "Sharetea", "rating": 4}, {"index": 96, "review": "Love the vibe. Really enjoy being able to walk from school and the nice tables to study on. Wifi is always a plus.", "name": "Sharetea", "rating": 4}, {"index": 97, "review": "Watching these employees function so slowly this afternoon was so painful...especially having worked at a boba tea place near a college campus before.  There was no sense of urgency. I'm normally more patient about wait times if I see the employees hustling, busting their asses trying to get drinks out as fast as they can, aware of all the customers with no drinks.  But man, they were so slow. I can't get over how slow they work here compared to other Shareteas in town as well as other tea joints.  Customers kept filing in and they barely made dents in the orders.  It wasn't like they were short-staffed either - there were four employees, one cashier, and another person in the back. I wanted to go back there and get shit done!  When I found my ticket next in line, I watched it like a hawk because I ain't lettin' no other customer take my drinks by accident after 30 minutes of waiting since placing my order.\n\nI guess I should mention something about their drinks!  Since the San Jose Sharetea didn't sell the High Mountain drinks the last time I was there, I had to get it when I saw it available here. It tasted like Chrysanthemum tea.  I think the wait-time made me less excited about my drink when I finally got a taste of it :(", "name": "Sharetea", "rating": 1}, {"index": 98, "review": "Maaan, SCU students are so lucky to have a Sharetea so close to campus. This location has free wifi for those who want to get some work done, board games for those who just wanna hang out. \n\nThe mango green tea creama (less sweet, less ice) is my absolute favorite thing to get here! Fruity, creamy, and so refreshing. I turned my friend onto it, and she loved it too, so I highly recommend everyone to try it!\n\nThe one thing that I don't like about Sharetea is that they don't sweeten their pearls, so it's a little strange for me to chew on flavorless boba. But if you're okay with the sweetness of the drink balancing that out, then Sharetea is definitely a win!", "name": "Sharetea", "rating": 4}, {"index": 99, "review": "ShareTea is one of my favorite boba places and I was so happy to hear they opened near my campus! They always have the best creamas and boba! ShareTeas drinks are on the sweeter side so I usually order 80% sweetness. \n\nMake sure you keep your eye out because Share Tea is located on the Main Street rather than a shopping complex. There is no parking lot, but there's a couple street parking spots in front and near by. \n\nThe location is not very large, so I can't even imagine what it's like when it's packed. \n\nSo I looooove creamas and usually don't shy away from my black tea creamas, however I decided to be adventurous and try the matcha creama with 80% sweetness and it was good!! The saltiness of the creama and the matcha paired well. The boba was the right amount of chewiness and sweetness. \n\nI can't wait to come back!! I already know this place will be popin as the weather warms up :)", "name": "Sharetea", "rating": 5}, {"index": 100, "review": "I LALALOVE Sharetea! Pretty addicted actually.. I come here probably at least 3x a week. No shame, you'll probably even bump into me. No high is better than a suga high ;) I've tried almost all brewed and milk teas.\n\nTips:\n- Brewed teas: mango green tea & honey green tea\n- Milk teas: mango green milk tea & oolong tea\n- Ice jelly is a thick, harder version of grass jelly, but less tasty... just stick with grass imo\n- QQ happy family is like all the toppings combined, I thought it was gross\n- Okinawa and Hokkaido taste similar... just Okinawa is brown sugar and Hokkaido is caramel toffee\n\n*Always wide open spaces for street parking making parallel parking easy especially for people like me.", "name": "Sharetea", "rating": 5}, {"index": 101, "review": "I got the passion fruit green tea with boba. It was pretty good, but a little too sour (even though I got medium sweetness). I've been to other sharetea locations before and what I like about them is you can choose the level of ice and sweetener that you want. I thought it was ok! Not as good as other locations I've been to though.", "name": "Sharetea", "rating": 4}, {"index": 102, "review": "This is my first​ time here. The staff is friendly but was a bit slow in terms of making the drinks. The interior was well decorated and clean. However, my biggest gripe with this branch is the fact that they didn't fill a drink all the way to the top and still sealed it??? And to top it off the drink I have tastes more watered down when compared to other locations. Their prices seemed a bit cheaper compared to other ShareTeas but I'm sorely disappointed due to the fact that they seem to make drinks with lower standards in mind than I'd expect.", "name": "Sharetea", "rating": 2}, {"index": 103, "review": "IT'S ABOUT DANG TIME an actually good boba place was opened around SCU. \n\nAs reflected in my rating, I thought Sharetea was pretty consistent as compared to the Union City location (I can't vouch for San Mateo or Berkeley because it has been too long since I visited!).  They definitely know how to make drinks and have a variety of flavors for different types of boba-cravers.\n\nI deliberately didn't come during soft opening just to see how good they would be during their grand opening.  Not bad Sharetea!  The whole process from waiting in line, ordering, and receiving our drinks was about an hour, but honestly I had expected it to be longer.  At the UC location, I usually order a strawberry green tea with grass jelly, 30% sugar and less ice, and I have to say this location did a great job replicating that!\n\nOther common drinks might be your usual pearl milk tea, Okinawa milk tea, passionfruit fruit tea, and the matcha with red bean.  They also have their top 10 drinks that they like to advertise.  Either way, whether you like milk tea or fruit tea, this is the place to go!\n\nOther than the BOGO special, one thing I thought was incredibly cute was the fact that you could order the \"Happy Family\" of toppings, which is basically every type of topping they have in store in one drink!  Whoa.  I haven't ever heard of this, but it's pretty genius for people who like to munch while they drink.  I've got to say that's a clever addition.\n\nOverall, great quality in this branch -- it's very, VERY similar to the Union City one!  I'm sure I speak for all SCU students when I say thank you, Sharetea, for finally being a walk away when we get those milk tea callings.", "name": "Sharetea", "rating": 5}, {"index": 104, "review": "This boba place has friendly and fast service. I come as a regular and returning customer and am very satisfied! The only thing is that the tea can be too sweet and strong sometimes, so pick your sweetness wisely! The boba is very fresh. I just wish there was more of a milk tea selection or there was a blatant option to add milk. I hope I can enjoy this location for years to come!", "name": "Sharetea", "rating": 5}, {"index": 105, "review": "This place was great even though their drinks are inconsistent. However, they recently increase the price, so like $5 for a regular milk tea? I don't know if I want to come back.", "name": "Sharetea", "rating": 2}, {"index": 106, "review": "Honestly, I've tried a couple of Sharetea's other locations in the Bay Area and I had bad experiences each time. I never thought I would find myself at another one again, but I was having lunch a block over and there was nothing else around. I told myself to be open about it and in I went. \n\nThis Sharetea has a great location. Right next to Santa Clara University and in an area that doesn't have any boba spots. There is parking in the back and other eateries next door. They are still in their soft opening phase, so it was empty when I went. The cashier was really really friendly and had me taste a ginger milk tea sample. I normally would never think of having a ginger tea, even though I love ginger, it just sounds like something that could easily go wrong and have a sharp unwanted flavor. I'm glad she had my sample it though, because it was delicious! The ginger wasn't overpowering. It tasted like a plain milk tea with this little bite from the ginger afterwards, so I think it had great balance. My only complaint would be that I ordered only boba and egg pudding but I also ended up getting bits of some sort of jelly in there too. Other than that, this place finally broke my streak for bad Sharetea experiences!", "name": "Sharetea", "rating": 4}, {"index": 107, "review": "Ordered classic black milk tea. Great quantity for the price  Friendly staff and quick service. Got free pearls with yelp check in", "name": "Sharetea", "rating": 5}, {"index": 108, "review": "Soft opening! Finally a ShareTea is open down in the South Bay/end of the Peninsula Location!\n\nDrinks are really good and I love how the fruit drinks have actual fruit! I'm totally addicted to the green tea with kiwi bits and jelly.\n\nStaff was prompt and friendly and I've been addicted to the ShareTea location in San Mateo so I'm thrilled to have one closer to home!", "name": "Sharetea", "rating": 5}, {"index": 109, "review": "Arrived here on Sunday 04/10/16 and put in my order for black strawberry tea creama at 12:58 pm.  It literally took them 16 minutes to make my drink.  There were three employees: 1 male and 2 females making only 3 drinks ahead of me.  The drink was not even that great because the girl making my drink was too distracted talking to her friends and not paying attention to what she was doing. She was worried about what her friends were ordering last time and not even looking down to see if she was doing her job correctly!  Needless to say, the drink did not come out as expected (dark tea and cream on top)..instead it looked like some juice drowning in expired cream..disgusting.   \n\nWould I return? Definitely not with this type of customer service.  The person ringing me up, Zhanna was great and was working hard... Too bad she was not the one making my drink.  I did not get the name of the other girl...but it only takes one bad seed to ruin the customer's experience with the business.", "name": "Sharetea", "rating": 1}, {"index": 110, "review": "Pretty bummed at this location right now.. Im a loyal customer and come here very often.. I usually order my taro milk tea cause sharetea makes the BEST in my opinion.. I'm sure I know what it's supposed to taste like. I sent a friend to get me one and was brought home this drink that looked like regular milk tea.. so I, myself went in to get it fixed. I'm pretty sure the person that made my drink must have been new cause he made it exactly the same way as he did it the first time. Usually the milk tea is slightly purple and creamy..... my drink tastes like a regular milk tea. I've never in my life seen a taro milk tea so brown. And yes I have tried the fresh taro smoothies that are more whiter in color,  I know the difference between powder and chunks.. I might be wrong, maybe the worker isn't new, but he definitely doesn't know how to make a taro milk tea like every other barista there. 2 stars cause this place is usually amazing", "name": "Sharetea", "rating": 2}, {"index": 111, "review": "Cooling off with some awesome Taiwanese pearl tea. The staff is super friendly and helpful they accommodated my special request. They have high grade tea quality. Their special home made salt and sweet cream is delish.  up", "name": "Sharetea", "rating": 5}, {"index": 112, "review": "Waited close to an hour for the opening BOGO day, hahaha yikes. Some of the pearls were a little hard but I'm super happy a Sharetea is opened near SCU and I'm sure they'll standardize quality soon enough. I ordered a mango passion green tea with pearls (50% sweet) and my roommate ordered passion fruit, orange, grapefruit tea with plum & lychee jelly (80% sweet). Hers was tangy and sweet, pretty refreshing and yummy, while mine was just the right amount of sweet and also tasty.\n\nWhile we were waiting for our drinks to be made, I noticed that the area near the cash register was super crowded. There were two older guys who looked like management who were watching over all the workers making drinks, kind of breathing down their necks in a way, I'm not sure if that's the best way to do things but I know I'd feel super anxious if it was my first week and I was being watched so closely. Maybe it's necessary but I feel like allowing for more open space in the front would be more efficient to get drinks made quickly, because we waited like 15-20 minutes after ordering.\n\nAnyways I will return here :)", "name": "Sharetea", "rating": 4}, {"index": 113, "review": "the tastes have been inconsistent and I sometimes I wish I drove a little farther to the other sharetea in santa clara which is more consistent.  the price has gone up raising their standard Milk tea to 4.95 a pop. So sad to give this a bad review, but I liked this place soo much that their inconsistencies are what made this good boba place to one of the subpar places next to it.", "name": "Sharetea", "rating": 2}, {"index": 114, "review": "They were good until they raised their prices. \nEveryone who is in my group always gets the same thing what I normally get is 375 now its 450 I know its still ok but thats a big jump", "name": "Sharetea", "rating": 3}, {"index": 115, "review": "Ordered winter melon milk tea and asked 30% sweetness, still super sweet. And $7.76 for a milk tea? Not sure if I wanna come back... This place might be overrated.", "name": "Sharetea", "rating": 2}, {"index": 116, "review": "They just opened up this location in close proximity of Santa Clara University and the Santa Clara farmer's market. Great place to hangout. Not super crowded with other stores/shops. They have a small shelf full of board games as well.  \n\nI went here for a Yelp event and got the Taro Pearl Milk Tea. They use brown sugar boba pearls, but the boba wasn't that sweet. The taro tasted a little chocolaty, as if they mixed it with chocalate milk. I'm not sure why, but even the tea had a brownish tint to it (as opposed to purple). I also asked for not that much ice and egg pudding--I got a lot of ice and no egg pudding -__-\n\nOverall, I'll have to come back to try other flavors, but (aside from the ambiance) not the best first impression.", "name": "Sharetea", "rating": 3}, {"index": 117, "review": "Customer service is great. Very sweet and friendly. Allowed me to taste toppings before purchasing. Liked that I can control sweetness and ice. I ordered the oolong fresh milk tea with egg pudding and herbal jelly. The tea part taste good but it was a very watery drink. Even though I ordered less ice. It was to watery. I believe they should should brew the tea stronger or add more milk . toppings we're good and good portion was given", "name": "Sharetea", "rating": 3}, {"index": 118, "review": "Going into the store, it was very clean and aesthetic. The workers are very nice and the drinks came out quickly! Their blended drinks are the best especially the taro blended with pudding or the strawberry blended with lychee topping! It feels homely and I would definitely come back!", "name": "Sharetea", "rating": 5}, {"index": 119, "review": "Yes, the tea is a little pricey.  Worth it since the tea is really good and there's finally a convenient location for me.  Plenty of parking in the private lot across the street.\n\nMy one gripe about the drinks is that the passion fruit drinks have a ton of seeds.  I get that that shows the drinks are authentic, but I still don't want to have to spit out (or eat) the seeds.  I feel like they could strain out the seeds pretty easily if they wanted to.\n\nService is hit-or-miss.  I've had a cashier forget to give me fivestars points for example.\n\nStill searching for a go-to drink here, but the best so far is probably the mango green tea creama* (100% sweet, no ice).\n\n*:  Or is it \"crema\"?  Even their online menu isn't entirely consistent.\n\nDrinks:  5 stars\nValue:  3 stars\nService:  varies\nOverall:  4 stars", "name": "Sharetea", "rating": 4}, {"index": 120, "review": "Ordered taro milk tea and claimed free boba via yelp. But they still charged me the boba. Then when I got my order there was no boba and had to wait longer. My drink was almost borderline slushy- disappointed.", "name": "Sharetea", "rating": 2}, {"index": 121, "review": "Checked in after I got my boba and then found out I could have had $1 discount.  Anyway ordered the Matcha and red bean plus Boba 50 cents extra.  It was so good but then in the hot Santa Clara weather, anything cold was a godsend.  Loved this place, really friendly staff.  Will go back if I am in the neighborhood again.", "name": "Sharetea", "rating": 4}, {"index": 122, "review": "This post was long overdue. I was so excited for this new Sharetea to open up in Santa Clara. They finally have one next to Santa Clara university. Parking was not a problem because you can always find parking right outside and there is also parking lot around the corner. I come here often at night and I barely have to wait in line. They took my order right away. The cashier was super patient. My boyfriend got the Okinawa Milk Tea with boba and I got the Cocoa crema and Oreo milk tea. I highly recommend the Okinawa milk tea. It was just the right amount of sugar and sweetness. The cremas are extra creamy and delicious. I'll definitely be back because of the drinks and fun games. \n\nService: 10\nDrinks: 10\nCleanliness: 10", "name": "Sharetea", "rating": 5}, {"index": 123, "review": "When my boyfriend and I are in the Valleyfair area, we always make a stop at this Sharetea. This was probably our third visit. I always get the Passion Fruit Green Tea, 80% sweet, with regular ice, and lychee jelly. He usually gets whatever he's feeling lol. The employees are always friendly and our drinks always come out the way we like it. \n\nLast night was different though. I decided to try the Taro Milk Tea. It comes with boba but I substituted it with egg pudding. My boyfriend got my order - passion fruit green tea, 80% sweet, w/ lychee jelly. My taro drink was very thick which was uncomfortable. It was also bitter? which is the opposite of what taro should be. My boyfriend's drink was also watered down which was disappointing ): It could've been because the drinks were made by new people.\n\nOverall, I'm usually happy with my visit but last night was off.", "name": "Sharetea", "rating": 3}, {"index": 124, "review": "I've been coming her tons since they opened! Their staff is awesome and Lauren is especially helpful! I was getting a drink for someone who can't have any dairy or dairy byproducts/caffeine (allergies) and Lauren went above and beyond to check all the products and insure we got a delish safe drink!!!", "name": "Sharetea", "rating": 5}, {"index": 125, "review": "Ordered two drinks here on a whim while in the SCU area and it was pretty disgusting. Both drinks were made very sloppily and they used a towel that's smelled to wipe the top. I didn't realize how dirty the towel was until I got home. You could smell the fungus stench in the. Ar and I didn't know what it was until I got home and tried to take a sip. The smell was so bad I tossed both drinks! Very disappointed.\n\nUPDATE: The manager reached out to me and invited me back for a to-do. New order way great and I've been back a few times and it's been great!", "name": "Sharetea", "rating": 4}, {"index": 126, "review": "This place is okay, we went here after eating topping tree as it was next door.  They do have a nice tablet to order which is cool. The menu has a lot of selections, but was not too confusing.  The prices are okay, but they do give you a large by default, so it is comparable.  I ordered a crema which was okay,  You have to mix it in order to get the full taste.  Overall the drink was not too bad.", "name": "Sharetea", "rating": 3}, {"index": 127, "review": "Clean shop with board games and plenty of seating. However, the oolong milk tea my mom ordered had barely any oolong flavor. It tasted just like plain milk with tapioca. I do appreciate that their milk tastes fresh and creamy (not some powder). My husband's taro milk with pudding was delicious. I think this place is tasty but in Cupertino, you have lots of options for bubble tea so I'm giving this place 3 stars.", "name": "Sharetea", "rating": 3}, {"index": 128, "review": "Best boba I've ever had! Hands down the best! and they are super friendly and the place is so clean", "name": "Sharetea", "rating": 5}, {"index": 129, "review": "Stopped in on a whim with Mr. Piano with a hankering for bubble tea, and neither of us ended up terribly happy with our drinks.\n\nI got the green tea/matcha creama, and he got the Okinawan milk tea. My drink started out okay, but I probably should have gotten it less sweet (I hadn't ordered this before, so I went with normal sweetness for a baseline), then the creama had this odd texture that I wasn't finding pleasant. Admittedly I'm not a huge creama fan, but I don't typically dislike it.\n\nMr. Piano started out enjoying his drink, which he got less sweet because most drinks start out too sweet for him anyway, but then halfway through he couldn't finish it because he started to feel ill from it. I tried some and didn't think it was terrible, although it tasted weird (probably because the sweetness is tied to the flavoring on the Okinawan milk tea, so he basically got it watered down), but I also ended up feeling a little off after drinking a bit more of what was left of his drink.\n\nGranted, this is a single instance, as I have never been to this particular Sharetea before this visit, but that's the experience we had. I probably won't be back to this Sharetea again, but that's partly because I'm not in its vicinity often and there are other boba places closer to me which I know I like and which haven't made me feel sick.", "name": "Sharetea", "rating": 2}, {"index": 130, "review": "Not bad, not great - and honestly not surprised since Sharetea is usually mediocre. Was craving taro and it was the closest location. However, boba was surprisingly noteworthy and whoever chooses the playlists has a great taste in music.", "name": "Sharetea", "rating": 3}, {"index": 131, "review": "Cool it's nice to have something like this available in my neighborhood. I would go back. Yummy yummy Boba tea", "name": "Sharetea", "rating": 4}, {"index": 132, "review": "I got the homemade taro milk tea and Sharetea is one of the best boba places. The taro is real, none of your powder stuff. Nice chunks in there with soft,  consistent chewy boba. Boba stays chewy after a few minutes of drinking,  it doesn't harden if you leave your drink out. I got 100% sweet with less ice. It was perfect!", "name": "Sharetea", "rating": 5}, {"index": 133, "review": "I usually like Sharetea, but the drink I ordered today has me rethinking my opinion of the place. I ordered one of their new drinks from their Whole Fruit menu. When they say \"whole fruit,\" they're not kidding! My drink had half of an orange in it, complete with a bunch of orange seeds to go along with the boba. Had a hell of a hard time getting the straw into the drink. The drink didn't taste good. I suspect they didn't wash the orange before dumping it into my drink. It had a chemical/dirt taste. Ya... not ordering that again.", "name": "Sharetea", "rating": 2}, {"index": 134, "review": "This is one of the two or three PMT places around school I can walk to. I prefer this one better since their tea actually tastes like tea and they have special flavors from time to time which I enjoy trying :)", "name": "Sharetea", "rating": 4}, {"index": 135, "review": "I am not a tea expert by any means, but I've only ever had great service and delicious drinks here! My favorite is the mango and passion fruit green tea. I get it with no sugar, light ice, and pearls. This is the perfect place to come for a cold drink on a hot summer day!", "name": "Sharetea", "rating": 5}, {"index": 136, "review": "One word: phenomenal! I can't get tired of this place - and that's coming from someone who traditionally was never a fan of boba. I come to this cute, small spot regularly now and would make ONE solid recommendation: the coffee crema. You won't be disappointed.", "name": "Sharetea", "rating": 5}, {"index": 137, "review": "This is my currently favorite tea spot. I've been a fan of share tea for a while now but this location is the best one I've been to drinks have always been on point and they have more a lot drinks on their menu then other locations I've been to. I've been trying  all their Creama's, I've tried the Oreo Creama, Grape tea Creama, Matcha Creama  and the strawberry Creama here all have been real good. I've also tried the pineapple green tea with aiyu jelly and the taro milk tea here both where also good. Every time I go to a tea place I always stick to what know and scared to try new drinks but that's not the case here ,I've been trying different stuff off the menu and been happy with what I've ordered. Parking is pretty easy to find here you can park in front or back and there is also a entrance in front and back. I will be back to this location and if you haven't tried their Creama teas I recommend you give it a try.", "name": "Sharetea", "rating": 5}, {"index": 138, "review": "This review is for the service which was very lacking. Came in to a totally empty place and saw a girl at the cashier with her back turned i.e. not even looking out for incoming customers. What was she doing? Yep on her phone. I stood there thinking she was looking up a recipe or something work related, then realized she was just chilling when she started talking to people in the back kitchen while still scrolling through her phone. Said \"excused me I'm ready to order\" and was promptly ignored. Then three girls came out and they all just stood there chatting and having a grand ole time. Said \"excused me\" twice and raised my voice before catching the attention of one of them. Girl took my order like I was interrupting their conversation with not even a smile or apology. \n\n\nPlease train your employees better so that they don't stand around chatting and ignoring basic etiquette. If you're working at the front then maybe put your phone away?! I have the lowest of standards when it comes to customer service but geez show a little professionalism. I shouldn't have to jump through hoops for ya'll to take my money. \n\n\nBtw I gave an extra star for the drink quality because they were good. Honey milk tea and wintermelon milk tea here are ok. Better than t4 and teaspoon.", "name": "Sharetea", "rating": 2}, {"index": 139, "review": "Good bubble tea but an incredibly long wait. I was there with a friend so the wait didn't bother me but I saw multiple people in line leave because it was taking so long. I got the bubble tea with honey and it was good but too sweet for my taste. I'll probably just get the milk tea if I go back. \n\nGood tea if you're willing to wait but this shop could definitely use some staffing changes to become a better shop.", "name": "Sharetea", "rating": 4}, {"index": 140, "review": "Oreo Milk Tea is delicious. I tend to like things sweet and creamy, but I got it 50% and it was still pretty sweet and delicious. I like it and Ill go back for sure", "name": "Sharetea", "rating": 5}, {"index": 141, "review": "You have no idea how salty I am that this place wasn't open when I was at SCU. I would've gone here everyday and been their best customer (in competition with some of my friends). \n\nI avoided the initial opening because it was going to be way too packed, and came a few weeks after. The place is nice! Neat and clean, situated next to some of my favorite restaurants in the area, the owner chose a great place to put the store (unlike a few other places I can think of off the top of my head). You can park in the Franklin Square lot across the street, and there's plenty of parking Everywhere else!\n\nI went during off hours and got my usual, passion fruit mango green tea with boba, half sweetness and less ice. The workers there were relatively new, typical of most Sharetea places when they first open, but they knew their stuff really well! Got my order perfectly and quickly. It tasted great! Sweet but not to the point where it overpowers the tea, and the boba was on point as well. \n\nThe place also offers wifi (that is pretty fast!) and a lot of sit down areas. Some of the chairs are ergonomically awkward, so you have to find one that is proportional to how you work. \n\nDefinitely coming back and staying for a while when I WFH (that's \"work from home\" to all you kids who don't work yet), very aware that my wallet is in danger of getting multiple drinks at my stay.", "name": "Sharetea", "rating": 5}, {"index": 142, "review": "I tried to order the almond milk tea with honey Boba but they were out of the almond milk tea so I ended up getting the honey milk tea with black tea and honey Boba. The honey Boba was really syrupy on the bottom of my cup, which is an automatic never going back for me. The honey milk tea was too sweet I thought, so in hindsight I should've reduced the sweetness but I'm not used to doing that at the good Boba places. My friend got the passion fruit tea with black tea and it was good, but nothing shocking.", "name": "Sharetea", "rating": 2}, {"index": 143, "review": "Tried this place out after wanting boba in Santa Clara when visiting my grandma. \n\nThis is a good location as its down the street from SCU. It's on a busy street but you can park on the side of the building where it's quieter. \n\nThe menu has many options. The prices are a little high. You can choose your level of sweetness and ice. They give a ton of pearls! And service is fast. They also sometimes have samples of some of the drinks which I think is cool. I haven't seen that at any other place. \n\nWill be returning!", "name": "Sharetea", "rating": 4}, {"index": 144, "review": "Good place for boba, like their mango green milk tea, but their drinks are on the pricey side. Parking can be a pain sometimes when the lot is full and street doesn't have much parking either.", "name": "Sharetea", "rating": 4}, {"index": 145, "review": "Another great addition to this area of Santa Clara--Sharetea is next door to Taplands, just down the street from SCU. I've been on a Mango Black Tea craze of late, so that's what I ordered. Mango Black Tea, Lychee Jelly (love that crunch), Extra Ice, & Lightly Sweetened. The sweetness levels they offer are 0%, 25%, 50%, 75%, and 100%, but I was THAT turd who wanted it somewhere between 0 and 25, and they gladly obliged (though they probably just did 25%). Drink was really delicious, came out quick even though a line was forming. I imagine this will be a popular place for students and other residents in the area--they have a bunch of board games, so that's a big plus.", "name": "Sharetea", "rating": 4}, {"index": 146, "review": "the hokkaido ice blend w/ ice cream and boba was on hit. it has a nice caramel flavor and with that boba (this spot cooks some of the best boba)... over. my new go to for that sweet tooth fix. 5/5", "name": "Sharetea", "rating": 5}, {"index": 147, "review": "The Matcha Grean Team Creama was delightful! Reminded of the tase of white chocolate. Yum.", "name": "Sharetea", "rating": 5}, {"index": 148, "review": "So nice to have a good boba place in the area. Loving the handmade taro with fresh milk. It's a slushie and it doesn't freeze the pearls so they are still chewy. Real taro pieces! The other teas are also delicious. \n\nThey are extremely patient even with a line out the door. All the cashiers I have met are super nice and there is ample room to sit and wait and even drink your tea there.", "name": "Sharetea", "rating": 5}, {"index": 149, "review": "Ordered our one drink and it took 20+ mins.... doesn't taste bad but you can find one of the many other milk teas in the area that doesn't take 25 mins for one milk tea", "name": "Sharetea", "rating": 2}, {"index": 150, "review": "This branch of Sharetea disappointed me. They have a different top 10 than other places I've seen. I've tried the classic pearl milk tea and the Okinawa pearl milk tea. Both tasted a little similar, and at half sweetness, they had just a slightly sweeter than average taste. Out of chain bubble tea places, Sharetea does have one of the better flavors of milk tea, and it tends to be milkier. I also ordered less ice on the drinks, but the ice given was a lot - it diluted the rest of the drink very quickly, so I would be extremely scared to see what a regular ice level was. The pearls in the drink weren't very chewy, and got hard within an hour of having it, which wasn't pleasant. A lot of the pearls were also clumped together or irregularly shaped, so the straw got clogged a few times. I probably had a bad experience here, but the other Shareteas I have been to have been better. There's also music playing on the louder side. On the plus side, there's currently a Yelp check-in for free pearls. If I was in the neighborhood I'd give them another try, but would definitely make sure to have just a bit less ice than \"less ice\".", "name": "Sharetea", "rating": 2}, {"index": 151, "review": "I go in here like twice a week because I love it so much. My favorite is the Oreo milk tea less ice, normal sweetness, normal sized pearls- it sounds weird but it's so good I drink it before I make it home. Nice service;very busy.", "name": "Sharetea", "rating": 5}, {"index": 152, "review": "FINALLY A SHARE TEA CLOSE BY MY HOUSE!! My favorite drink is the handmade taro with fresh milk. I also add light pearls and ice cream. So yummy!! I love how they have ice cream as one of the toppings. Interior is clean, they have a picture of a IG post on their wall so you can take cute pictures. Service is good too, employees are nice. \n+ They have FiveStars!!!", "name": "Sharetea", "rating": 5}, {"index": 153, "review": "our first trial here. \n\nwe ordered a mango passion fruit green tea with bobba. \n\nthe tea is good. the flavors are distinctive. \n\nthe bobbas are on the softer side. not bad at all. \n\npar with most tea places in town. \n\nwill come back and try different flavor drinks indeed.", "name": "Sharetea", "rating": 3}, {"index": 154, "review": "Good milk tea place in Santa Clara. Check in to get free topping :)", "name": "Sharetea", "rating": 5}, {"index": 155, "review": "Finally, good boba near the Santa Clara University campus!  Only a bit too late for me since I graduated.  But I'm so happy that this place popped up here, there aren't enough good boba spots in this area (like seriously there's a lack of them in this area).  I think the SCU campus will help keep this place alive, there really isn't a good option within walking distance, and I can see this place becoming very popular for that reason alone.  The boba here is great though, my personal fave is the mango green milk tea, it has actual mango puree in it.  I also really enjoy a lot of their fruit teas.  I really like that this boba place is in a nice quiet area, could really come here just to relax and grab some tea.  Also, plenty of parking in the back and nearby so no need to worry about that too!", "name": "Sharetea", "rating": 5}, {"index": 156, "review": "I've always thought that the closest GOOD boba places near me are in Cupertino or Downtown San Jose but my friend found Sharetea on Yelp. I've heard of it but I never tried it before. I got the peach black tea with lychee jelly with 30% sweetness. And, wow. I really think this is my top 3 boba places now. I hate syrupy-tasting, super sweet boba drink but this one was full of actual tea flavor AND even had some sort of peachy bits!! I can't wait to come back again!!", "name": "Sharetea", "rating": 5}, {"index": 157, "review": "This Sharetea never disappoints, their drinks and service are consistently amazing. My go to is either the coffee or fresh milk, both very sweet. They also give  lovely amount of boba or other toppings like coffee jelly. Wifi, Ac, and games are available too.", "name": "Sharetea", "rating": 5}, {"index": 158, "review": "One of my favorite Boba places in the Bay Area. Jonathan is very friendly. Everything is awesome. I like it.", "name": "Sharetea", "rating": 5}, {"index": 159, "review": "I'm so happy another Sharetea opened in the bay area! I have been going to Sharetea San Jose and it is SO good.  This location is just as good for me! Everytime I go, I get the matcha green tea creama which is SO good. It's my go to drink every time I go here.  This location is located in near Santa Clara University and located next to My Gym (for little kids).  It's less crowded than the other Sharetea.  Note- the Sharetea locations do not share the same five stars rewards card, so you will have another account for this location.", "name": "Sharetea", "rating": 5}, {"index": 160, "review": "sharetea is always delicious, but this time my oreo crema wasn't that great..i prefer the oreo crumb on top of the crema instead of being dumped inside the drink. I didn't feel like it has enough ice, but it was still good. Street parking, wasn't bad during work hours.", "name": "Sharetea", "rating": 4}, {"index": 161, "review": "Very nice staff.  Took real good care of me and got me just what I wanted and boy it was delicious!", "name": "Sharetea", "rating": 5}, {"index": 162, "review": "Would have given 5 stars for the milk tea drinks which are quite good and the staff who are always friendly and helpful. The  2 star reduction to 3 stars is for the recent price increase which pushes the milk tea to almost $5 a drink, which is really pushing it. I may not be the only customer feeling this way. On a recent weekend early afternoon visit to the normally bustling Santa Clara branch, there was no one in the store. NO ONE. I like the drinks and the staff, but unless the management is going to make adjustment to the pricing, I am likely to go elsewhere from now on.", "name": "Sharetea", "rating": 3}, {"index": 163, "review": "What the heck guys?!  I got here at 9:40pm, and got turned away becuz they close at 9:30?  Even though the sign on the door says \"Open\" and the hours sign said open til 10PM?  Also, I waited in line for a good 5 minutes before an employee came to tell me that the guy in front of me was the last person.  What the heck?  This is pretty crappy customer service if you ask me.  You guys need to learn how to take care of customers, instead of turning them away.  Needless to say, I won't be coming back, and will be sure to spread to the word.  \n\nPeace.", "name": "Sharetea", "rating": 1}, {"index": 164, "review": "Tried their fruit tea, not bad. Just try their Okinawa pearl tea taste like rag. Hope this is just some quality issue.", "name": "Sharetea", "rating": 2}, {"index": 165, "review": "I have been a boba lover for years. Sharetea sets the bar for delicious and fresh boba! i don't enjoy other boba places the way i used to after becoming a Sharetea customer. Sharetea is THAT much better! Almond milk tea and mountain green tea with mini pearls are my 2 fav drinks! enjoy! \n\none ask to Sharetea: please upgrade your sound system. the sound systems isn't pleasant for those us who spend more than a few mins in the store. thanks!", "name": "Sharetea", "rating": 5}, {"index": 166, "review": "Yet another Sharetea, yay! I've been to a lot of the Shareteas around the area (San Jose, Berkeley, SF, Union City), and this one has by far the best decorations and setup! There are 2 high-tables and 2 normal tables, each with 4 chairs. Each table has a fake plant on it too, which might not seem like much but really adds to the ambiance! There's also a shelf of games. I like this Sharetea. Parking on the street but there's plenty, and it's right near the university. Menu's the same as all the other Shareteas, and my grapefruit green tea was as good as the other ones I've had! Might be good if more tea less grapefruit, but maybe that's just how it is.", "name": "Sharetea", "rating": 5}, {"index": 167, "review": "A go to spot if your craving boba in Santa Clara.\n\nWalked in today around 3, the line wasn't bad. Was helped by a kind employee named Megan I believe, she was very patient in helping me choose a drink as I'm not a frequent boba drinker. She helped me decide on the mango passion fruit green tea which turned out perfect, not too sweet but very flavorful with the green tea. Would recommend.\n\nPlenty of seating and games in the back.", "name": "Sharetea", "rating": 5}, {"index": 168, "review": "The coffee milk tea is super yummy and the boba is really good. The mango passion fruit is also a good try! Definitely a must stop while shopping!", "name": "Sharetea", "rating": 5}, {"index": 169, "review": "Taste is not consistent. I always order the same sweetness, but sometimes it was too sweet, and another day it was bland! \nThe ladies waitress are friendly, but the guys are arrogant and super unfriendly!", "name": "Sharetea", "rating": 1}, {"index": 170, "review": "I just ordered the typical milk tea with boba incase , they cant really mess that one up right? It was good and boba was soft and chewy like it should be. I would be back nice staff clean place and quick service.", "name": "Sharetea", "rating": 4}, {"index": 171, "review": "this place is alright. it would be really amazing if they stick to whatever recipes they have set. BE VERY CAUTIOUS--the drinks can be quite sweet depending who makes them, i guess. i've come here a few times in the past week alone and ordered the same drink in different levels of sweetness and yet they all tasted the same each time. which, as a new customer, concerns me. there was also an instance where they had to redo my drink twice because between all the chatter the two milktea makers were doing, they forgot what drink i had and what was in the cup the one they just handed me. SAD. they redid it again but forgot to pour the ice out from the shaker because she was so distracted from talking to her co-worker.\n\ni havent come back since. there's a lot more milktea places where i can go to, like i-tea in milpitas. it could be busy, but they're always spot-on!", "name": "Sharetea", "rating": 2}, {"index": 172, "review": "Good boba place, especially in Santa Clara. Close to SCU and Buchser Middle School, great place to hangout with friends since they have board games, which I thought was a nice touch. Not a huge fan of their Taro Milk Tea but the rest of their drinks are decent", "name": "Sharetea", "rating": 4}, {"index": 173, "review": "My girlfriend and I were craving boba in the area and found this Sharetea open up. There was one person in front of us before we put in our order and we expected to get our drinks super fast. Turns out, they put our receipt in the later on their que, because 3 people got their drinks ahead of us. \n\nWe complained about it with the guy at the register, showing them our time stamp and everything but he did nothing because of the huge rush of costumes. We then talked to the manager, and they compensated a drink, which we appreciate!\n\nWhat upset us was one of the workers was trying to justify why our drinks were late and didn't want to own up to their own mistakes. She was justifying it with coworkers while we were talking to he manager, which makes the situation very awkward.\n\nI love the Sharetea franchise! I'll usually always come to them for boba, but this one experience left bad vibes.", "name": "Sharetea", "rating": 2}, {"index": 174, "review": "A bunch of coworkers and I went to check it out during the soft opening. All our drinks were super tasty. They let you adjust the sweetness so don't worry if you don't like super sweet drinks! I want to try a hot milk next time :)\nThey also have some board games and wifi so you can sit and hang out.", "name": "Sharetea", "rating": 5}, {"index": 175, "review": "Ordered the grapefruit green tea and it's pretty bitter even with 100% normal sweetness level and it's slightly watered down and I got 30% ice level. I'm a bit disappointed because I order this same drink at 85° all the time and they make it so much better. I could taste the sweetness at 85°, I prefer that place over this Sharetea for grapefruit green tea. Next time I come to Sharetea, I think I'll just stick with their hot milktea.", "name": "Sharetea", "rating": 3}, {"index": 176, "review": "First time going here as a visitor to SF and the staff didn't bother greeting us when we came in, we had to greet them first (wth haha). Ordered a oreo milk tea and hokkaido milk tea with pudding. The oreo milk tea wasn't all that, it was basically just milk tea with crushed oreo pieces in it, and they got my hokkaido milk tea order wrong and still added pearls when I clearly said to replace the pearls with pudding. Overall giving this place a 3/5 stars because the decor, look of the place, and cup designs are cute, and my friends pineapple drink tasted good over our orders. SD boba shops definitely take the win over this tea joint.", "name": "Sharetea", "rating": 3}, {"index": 177, "review": "We were coming all the way from Newark for the buy 1 get one free. We arrive at 9:45, and they said they closed at 9:30pm. WT.......\nThey said oh whatever yelp said we close at 9:30pm.", "name": "Sharetea", "rating": 1}, {"index": 178, "review": "Tried taro tea for the first time ever yesterday and had to come back for it again! I tried the mango green tea on my first visit here and might have enjoyed it a bit more without the pulp at the bottom of the cup. My taro tea was enough to make for it so I'll be back! I might be here daily if they had Thai tea on the menu, but the taro might call for a weekly visit. \n\nService is a little bit slow, but the workers are very friendly and there is good music to enjoy while you wait!", "name": "Sharetea", "rating": 4}, {"index": 179, "review": "I'm so happy to have a good boba place near my work. \n\nPlace is always clean.\n\nVery efficient.\n\nCashiers are friendly.\n\nI wish they would reduce the Five Star drinks to 10 points instead of 12 points :)", "name": "Sharetea", "rating": 5}, {"index": 180, "review": "Great place and open at decent times. Lots of students here. The tea is good. The only thing I can complain about is the parking...", "name": "Sharetea", "rating": 4}, {"index": 181, "review": "The Boba there was pretty good, but for me I feel like most boba places have about the same quality because I've refined my order down pretty specifically so its hard to mess up.\n\nIt looked like they had a lot of games but I didn't really have a chance to look at them because we had brought a bunch of our own games to play with. \n\nThey seemed really backed up when we got there even though we were there before the crowd. \nWe stayed there for 2+ hours all the way through the busy hours and we never felt pressured to leave.\n\nTLDR: Boba was good, service was good.", "name": "Sharetea", "rating": 5}, {"index": 182, "review": "Finally one in santa clara area. Sharetea has been my favorite over other tea joints so far. They have very good drinks, very consistent. This location is very easy to find parkings. Friendly staffs.  What more can you ask for? \n\nOther than the regular boba teas, I recomend their passion fruit, orange& grapefruit tea with plum. Must try!!\n\n I was told they will have buy one get one free promotion 4/2/16 on their grand openning!! Definitely will stop by again next week.", "name": "Sharetea", "rating": 5}, {"index": 183, "review": "Typically I have the Thai Milk tea with boba (at other places), but in this case I had the Honey milk tea (with black tea) and it was excellent. One of the tastiest I've had. Great stuff!", "name": "Sharetea", "rating": 5}, {"index": 184, "review": "Sharetea has my love. They nail everything from super simple milk teas to cool, complex and unique drinks. I usually go with a honey green milk tea with pearls and pudding when I'm in a rush. But if I'm really treating myself, I'll go with a strawberry ice blended with ice cream, lychee jelly, and pearls. Soooo good!", "name": "Sharetea", "rating": 5}, {"index": 185, "review": "Delicious, fast service, nice seating area.  Some tea places take a long time to make the drinks, this place cranked it out fast.  We ordered the creama which was a slightly salty foam, never had it before, and it was great!", "name": "Sharetea", "rating": 5}, {"index": 186, "review": "Awesome awesome milk tea options and flavors. They're super consistent -- I've been here numerous times and their tea tastes the same and excellent always. Taro Milk Tea (black tea), less ice, no sugar, and lychee jelly is their absolute best -- highly recommend (no reason to go to any other milk tea place)!!", "name": "Sharetea", "rating": 5}, {"index": 187, "review": "My wife was insistent on trying this place out. The drinks overall were good, not worth a trek into that side of town. Probably would have gave this place more stars but service here is just whatevs. My wife misplaced my card and I called this store to ask if they saw my card. After about 3 attempts I get some guy who sounds flustered I called that many times. What's the point in having a business phone if no one picks it up? Guy says he'll look for it and give me a call back. Still haven't heard anything even after sending a text and voicemail the following day. So suffice to say the service at this place falls short, even for a simple request. I'd hate to see how they operate under busier circumstances.", "name": "Sharetea", "rating": 1}, {"index": 188, "review": "This is worst Sharetea flavor location.  San Mateo and San Jose are good to go places.  Quality was like watery tea with lots ice.  Staffs were nice and friendly.  We next time will just go for San Mateo or San Jose when we want Sharetea.", "name": "Sharetea", "rating": 2}, {"index": 189, "review": "Over a 45 minute wait during the grand opening. Large selection of drinks and you can select your sweetness level too. You can enjoy some TV and board games while you wait. I'm sure the ones and wait times will get better once the hype dies down.", "name": "Sharetea", "rating": 4}, {"index": 190, "review": "Grabbed a good seat and enjoyed my drink here on a Saturday night! Love the vibes and everything. Especially the color of the furniture. \n\nI ordered a peach green tea creama and asked for\n80% less sweet. It was just about right and I would definitely come by again if I'm in this area. \n\nIsn't hard to find parking and they have many board games available! Great place to chill with friends :) thumbs up!", "name": "Sharetea", "rating": 5}, {"index": 191, "review": "I've always wanted to try sharetea, so it was great I was finally in the area and needed time to kill. The cashier was so helpful and gave me a great recommendation of a drink choice which was the matcha green tea crema with boba. Also don't forget to check-in to redeem free large/small pearls for your drink! The boba was perfectly cooked, it was the perfect consistency-- soft, but not to the point of squishyness, yer firm but not to the point where it takes you 10,000 years to gnaw on your boba. So yay for sharetea!!!", "name": "Sharetea", "rating": 4}, {"index": 192, "review": "Great, consistence teas. Both the drinks and toppings are on point and always consistent. The staff is very friendly and helpful too. Highly recommended", "name": "Sharetea", "rating": 5}, {"index": 193, "review": "Came here on this hot Tuesday afternoon!  Milk tea is so good on days like this!  When I got here, there was not a single person in line and no one sitting inside.  I almost thought they were closed when I was walking towards it.  I got the classic black milk tea with large pearls 80% less sweet!  I suggest you check in before you order for free pearls!!  Drinks came out fairly quick but I do feel that the drinks here are a little pricier than other places.  I will be back if I'm in the area though just because it's conveniently located next to Toppings!", "name": "Sharetea", "rating": 4}, {"index": 194, "review": "Never again will I go to any of their locations! I went on Monday to get my drink and I reached my points to get a free drink. I payed full price for my drink, thinking \"ok cool next one is free\". I go in today and order my drink and they say I owe full price. I told the lady that I reached my free drink on Monday and this one should br free... Guess what? Not free! I asked why I was paying full price she said I only had 2 points I needed more until my free drink. I told her that I was there Monday and paid full price I should have the free drink now. I spoke with the Manager and she said the same thing I only have 2 points. She then asked if I had gone to another location, if so they dont transfer, like Jamba Juice for example can be used at any location, and I would have to redeem at that location. It was very disapointing and I told the Manager that I will no longer be going to this, or any other, of their location. I will take my business to any other boba tea establishment.", "name": "Sharetea", "rating": 1}, {"index": 195, "review": "Definitely my favorite tea/boba spot!  Peach Passion Fruit Green Tea is amaziiinngg!  And all the free samples is nice too or I would of never of known about certain tea flavors..very good for business!  Met the owner along time ago when his first shop opened in San Mateo..happy his company is doing good and making good tea still.", "name": "Sharetea", "rating": 5}, {"index": 196, "review": "Numerous choices to choose friend. Friendly staff and quick service. Their milk teas are vegan friend (dairy-free)! I go here quite often. Pretty good boba.", "name": "Sharetea", "rating": 4}, {"index": 197, "review": "For being first time customers, I wasn't all that impressed.  We ordered a hot tea and ice blended coffee with ice cream.  No other customers inside, yet it took 3 workers 10 minutes to make the orders.  Got our drinks and as I walked out, the hot tea spilled all over my hand (hot tea, not cold).  Come to find out, they didn't even put the cover on completely .  Walked back in, the one Asian guy was sympathetic, yet it took him a few minutes to hangs cups and put a new lid on. Eh!!  Is how I felt after I left.", "name": "Sharetea", "rating": 2}, {"index": 198, "review": "This is my third time to buy my drinks here, my 1st and 2nd experience here is awesome, staff are very friendly. They greeted us as soon as we entered the store. Today 4.8.16 1:20pm, they are fully staff busy making drinks with 1 costumer. I walked in and never greeted and I was standing in front of the registered, the skinny guy looked at me and never greeted and 2 girls was busy making drinks. 3 minutes after the girl greeted me \"hello, welcome to Sharetea\" (2 girls look it each other and then laugh) and the guy said \"I'll be right with you\" then the guy from the back walked in all the way there just to assist me and take my order. I'll give him a 5.", "name": "Sharetea", "rating": 2}, {"index": 199, "review": "Nothing wrong with the tea. Nothing wrong with the staff. Nothing wrong with the building. MAJOR issue with their food cleanliness/hygiene. \n\nNow I could be wrong on hygiene standards. BUT. I saw them drop a shaker cap on the floor, and instead of grabbing a new clean cap, they gave it a half second water rinse before using it as a shakes and then a funnel for a customer's drink. \n\nI went up to the employee and politely asked about it, and both employees that heard me ask about it said that is what they always do.\n\nI understand an easy rinse between making orders. But that is food to food. Not food to dirt and grime. \n\nSo yeah. If you're ok with some potential grime in your drink, go for it. Good flavor, nice staff.", "name": "Sharetea", "rating": 1}, {"index": 200, "review": "First time visit based on the Yelp search. They have a friendly staff and the drinks are very good with generous portions. I recommend the mango black tea with pearls and aloe.", "name": "Sharetea", "rating": 5}, {"index": 201, "review": "This haretea is larger than the other few locations ive been to. Lots of seating. Great atmosphere and delicious, fresh boba! The mango green tea is delicious!!!", "name": "Sharetea", "rating": 5}, {"index": 202, "review": "Coming from Taiwan myself, there's nothing I'm more picky with than bubble tea. This Sharetea location definitely does it right. Not only are the drinks good, the ambiance is welcoming, and the servers are extremely friendly. It is such a great addition to the neighborhood. I'll be back again soon for sure!", "name": "Sharetea", "rating": 5}, {"index": 203, "review": "honey lemon with aloe and classic milk oolong tea with pearls and lychee jellies with 30% sweetness are yummy drinks.  friendly atmosphere, lots to choose from and pretty generous with toppings - hope it stays this way!  will be a regular here for sure", "name": "Sharetea", "rating": 4}, {"index": 204, "review": "They have a great selection!!! I love the Peach Black Tea and the Mango Black Tea.  Easy to understand the tea options which makes it comfortable to order. Sign up with 5 stars and get a free tea after every 10!!  Staff is friendly and knowledgeable.  Easy to get in and get out with street parking.", "name": "Sharetea", "rating": 5}, {"index": 205, "review": "Neat and clean. Friendly  staff:-).  I had them make my drink with less sugar and ot still tasted great!", "name": "Sharetea", "rating": 5}, {"index": 206, "review": "Tea was yummy!!! However, when we walked in the store they were playing loud music which was inappropriate.", "name": "Sharetea", "rating": 2}, {"index": 207, "review": "amazing! as good as a boba critic would expect it to be. the pearls are soooo good. the 8 min drive from home and $4 was worth it! i got their honey green tea with pearls. it was surprisingly not too sweet :)\n\nupdate:\ni love this place! ever since i first tried it, i've been going almost every week! but, the cup was a little sticky today because i got honey green tea, which i believe is a small issue. still worth 5 stars to me, though!", "name": "Sharetea", "rating": 5}, {"index": 208, "review": "Love this tea place!   People working here are nice and always friendly!   Bobas are soft and chewy all the time!", "name": "Sharetea", "rating": 5}, {"index": 209, "review": "The boba milk tea itself is good.. but they were INCREDIBLY slow. It took about 20 minutes for my milk tea to be made, and I came at about 8:00pm on a Monday night. I'm not sure what was wrong or if this is normal pace for them, but this was a little ridiculous...", "name": "Sharetea", "rating": 3}, {"index": 210, "review": "okayyyyy not gonna lie low key bitter that someone executed this idea of opening a boba shop near SCU because I totally had this idea first when I went there humph! But seriously, I think Sharetea is now my favorite boba place of all time and that says a lot coming from me aka self-proclaimed boba queen. But yes I go between ordering Mango/Peach/Matcha with XXXTRA CREMA cause i love salty and creamy stuff in mouth. SOOOO GOOODD!!!", "name": "Sharetea", "rating": 5}, {"index": 211, "review": "My husband and I like Sharetea and are big fans of their mango and peach green tea creamas. However, there is this one employee that never fails to mess our drinks up. I mean, it's a running joke now. I do not exaggerate by saying...every, single, time. She'll either forget to put in toppings, or forget to not put in ice, or make the drinks hot when we want them cold, or hand us a drink with overflowing creama spilling out all over the cup without cleaning it up. Thankfully the drinks turn out okay, but perhaps management should offer more training.", "name": "Sharetea", "rating": 3}, {"index": 212, "review": "Good quality boba, and the size is pretty big. The price is slightly above average but they had LOADS of options. I got the Hokkaido milk tea with boba and it was sao guuud", "name": "Sharetea", "rating": 4}, {"index": 213, "review": "I've been trying many many boba places around San Jose and I must say, this one is by far my favorite! The creama green tea is the BOMB. Totally going to be a regular here.", "name": "Sharetea", "rating": 5}, {"index": 214, "review": "This is a great tea and boba place.  They had a bit of a rough start, with getting orders right, but now they have everything under control.  The tea is great and made to order.  You can specify the level of sweetness and they do their best to accommodate special orders.\n\nTheir system is pretty good too.  It is super clan and the staff is friendly.  I would definitely recommend this place.", "name": "Sharetea", "rating": 4}, {"index": 215, "review": "The tea here is pretty good and the store itself seems really clean and simple. The only thing that made me a bit disappointed was that at this location, they don't have the blended milk tea. The workers here are really sweet and this is one of the few locations where Ice cream tastes good with their tea!", "name": "Sharetea", "rating": 4}, {"index": 216, "review": "I went here at around 5:30 PM on a Thursday. It was a bit packed so it took a while to get our orders. There's a lot to choose from from their menu. I got the Hokkaido pearl milk tea which tasted decent, nothing really special. However, this is a nice place to hang out with friends as they have a myriad of board games. We stayed here for over an hour playing Uno. The place is conveniently located and clean, and staff is friendly.", "name": "Sharetea", "rating": 4}, {"index": 217, "review": "ShareTea!! Finally a good boba place close to Santa Clara University. I got my usual Mango Green Tea with Crema (how I always get it in ShareTea SM) and they did a pretty good job making it delish! Great service! (I believe I was helped by a super friendly employee named Megan!) and all their board games were brand new when I went today, so pretty chill place to hang out. Maybe a sofa would be cool?? So people can have a centralperk kind of setup hahah", "name": "Sharetea", "rating": 5}, {"index": 218, "review": "We came today during their soft opening to get some drinks. We loved the drinks! Plus they used fresh fruit ingredients! We ordered the Okinawa, taro, mango & passion fruit green tea, and mango drinks, which were all delicious! We will definitely be back! I noticed they have board games so this will be a cool spot to come a chill with company!", "name": "Sharetea", "rating": 5}, {"index": 219, "review": "Nice place , nice service . They got everything from boba tea to interesting drink. I had a boba tea with ice cream . Come out pretty good. Check it out", "name": "Sharetea", "rating": 4}, {"index": 220, "review": "While the drinks are ok (for the most part), their customer service in regards to Five Star system at this location is non-existent.\n \nFor those familiar with Five Star thing: ShareTea does not always award visit points (maybe a system glitch, but it's not a customer's problem), and any attempt to get those points back is met with complete ignorance or just \"we do not know\". Got a free topping reward through Five Star - came to the store, the system is \"conveniently\" down, and no, they can not honor the reward, even though it expires tomorrow. Tried to get in touch via phone - mailbox is full,  friend messaged them on FB  - no reply. Way to care about your customers, ShareTea.", "name": "Sharetea", "rating": 3}, {"index": 221, "review": "Very friendly staff, and tea selections are pretty good. It's a little disappointing that they don't have Thai Tea or snacks. I mean, I guess we're too spoiled by  all the other competitions in the area, that this is a big minus for them. They are slow too, but because they're cute and nice, it's bearable sometimes. I've been here literally every day since they opened, and although they need to improve so much more, I'll still come to support.", "name": "Sharetea", "rating": 4}, {"index": 222, "review": "I love this boba place! I used to only be able to go to the one in Berkeley so I'm happy they opened a new one more close by. The strawberry lychee jelly smoothie is so good!", "name": "Sharetea", "rating": 5}, {"index": 223, "review": "Went to the soft opening, the atomsphere is filled with tea scent. The store is very clean and staffs are very friendly. Ordered the okinawa pearl milktea and mango green tea creama, it was so good. All their drinks are made fresh, must try the rest of the menu.", "name": "Sharetea", "rating": 5}, {"index": 224, "review": "I went at 8pm and outside the sign said open. And walked in and they said its closed for private event. Then why have sign saying open if you're not actually open for business?? 1 star for no service. Not coming here again as there are tons of boba places that are actually open.", "name": "Sharetea", "rating": 1}, {"index": 225, "review": "I love Sharetea. The boba here is cooked perfectly! Not too squishy, just a little firm in the center. I got the taro milk tea with boba. I've had some taro that was too chunky, but they blend it all here so it was DELICIOUS and I didn't have to chew anything. I'll be back here fo'sho.", "name": "Sharetea", "rating": 5}, {"index": 226, "review": "FINALLY! A bona fide boba place in Santa Clara! I go to Cupertino practically everyday to get my tea fix for jasmine or oolong milk tea. I like fresh milk tea that is brewed fresh on the premises, not pre-made or powdered teas. This place fits the bill. The drinks are a little on the sweeter side, but you can customize sweetness (which I'll do next time). I'm giving only 4 out 5 stars, because while they brew the teas fresh, they do so in larger batches, not individually when you order it.", "name": "Sharetea", "rating": 4}, {"index": 227, "review": "I go here once a week with my sister or my friends. And because this place is super close to the house, I recommend it to customer who hasn't had boba before. \n\nNormally when I come here, I get the Okinawa milk tea with pudding and less ice. My sister normally gets the green milk tea with big pearls. And I recently switched it up to the mango green milk tea. The employees here are patient and nice. They give the most honest opinions, if you ask them for there opinions on the drink. There drinks are really good and I would definitely recommend it to customers who are unfamiliar with these kind of drinks.", "name": "Sharetea", "rating": 5}, {"index": 228, "review": "i have visited a number of times now and will surely be returning many more! it opened not too long ago (i think?) and the employees are very kind and even remember what i order :o they are also open late which is a plus and have fivestar rewards which is excellent! i'll be back many times, thank you for the good bubble tea! btw wintermelon w fresh milk plus pearls is wowwow. and mango iced w ice cream and egg pudding even more wowoow. can't wait to be back!", "name": "Sharetea", "rating": 5}, {"index": 229, "review": "9:30pm closed!! BS !!We drive 30mins and arrived before store closed !!we will not come again !!!", "name": "Sharetea", "rating": 1}, {"index": 230, "review": "Nice place! Clean and friendly. Always a long line. Expect to wait for more than 15 mins. But it's worth to wait, tea is sooooooooooo fresh!", "name": "Sharetea", "rating": 5}, {"index": 231, "review": "Excellent customer service! Friendly and helpful! They give out samples too! Paid my first visit yesterday and had to come back again today for the best taro milk tea! So creamy! Definitely coming back!", "name": "Sharetea", "rating": 5}, {"index": 232, "review": "Everything taste great and fresh.  Great custumer service. I read some of the good reviews and they wrre true.", "name": "Sharetea", "rating": 5}, {"index": 233, "review": "Finally there is one near where I work!! I went to the soft opening during lunch time and got my favorite drink. KIWI ICE JELLY. so good. Hurry up and take advantage of the soft opening discount they are offering!!", "name": "Sharetea", "rating": 5}, {"index": 234, "review": "service slow, we ordered 5 drinks and the waiting time is 25mins which they already have 3 people to work, I got my hot tea but it all seep out, for the cup cover not tight enough.", "name": "Sharetea", "rating": 1}]