[{"index": 0, "review": "Came here for Dinner with a large group (around 30) and overall was impressed with the service and the food.  This was a corporate gathering and there was a fixed menu which was mainly salads, garlic bread and various pizzas.  \n\nWe took over a small section of the restaurant with 2 very long tables in parallel.  Once we were seated the staff quickly took drink orders and before we knew it, drinks and food started coming out.  \n\nFirst came the drinks and garlic bread, followed by the salads.  Salad was pretty standard and they had bleu cheese and balsalmic dressings.  I had a little of both, the balasamic was the winner.  The bleu cheese was somewhat flavorless.  \n\nAs we were munching, they started prepping for the pizzas to come  and soon enough they were bringing them out of the kitchen and putting them on elevated stands on the table.  There was a mix of cheese, margherita, veggie and others with meats.  I enjoyed the margherita and the cheese, they both had a lot of flavor.  Im not a big pizza guy, but this was some darn good pizza.  \n\nIn conclusion,  this restaurant really took care of us and we didnt have any issues.  The food we had was really good.  I hope one day I can come back and try other food from the menu.  The menu looked quite extensive and there was a lot of dishes I wanted to try.  If you are looking for good Italian food, I would check this place out.  Solid 4 stars, could be a 5.", "name": "Fiorillo's", "rating": 4}, {"index": 1, "review": "I don't normally write reviews, but my recent experience was beyond bad.  \n\nAwful service!  Do not even think about showing up later in the evening because you will experience the worst treatment.  They need to completely clean house, but make sure you do not have Gina serving you.  Choose anywhere else to eat.  You do not want to go to Fiorillo's.  Spend your money at a better establishment, where their service earns it.", "name": "Fiorillo's", "rating": 1}, {"index": 2, "review": "I've been coming here for 10 plus years and until recently would recommend it. But after my better half 50th birthday dinner on feb 3rd there I would say steer clear. \nLong story short party of 25 told side salads were included with meals. Bill comes with an additional 130 on it for side salads that some people didn't order or want.\nThe manager flat out refused to comp any we had agreed previous to a 30 dollar discount (of a 130 charge we weren't expecting) .\nHorrible customer service there now will never return or recommend. Food is average at best.", "name": "Fiorillo's", "rating": 1}, {"index": 3, "review": "My wallet wasn't very pleased today. It'd be a lot easier to downrate this if the food wasn't so satisfying.\n\nFiorillo's is an old family-owned-and-run Italian establishment in a somewhat out-of-the-way location not far from the airport boundary. They offer a banquet hall and have a bar area, but the large dining room is where most people flock to. My friend suggested this place after I pleaded indecision / willingness to try something new for the umpteenth time, so we stopped in for a weekday lunch.\n\nThe dining room was surprisingly busy, as noted by our server (one of the younger generation of the family), but it didn't seem to take too long to order or to receive the food. There was also a short delay for my Ballast Point Sculpin IPA ($8.50 for 16 oz draft), reportedly because the keg was old and had to be replaced with a new one. I've been on a beer kick motivated by west coast IPAs and the Sculpin is a prototypical example, with citrusy hops providing an expectedly enticing aroma. It's not very bitter unless you're taking large gulps. You could do a lot worse than the Sculpin.\n\nI thought that I might enjoy something on the heavier side and decided to go with one of my server's recommendations, the Guilianna's Pan-Seared Mahi Mahi ($26.95). He stated that it was a customer-favorite special which has been elevated to full-time menu status, and I can see why. The fish isn't dry, the red Bordelaise sauce is almost addictive (sweet but not too sweet), and the scallops, prawns, and mushrooms were all cooked properly and added to the medley of flavors and textures. The rice pilaf was also fun and the vegetables were fresh enough. The portion size overall is reasonable, not huge or small.\n\nThe complimentary bread w/ butter wasn't anything to write home about, but it helped to clear my palate between sips of beer. I also tasted my friend's Crab Bordelaise ($21.95), which had simple and fresh crab meat, more of a white Bordelaise sauce, and huge amounts of fettuccine. I definitely would've landed in a food coma if I'd had this.\n\nFiorillo's is a delicious if somewhat pricey restaurant, so I'm highly unlikely to go unless I'm invited. That said, they seem to offer solid, upscale Italian if that's what you're in the mood for, and they handle large groups and small tables alike.", "name": "Fiorillo's", "rating": 4}, {"index": 4, "review": "I went to this place with my office colleagues for lunch on a weekday.\nAs soon as you enter this place you get this feeling of entering at a traditional Italian fine dining restaurant.\nThis place is huge and seating can be pretty comfortable on weekdays for lunch.\n\nThe decor looks old and traditional while the ambience is definitely classy to grab a dinner with your date. \nHowever, I think that this place is more popular among corporate groups and family get togethers.\n\nWe ordered the following:\n1) Bruschetta:\nTraditional Italian appetizer with small bits of onions, tomatoes, cheese and red chili flakes spread on the top of a roasted bread. \nTaste was good and was served hot.\n\n2) Deep Fried Italian Cheese Ravioli:\nRegular cheese ravioli fused with marinara sauce.\nThis dish was average in taste.\n\n3) Penne Pasta Special:\nA vegetarian pasta with Marinara sauce as the base.\nIt is Penne style pasta that comes with cheese, broccoli, onions, red chili flakes, pasta cream, pasta sauce, tomatoes etc.\nIt is served hot and is good to taste.\n\nThe best thing about this place is that all the servings come with ample quantity and hence a single serving of Pasta can easily fill two of three up to the neck.\n\nFreshly brewed flavored Ice Tea is a must try as they are brewed on the fly and then fused with ice on the top to make it cooler.\n\nThe staff is friendly but the food takes some decent time to be prepared and served to you.\n\n Overall you can go to this place for a decent lunch or dinner with your friends, date or family.", "name": "Fiorillo's", "rating": 3}, {"index": 5, "review": "I cheated..\n\nWhat can I say, it's hard to resist temptation when it's right in front of you, am I right? \n\nAll jokes aside, Fiorillo's was a pleasant surprise to me. I was on a healthy streak for a good few days and my colleagues forcibly(not really) made me come here for a working lunch. \n\nI ordered the pasta Milanese and it was FABULOUS. It was incredibly savory and just the right amount of pasta to sauce ratio. The portion were huge for the price and I actually ended up eating it for 2 more meals afterwards. Next time I might just ask for less cheese though.. cause girl, that cheese kept getting stuck and I was forked. ++ points for knowing they use real cheese!\n\nMy only criticisms would be that the interior is straight out of a godfather movie with interior dating back to the early-mid 20th century. Service was also spotty, their servers didn't seem like they knew what they were doing. Thank goodness for the boss lady who has eyes of a hawk and came by every time she saw our party looking around.\n\nDefinitely coming back to try the veal, heard some good things about that too ;)", "name": "Fiorillo's", "rating": 4}, {"index": 6, "review": "My go to Italian restaurant. I looked for years trying to find a place that reminded me of my family's cooking from Italy and I just couldn't find the place that could replicate how my grandfather and his mother cooked, until I found Fiorillo's. Highly recommend.\n   The workers are great and I'm always greeted with a smile, the place is surprisingly big and can always find a table for your family. Parking is reasonable and I hardly have trouble finding a spot unless they are hosting an event, overall five stars!! I have not one bad thing to say about the joint", "name": "Fiorillo's", "rating": 5}, {"index": 7, "review": "My son and I started dining at Fiorillo's in 2008 when I lived in the area - we came here at least once a month for dinner from 2008-2013. Not sure why I haven't written a long-overdue review of this gem!\n\nTonight one of my coworkers and friends and her husband took my son and me to dinner at Fiorillo's. It was their first time and from their comments about the venue, food, ambiance and great service, I'm sure this will not be the last.\n\nWe all arrived separately around 6 pm and were immediately seated. Our great server, Nick, gave outstanding service in every aspect, and so did the man (didn't get his name) who removed our plates after each course and made sure our water and beverages were replenished. Attention to details like water and beverages indicates to me that Fiorillo's employees care about their diners.\n\nMy coworker asked Nick's advice about what to order between several entrees she was considering, took his advice and was glad she did. She had the chicken saltimbucco, her husband the ravioli toscano, my son had the fettuccine alfredo, and I had my favorite crab in pesto linguine. Everything was delicious and in huge portions - three of us took home parts of our dinners. We also enjoyed the fantastic seeded bread that is a trademark of Fiorillo's.\n\nWhen it was time for dessert, three of us took a look at the menu - my coworker ordered the capuccino tartufo, her husband had the very decadent chocolate cake, and I had an amazing gelato (capuccino chip) (my son is not a dessert guy). \n\nThanks again, Nick and everyone who made this a dinner to remember!\n\nP.S. In addition to their very large dining room and separate intimate full bar, they also have a huge venue space where weddings and large group events are held. Fiorillo's is very close to Santa Clara University so I'm sure many students, faculty and parents have experienced Fiorillo's .", "name": "Fiorillo's", "rating": 5}, {"index": 8, "review": "Been coming her for 25 years, this use to be my mothers favorite restaurant, we came on her 50th birthday with 25 people, we had members of our party ask if the salads were included in the meal or a separate charge, the waiter told them that it was included, at the end of the dinner we get charged $130 just for salads with several of them being wasted because people thought they had to order them since it was included they thought. first the lady says she was going to comp the salads for the people she confused which was about 6, then the manager who was extremely rude by the way, says no we are comping nothing it was explained over the phone, which it wasn't clear and regardless the waiter told them differently. \n\nThat was just the main issue, multiple peoples utensils had food or something on them, glasses were dirty, no one complained because a lot of people spent money at the bar on alcohol anyway so a soda didn't really matter. The people who did get drinks never got refills they only ever refilled water on the table, and didn't do it that often. The menu for this was condensed for our large party, and only 5 meals were offered which we were allowed to choose, the portions of these meals were piss poor and were much smaller then normal menu items you order here \"been coming here for years usually get a lot more food for the price\" but we still paid the normal 22ish prices per plate for these child size portions.\n\nI use to believe Fiorillo's was a respectable establishment that made the City of Santa Clara proud, but this is no longer the case, i have been treated far better at the local Denny's then we were tonight. \n\nThe only good thing about this night was the company, and the male waiter who was serving us he was very nice and did his best to serve 25 people with only 2 servers. \n\nI would recommend steer clear of here, they are not what they use to be thankfully the area has plenty of Good Restaurants to choose instead.", "name": "Fiorillo's", "rating": 1}, {"index": 9, "review": "I know 30 people that will never return to Fiorillo's.\n\nMy wife and I just returned from a birthday dinner from Fiorillo's.  They had a separate menu prepared due to the size of the party and we were all good with the menu.  Salads were included on the menu and when the waitress was asked to confirm if the salads were included with the meal, she confirmed with a \"Yes, the salads are included\".  So what's the first question from the waitress?  \"Would you like a house salad or Caesar salad?\"  and on we go ordering our dinner.  The bill comes and SURPRISE the salads were separate.  The situation was communicated to the \"Fiorillo\" owner and he said he would do nothing about it and claimed that's been their policy despite what the waitress communicated to our party.  \n\nNow, mind you... This is a group of 30 people from Santa Clara.  We are Santa Clara residences with the majority growning up SC.  We love to support our local businesses and this is one I will not only never return to, but will share my story with as many people as I possibly can.  \n\nIf this situation would have happened in a \"real\" restaurant,  I'm sure we would have come to a satisfactory solution.  We were more than happy to work with them to meet halfway, but I guess Mr. Owner isn't too forward thinking.\n\nBy the way, the food sucked so we aren't missing much.\n\nSincerely,\nDisappointed Santa Clara resident.", "name": "Fiorillo's", "rating": 1}, {"index": 10, "review": "So I came here for the first time tonight with some family and family friends for dinner. This place was easy to find. From the outside it looks fancy and modern but walking inside not so much. Walking in from the entrance to the left is a banquet hall and restrooms, directly from the entrance was a bar and to the right is the dining area. The seating and tables seem outdated but it's nicely set up. The ten of us got seated and our waitress was very nice but I'm not sure how to word it. How she talked to us was I felt like she was talking to a 1st grade class. It's sorta weird to me. Overall she was nice and attentive. \n\nBefore coming here I glanced on Yelp to see the ratings and it wasn't so dandy. I wanted to try it for myself. The menu is huge! We ordered 3 appetizers to share we had the mozzarella sticks which was over cooked. We had the fried calamari which was tasty and then we had a tomato and cheese which was decent. For a \"fancy\" looking restaurant plating was not on point.  I had ordered steam clams with baby clams with linguine topped with white sauce that extremely watery as if it's just sitting in oil. The clams were good but the whole dish itself was bland it was definitely missing something. After that we had dessert and I ordered a tiramisu that was extremely creamy it wasn't the best I had, it was also missing something. Overall I probably will not come back. \n \nThe restroom was clean but everything was all black. The stalls, the toilet itself and the sink was black. It reminded me of a porta potty. \n\nOther then that \nCleanliness 5/5\nService 5/5\nFood was 3/5", "name": "Fiorillo's", "rating": 3}, {"index": 11, "review": "Our neighbors introduced us to \"belly up to the bar\" dine, drink and watch the Giants  there...great food, terrific service. Impressed with the wine list. Attended a college reunion party....great bufffet and servers. Had a blast ...", "name": "Fiorillo's", "rating": 5}, {"index": 12, "review": "Been going here off and on for years but recently we've been choosing to sit in the bar so we can watch the Sharks and Warriors play on their big screens.\n\nDominique is the BEST Bartender/Server ever.  The kids love her as she always greets them with enthusiasm and cheer.  She's the reason we keep coming back.  \n\nThe food has always been good.  Nothing fancy but consistent... so we know what we're gonna get.  \n\nGood job Dominique thanks for making every experience a good one!!!", "name": "Fiorillo's", "rating": 5}, {"index": 13, "review": "The rudest most unaccomidating staff ever. This is supposed to be a place of service and assisting the customer. Nope! Manager won't help you with anything and the answer is no. I will never dine here!", "name": "Fiorillo's", "rating": 1}, {"index": 14, "review": "It has become my favorite Italian restaurant !\nFood and service both was amazing :)\nThe Mushroom Ravioli was treat for the taste buds..\nMe and my family had great time tonight .", "name": "Fiorillo's", "rating": 5}, {"index": 15, "review": "I love this restaurant and family! My favorite dish is the chicken Marsala with cheesecake afterward, of course! The Bistro salad is great, my daughter loves the chicken Alfredo, my dad's favorite is the veal parmesan... The servers are warm and genuinely interested and engaged. Their attentive without being annoying :) Michael and Jennifer are always pleasant and make a point to say hello. Class act all around! We'll see you all again soon :)", "name": "Fiorillo's", "rating": 5}, {"index": 16, "review": "Attended a funeral luncheon for an old high school counselor who made a big impression on me. There had to be at least 200 people in attendance and the staff at restaurant worked hard to make sure we were treated well. The food was buffet style with pastas, salads, and chicken, and it tasted great ! Though it is farther than I wouild normaly drive for a night out at a restaurant, I wouild patronize this restaurant again when in the area.", "name": "Fiorillo's", "rating": 4}, {"index": 17, "review": "Fiorillio's is a restaurant located where the El Camino Real bisects De La Cruz Boulevard in Santa Clara, California. Now if you're headed to this Italian inspired eatery, you definitely need to be aware of your surroundings because google maps will screw up the directions and lead you to the site opposite the establishment's actual location. Despite google maps misleading you, it really shouldn't matter because this eyesore of an establishment stands out like a guido at the gym. As soon as you walk in you are immediately hit with a feeling that screams \"Luxury Cheesecake Factory.\" This overwhelming feeling of nostalgia for the Cheesecake Factory comes with every dish at a very expensive price point. \n1. The Food\nThey say a chain is only as strong as its weakest link, and in the restaurant business, it's normally not a good sign if your weakest link is your food. The equivalent of labeling Fiorillio's food as \"Italian\" would be calling the Shin Black instant ramen an \"authentic\" Korean dinner. Fiorillio's is able to hit a lot of the flavor notes of Italian cuisine, but ultimately it fails in its primary endeavor to provide clients with a taste of Italy. When you are seated, expect to receive a menu that when folded out has a wingspan only matched by the California Condor. Not to mention, the menu contains more words printed on it than most young adult youth fiction. \"Hey dumby, why are you playing the Hunger Games when there are plenty of dishes to order on the Fiorillio's menu to feed an entire district. We'll never go hungry again with this cornucopia of options.\" There, Suzanne Collins, I fixed your book. Anyway, after selecting the bruschetta starter and the Pasta Romano as the entre, I eagerly anticipated the arrival of my food. As expected, they brought the bruschetta out first. I give Fiorillio's an A+ for following traditional dining format where the appetizer comes out prior to the dinner. Now we go onto describing the bruschetta, which was probably some of the worst bruschetta's I've ever had. The variety of diced vegetables and fruits that sat atop the bread vessel looked like forlorn, damned spirits aboard Hades' barge being ferried across the river styx, expecting whatever fresh Hell awaits them for the remainder of eternity in the City of Dis. Upon biting into the bread, the eater realizes that the taste of the tomatoes and bell peppers is masked entirely by a pungent punch of garlic. Once you get through that, and apart from the occasional explosion of flavor brought by a caper, the only thing you'll taste will be the oil soaked bread. That bruschetta was so saturated with e-v-o-o, that per square inch there's more oil in that bread then there is in the entire Middle East. Fiorillio's is lucky that the U.S. Army hasn't tried to force a regime change and occupy their bruschetta. Fortunately for me, if that ever does happen I've already lost my disappointment of a son in the first invasion of Iraq. But don't worry friends, I thought something like this might happen and took out a massive life insurance policy on him. I'm rolling in more dough than the bruschetta is oil. Anyway, the main course was as equally disappointing as the bruschetta. While the dish is quite a sight to behold, much like a cheap Italian prostitute, the looks mask a much darker and unpleasant fate. From the instance I took my first bite, I could taste the first of three grave sins that an Italian restaurant can commit, domestic prosciutto. Now I know what your thinking, \"Harry, you're a 3 pack a day smoker and have been for the past 60 years, how do you still have the taste buds left to distinguish domestic from Prosciutto di Parma?\" To which I say, shut up and don't interrupt me during my educational review. I think that this is the best time to address the plague on American Italian cuisine that is domestic prosciutto. For those of you who don't know about prosciutto, prosciutto is delicacy made from pig haunch. The best and the only, as far as I'm concerned, prosciutto comes from a city in northern Italy called Parma. The reason why this prosciutto is so highly sought after is because they feed the pigs the whey of Parmigiana cheese, which causes the meat of the animal to acquire a subtle taste resembling that of the cheese. Upon slaughter, the succulent leg is then taken from the beast, rubbed with salt and aged between 9 - 18 months. The longer it ages the more the meat and fat will melt in your mouth. Prosciutto di Parma will first strike your pallet with a nutty flavor as the muscle breaks apart in your mouth, then as you begin to chew up the slice, the fat will start disintegrate, washing an unreplaceable sweet flavor over your taste buds. Then, through all of that, you'll still be able to detect a hint of delicious Parmigiana Reggiano that comes from the pig's whey diet. It truly is a magical experience... (Continued at http://genericfoodcritic.blogspot.com/)", "name": "Fiorillo's", "rating": 1}, {"index": 18, "review": "I normally enjoy eating here but today was the first bad experience I've had at this restaurant, and my bad experiences at places are few and far between and although I thought it would end better it really wasn't a good day for me to eat here today.  I'll tell you why...\n     First of all today is my Cousin's birthday and my Cousin chose to have her birthday lunch here.  We arrived before my Cousin's party and were promptly seated and out waitress came out in a jiffy.  So far, So good.  However, she left and we sat there and waited. And waited, And waited... \n     We waited a full 15 minutes before she came back with the water I had asked for, and we waited another 5 minutes for a meager loaf of bread.  So we had waited a full 20 MINUTES for some substanance and by then I was already nearly fuming.  To add insult to injury the other waiter ( or water server, or whatever his function is at the restaurant ) who tried to assist her was just as incompetent and he took just as long, IF NOT MORE TIME to attend to us than the previous employee!  Now, please keep in mind that I am Latino and so is my family ( with the exception of my Uncle, my Cousin's father, who is Caucasian ) and the waiters were Latino and I don't want to allege that there was some possible interethnic discrimination but sometimes Latinos discriminate against other Latinos, and so do Asians who discriminate against other Asians, and so on.   So I don't know if any of that was going on but by then I had almost had enough and was ready to head for the door.\n    They served our meal and the last straw was that the steak I had ordered MEDIUM came out MEDIUM RARE, and when I politely asked them to cook it MEDIUM WELL it came out almost charred!  GREAT.  A perfect ending to a messed up day! :)  Thank You very much Fiorillo's staff for such a memorable experience!   Although my meal was awful, my family actually enjoyed theirs.  I guess they sensed that I was already peeved at them so they tried to make my experience less-than-enjoyable and GUESS WHAT?  THEY SUCCEEDED!\n    There was a blonde lady who was at the door who I believe was the manager-on-duty and she was great but the staff was awful.  I mean, truly God-awful.  My family also complained to me about the waitress when we left and I truly do believe that if the waitress would have been Caucasian my experience would have been better.  It will be a LONG, LONG, LONG time before I eat here again.", "name": "Fiorillo's", "rating": 1}, {"index": 19, "review": "Attended a company dinner here with a group of about 40 or so people. We were separated into two big tables which kind of sucked because we had people who had their backs to eachother so not everyone was really together. Doubt this was the restaurants fault since I heard they do have a room that can be rented out and used for such occasions (but it was already booked). I had never heard of this place before and its located right off of a busy street close to an under pass in Santa Clara. The building was not hard to miss but trying to figure out how to get into the parking lot was a trip. They have a good amount of parking. You can park on the street too. My experience here probably varies from the usually experience since everything was kind of already laid out for what we were going to eat and drink. We had a bottle of red and white wine per table and tons of appetizers. We had the salami with cheese and what not as one, we had calamari, and the little garlic bread sticks. By far, the calamari was the biggest hit of them all. Some of my co-workers said that the garlic breads had a bit of a kick but I did not find that to be true to my taste buds. I ordered the lasagna and it was pretty good. Portion sizes are pretty big! Another big hit was the seafood pasta, again a bit on the spicy side per my coworkers. For dessert we had cheesecake and tiramisu. Big sizes once again. Over chill vibe. Saw tons of families eating out there. They also have a bar so you're able to drink and watch the game too.", "name": "Fiorillo's", "rating": 3}, {"index": 20, "review": "This was a major disappointment. \nI visit & eat with friends here maybe every 3-5 years and have had good service and food in the past.\nLast night met overseas friends here to enjoy a nice meal. \nThe only thing good about it was a house ravioli appetizer, all the main course's were horrific. \nChicken had a sponge texture and the calamari was not fresh by a long shot, a very fishy taste.\n\nThe personal were friendly but not trained, reaching in front versus pouring from the side of others to pour water, cut me a break. They meant well, but still not an excuse.\n\nOn the upside, since there were not many there, it was quiet and we were able to have a good conversation and an extended visit.\nJust wish the food was better.\nDoubtful I will return in my lifetime, too many other places available.", "name": "Fiorillo's", "rating": 2}, {"index": 21, "review": "The place is nice enough, but parking is bad.  The staff is friendly and provide great service,  The calamari is yummy, bread was warm and soft right out of the oven The chicken piccata is OK but not worth the price.", "name": "Fiorillo's", "rating": 3}, {"index": 22, "review": "Debated giving it a 1 star, but I guess the food didn't make me sick... \n\nFor starters, the decor is straight out of 1988. Black toilets and urinals, diner style booths, gaudy paintings (I'm surprised I didn't see some Patrick Nagil art on the walls), noisy single open room, etc. The decor truly was needing an update 20 years ago!! \n\nFor the food, it was also matching the decor. I suppose they didn't update the recipes either. Crab in pesto recommended? Wow, covered the flavor of the crab. They have oysters Rockefeller? Boy, thought that went out in the 80's (again, menu not updated). Tho, I guess you should not be surprised as they have 100 menu items. Be wary of any restaurant that claims they can do so many food items well!!\n\nOverall, it was really not a good experience. My risotto was oily and buttery like the rest of the meal. The semifreddo was actually an affogato. When I pointed it out to the owner he said each place makes it different. Well, sure I suppose if you bake a pizza and call it a pasta then claim each place makes it different then sureeeeee. Whatever, I'll not go back. \n\nUpon second thought, given the reaction and the defensive tone of the owner when pointing out the affogato disguised as a semifreddo I'll change my review to a 1 star. If they had owned up to my disappointment and apologized perhaps it deserved a 2 star. However, the fact that they are defensive and coming up with excuses at every turn deserves the 1 star. Enjoy and bon appetite (yes, that's Eye-talian... gah).", "name": "Fiorillo's", "rating": 1}, {"index": 23, "review": "Service was excellent, very attentive and genuinely friendly all around.  Food was good. I had standard Italian- meat ravioli/spaghetti combo with meatballs and meat sauce. Meatballs we're very flavorful. The boyfriend had a seafood pasta dish. Lots of calamari- I loved it! He always makes good dish selections. The bread was warm and the lobster cream soup that we split as an appetizer was perfect. \nYelp ratings we're 3 1/2... In my opinion not accurate. Surely worthy of 4 stars. We will definitely be back. A lot of choices on the menu. Prices reasonable. Close to home. Win-win!!", "name": "Fiorillo's", "rating": 4}, {"index": 24, "review": "Awesome food! Great ambience! I have been coming here since I was a child and it has never disappointed.", "name": "Fiorillo's", "rating": 5}, {"index": 25, "review": "Excellent food and service!!!  This is the only Italian food restaurant we frequent every few weeks.  Most of all, love the family ambiance!", "name": "Fiorillo's", "rating": 5}, {"index": 26, "review": "Our professional association has held our monthly dinner meetings at Fiorillo's for the past couple of years now, and we've never been disappointed.  The service has been professional, the food exceptional, and the owners are caring, thoughtful people.  \n\nThere have been a couple of times when we had to ask the service staff to jump through a few unplanned hoops, and they've always been accommodating.  Almost monthly our attendees and guests, who can have discerning palates, compliment the food.  Finally, the Fiorillo family is a warm group of people who look out for their customers' satisfaction and are always giving back to the local community.\n\nFiorillo's is the whole package, not just a place to grab a meal.", "name": "Fiorillo's", "rating": 5}, {"index": 27, "review": "Excellent food! The corn and lobster chowder was excellent! The environment is classy yet casual. The wine selection is decent, and the variety on the menu is nice if you have a wide range of palate's dining with you. definitely recommend", "name": "Fiorillo's", "rating": 5}, {"index": 28, "review": "This review is specifically for the banquet room and not necessarily the restaurant as a whole. \n\nMy husband and I decided to have our wedding reception here. Anyone who is planning a wedding knows how expensive the dinner, alone, can be. A $30 per plate meal can turn to $100+ per plate when the word \"wedding\" is attached to your event. Fiorillos does not do this. They keep prices reasonable in both their restaurant and banquet events. Plus, the food is good. Not like the lame bland meals you get at a lot of wedding venues. Seriously, I've never understood why it's so hard for places to serve decent food at a wedding!\n\nMike (one of the owners) and Sylvia (the event manager) were awesome with communicating and responding to my emails when I had questions. Our special day went by with no problems! I would definitely recommend them to anyone planning a wedding!", "name": "Fiorillo's", "rating": 5}, {"index": 29, "review": "I have not been here for years, I moved out of the area.  My father lives in the area, and suggested this place for lunch.  My father is elderly, and hostess picked up on the difficulty of the noise, and placed us in a quiet place.  Big points for me...  The menu is perfect size, you can find anything to eat.  The wait staff was wonderful, drinks never went dry. and food come out in timely manner.  It was fresh, flavorful and hot.  The portions were perfect, and the cost was very acceptable..  It is a classy place, and it is old school, that still treats customers with dignity and respect.  Absolutely go to this place.", "name": "Fiorillo's", "rating": 5}, {"index": 30, "review": "Really a classy place but dress can be anything, including shorts and flips flops...if you like. Italian done the right way and have never had a bad seafood plate. Say that when you're eating scallops.", "name": "Fiorillo's", "rating": 5}, {"index": 31, "review": "This place is super yummy!\n\nCame here for the first time for a retirement party and it was banquet/buffet style - everything was delicious and everybody kept coming back for more! The service was amazing!\n\nHad an early dinner here in the main restaurant and was blown away at how delicious my entree was (Baked Jumbo Prawns on angel hair pasta). It looked so simple but every single bite was packed with flavor. Our group ordered three kinds of desserts because everything looked so delicious and we were not disappointed one bit!\n\nCame back again for Mother's Day and so glad we made reservations! Both previous times seemed like we were there during the off hours but it was a full house on Mother's Day. Had to order my Jumbo Prawns pasta again and it was consistent with my first experience with it - DELICIOUS. \n\nThe Tartufo Limoncello dessert is AMAZING! Must get! It is a perfect way to end your nice Italian meal. \n\nThe service is great, the manager came around and ensured that we were satisfied with our experience. I know this place has been around for years and I hope it continues to serve this area for many more years to come!", "name": "Fiorillo's", "rating": 5}, {"index": 32, "review": "Really enjoyed our dinner!  The fried ravioli and Caprese salad as appetizers were amazing!  I had cheese ravioli with meat sauce and couldn't finish it all.  We made reservations for 7 and we're seated right at the appointed time.  Neat atmosphere and very good food.  Enjoy!", "name": "Fiorillo's", "rating": 4}, {"index": 33, "review": "I been coming here since they were on el Camino real in Santa Clara now the new place I one the old man and his kids I detailed there cats I'm not saying this because I know the family this place food is great and the service is great also I will recommend anyone here great place thank u for the great food and service", "name": "Fiorillo's", "rating": 5}, {"index": 34, "review": "Went here for lunch with some coworkers just before the holidays. While the restaurant wasn't too busy (I didn't see anyone waiting for a table in the lobby), it was pretty full. Luckily we had a reservation and were seated as soon as we checked in. \n\nThe menu had plenty of tasty looking options and had enough options for one of our Vegan coworkers who was with us. \n\nWe started with Calamari and the stuffed mushroom caps. The calamari was pretty standard but the Mushroom caps were pretty good. I'd likely order them again.\n\nAs for my entree, I went with  Chicken Parmigiana. The sauce was pretty good but the chicken was a tad overcooked and dry. I, for one, love sauce so I just slathered extra sauce with each bite of the chicken so it was ok. \n\nOverall the atmosphere is alright and its a pretty run of the mill Italian restaurant with decent food. Would I come back? sure, if I'm in the area but I wouldnt go out of my way to come back.", "name": "Fiorillo's", "rating": 3}, {"index": 35, "review": "Early dinner last night arrived a bit before 5 pm.  We could tell the place was going to be packed as they had several Christmas parties booked. We sat down and once our waiter came we let him know we were trying to get to a Christmas show at the University down the street by 6 pm and if he could recommend dishes that would be quickest from the kitchen. He was great...I think his name was Rys. He brought drinks quickly, took our orders quickly, food came out fast, he brought the doggy bag and bill so we could book it out to get to the concert. Food was great, service over and above...and we left just as it was starting to get crowded. Love this place for good Italian and great service.", "name": "Fiorillo's", "rating": 4}, {"index": 36, "review": "No nutritional information. So if you don't care about your health and physic, this place is for you.  Junk food places have more info about what you eat... \nThe food is average, nothing special.", "name": "Fiorillo's", "rating": 2}, {"index": 37, "review": "Yummy. Great Italian food at a reasonable price. Nice atmosphere. Waiter was awesome. Will return again.", "name": "Fiorillo's", "rating": 5}, {"index": 38, "review": "After a long day of car shopping, my hubby took me here to satiate a pasta craving. Fiorillo's is located on the corner of El Camino with its own parking lot. Upon walking to the front entrance, we saw a gigantic group of people waiting outside. It turns out Fiorillo's hosts banquets as well, having a large hall to the left side of the building and a normal dining room to the right. \n\nWe were seated immediately upon arrival since there were plenty of tables open. The dining room is very spacious with large U-shaped booths and home-style, wooden tables. The color palette of the restaurant, however, gives it a very antiquated feeling that is in desperate need of an upgrade. While we didn't get our waiter's name, we were pleased with his service, as well as the other waiters who were quite attentive when it came to our drinks. \n\nMy hubby ordered the ravioli with sausage while I ordered the crab bordelaise. Complimentary garlic bread and regular house bread with sesame seeds were served first as appetizers. We loved how hot and fresh the house bread was, although considering the cold butter, it was good that the bread was steamy. I was fine with the garlic bread, but my hubby felt it was a little too heavy. \n\nAppearance wise, our entrees looked okay. The portions are certainly hearty, but the presentation was boring. While my hubby liked the ravioli itself, he wasn't too fond of the sausage, which wasn't cut into pieces but rather served as one, large link. The flavor of the meat wasn't memorable, giving off a strange after taste, and he would have liked the ravioli to be served in a larger plate since he didn't have room to cut each pasta square without spearing the others. \n\nAs for my crab pasta, I was disappointed with how watery the sauce was. Most of it sat at the bottom of the dish and didn't coat the pasta evenly. Therefore, some bites were much more flavorful than others. However, I could taste actual pieces of crab, so that was a plus. \n\nBy the end or our dinner, neither of us finished our entrées and we didn't want to take the leftovers home. While the portions at Fiorillo's are large, the flavors are lackluster. So for the price, we can't say the food is worth it. We have gone to a few great Italian restaurants around the area and for our personal taste, Fiorillo's leaves much to be desired. I don't think we will be back in the future.", "name": "Fiorillo's", "rating": 1}, {"index": 39, "review": "This is a great restaurant to have a banquet!  The space is great and they accommodated our presentation needs wonderfully.   They provide a large selection of meals to choose from and all were delicious!  The wait staff was quick,friendly and remedied a mistake we had made.   We had a great time and great food!  I look forward to going back.", "name": "Fiorillo's", "rating": 5}, {"index": 40, "review": "This Italian restaurant is one of my favorites.  Servings are large, and the dishes are rich and flavorful.  Bread is warm and served with butter.  Service is great.", "name": "Fiorillo's", "rating": 4}, {"index": 41, "review": "Elena and I were invited to come to this restaurant for a dinner to launch a new non-profit organization. We made the almost one-hour drive from Pacifica. The restaurant is located in a large and beautiful building. It is a little intimidating at first. Parking was easy to find. We went in and found a wonderful impression inside. It felt like a warm and very friendly family style restaurant. We got excellent and courteous service through out our three hours there. When the buffet came, the food was literally \"out of this world\" and outstanding. Elena and I attend many events and buffets. The food is never that great. We often talk about what politicians have to endure all the time. This venue had wonderful and healthy food! We had a great time and will return for other visits.", "name": "Fiorillo's", "rating": 5}, {"index": 42, "review": "Really nice place.\nI went there with some friends for my friend birthday. \nThey were really sweet, they sang Happy Birthday for him in English and also in Italian. They offered us extra ice cream with the piece of cake we ordered.\nThe only reason I don't give 5 stars is because the pasta I ordered was not as tasty as I expected but it's still good.", "name": "Fiorillo's", "rating": 4}, {"index": 43, "review": "TL;DR: The same family atmosphere advertised by Olive Garden, accompanied by much better food.\n\nThis place is old-school Italian-American. You can tell as soon as you walk in by the circular, oversized booths. This is going to be food that is low on finesse but high on portion size. It may be \"Americanized\" but boy does it do the genre justice. Since I don't go on rants about how PF Chang's isn't authentically Chinese, I don't seem to understand why so many people are upset that this place is so American. Didn't you see the menu before coming? They list \"Chinese Chicken Salad\" under \"Insalata Specials\".\n\nThe bread comes out warm. It's made in house and served with butter. Why butter and not olive oil? Because this is America. Oh, and they also let us try some garlic foccacia bites which were hot out of the oven. Spicy and delicious!\n\nThe baked rigatoni is literally a small casserole dish which has been filled with pasta and meat sauce, covered in a thick layer of mozzarella, and baked. That is not how pasta is cooked in Italy. That's not the point.\n\nI made a slight mistake by opting for a pork chop special, which was not very Italian, cooked more done than I specified (but to their credit, not dry) and came with rice that had been soaked with a bit too much teriyaki sauce. For dessert, I stuck with the classic cannoli, which was a proper American-sized cannolli stuffed full of house-made cannoli cream.\n\nI'll be back to stuff my Asian-American face with more Italian-American food. Because America.", "name": "Fiorillo's", "rating": 4}, {"index": 44, "review": "Fun place to take an older crowd -- make sure you get reservation if you're coming in peak hours. Located in a strip mall, but don't let that fool you, there is an atmosphere inside. Compared to Tomato Thyme, located the next strip mall over, it's more fancy, but less fancy than Dry Creek Grill with more standards.", "name": "Fiorillo's", "rating": 4}, {"index": 45, "review": "Best retaurant in the area.  Menu is Italian but there is enough choice that you don't have to limit your options.  Service is great.  Ownership is awesome.  Give it a try.  Oysters Rockefeller are special.", "name": "Fiorillo's", "rating": 5}, {"index": 46, "review": "Italian cuisene at its best.\nFresh ingredients and delicious NY steak.\nThe service was very attentive.\nI definitively will come back!", "name": "Fiorillo's", "rating": 5}, {"index": 47, "review": "Great restaurant, delicious Italian food, good venue, and wonderful people. I threw my friend's bridal shower at Fiorillo's banquet hall, which is separate and across from its restaurant dining hall. Michael, one of the owners, was very easy and pleasant to work with. He is also very responsive, which makes party planning a breeze. His staff was also very kind and accommodating during the event. But most importantly, the food was delicious! There were a number of vegetarian options. And the food, venue, and service all came at a very reasonable price. Fiorillo's also provides table linens and napkins, with some color options, and AV equipment for those who need it. Fiorillo's is a wonderful restaurant and a great event venue! Thanks, Michael and staff!", "name": "Fiorillo's", "rating": 5}, {"index": 48, "review": "On Friday night, I called to order a pizza and Chicken Marsala. The young man who took the order was rude and unprofessional.. After working a long day myself, I did not need to hear his rudeness. \n\nMy family has enjoyed Fiorillo's for many years! However, this last year the food has not been that great. The pizza was average. The sauce was not very good. There was no parmesan cheese on the pizza like normal. The chicken for the Chicken Marcella tasted boiled..:0(\n\nI'm sad to say our family won't be eating at Fiorillo's for a while..", "name": "Fiorillo's", "rating": 2}, {"index": 49, "review": "This restaurant was very good.  It is old school Italian.  The food was great and the staff was well trained and very attentive.  \n\nTwo in my party had the chicken parmigiana and the other had spaghetti and meat ball.  All of us enjoyed the food.  It was very taste and the sauce tasted like it was made by an Italian grandmother.  \n\nThey seemed to have an excellent wine selection but we were heading to meetings so we did not have a chance to check them out.  Next time!", "name": "Fiorillo's", "rating": 4}, {"index": 50, "review": "This was a decent place. Not great, not bad. I got the baked rigatoni, which is impossible to flat-out not like, but also nothing I would go back for specifically. I also tried the veal rotini, which was very flavorful and tasty, but again, nothing I'd make the trek out for. \nI thought that the bread offered at the beginning (little pieces of spicy focaccia and a loaf of sesame seed sourdough) were good, but the butter they brought out was cold, so I kid you not, I had to sit on it discretely to warm it up enough to be spreadable #no regrets. \nFor dessert I had the chocolate fondant cake, which was good, but not spectacular. If you're a lover of frosting like I am, then order it, because it has a very thick coat, but the cake itself was actually a little dry. \nThe one thing I have to point out was the excellent service provided by my waitress Christina. I was a little skeptical at first, given that I had to wait around ten minutes to be greeted by her, but after this initial setback she was wonderful. Food was brought out in a timely manner, and I was brought more of the focaccia nuggets upon request. At first, they actually got my entree wrong, and brought out the veal scallopini instead of the rotini, but they handled the mistake flawlessly, they were apologetic, and brought out the rotini quite quickly. I was not charged for the scallopini. \nIf you are in the area, this is a decent place to go, but if you are considering traveling for more than ten minutes by car, don't. If you do go, make sure to request Christina's section, because she was lovely and smiling the entire time. She made the experience much more memorable than it would have been otherwise.", "name": "Fiorillo's", "rating": 3}, {"index": 51, "review": "Excellent food very good service and portions are quite big enough for hungry ones\nTasted most of the appetizers and main plates and they were all perfect\nIt's pitty that location is isolated", "name": "Fiorillo's", "rating": 5}, {"index": 52, "review": "Had a wonderful  meal the service  by Christina flawless a great plsce to have a special  celebration", "name": "Fiorillo's", "rating": 5}, {"index": 53, "review": "We hosted our fundraiser dinner here. We had 160 people in attendance. The service was AMAZING! The food was DELICIOUS! Aileen (spelling sorry) was the manager on duty and helped us out tremendously! She was always available to help and answer questions. We are so happy with the event,even some of their employees bid on auction items! Great establishment and even better staff! Thank you Fiorillos!", "name": "Fiorillo's", "rating": 5}, {"index": 54, "review": "My wife and I went for her birthday. I am generally risk averse and not a fan of trying anything new especially on special occasions but we decided to give this place a try so we have some more options for Italian fare close to where we live.\n\nWe made reservations as it was a Fri night but as it turns out seating was freely available and we got seated promptly when we arrived. \n\nService was nice, courteous and not intrusive (no checking in every two mins to see if we were doing fine).\n\nI had the special which was Mahi Mahi on a lemon butter sauce and my wife had the vegetarian portabello mushroom ravioli. Both items tasted great. The ravioli portion size was larger than expected. The Malbec was ok but not great. \n\nI'd go back. I liked the place and the food. The decor is not as dated as some reviews claim. I had no problem with it.", "name": "Fiorillo's", "rating": 4}, {"index": 55, "review": "My first time - AND IT WILL NOT BE THE LAST.!!  Everything was fantastic - from the service to the food to the wine.  I ate in the bar so I could watch a ball game - 4 different TV''s to pick from.  Mike, the manager, came by and welcomed me, and filled me in on what were the popular dishes.  At a recommendation of a family friend, for appetizer, I had the Mushroom Caps Bordelaise - enough for two - and very flavorful.  The French Onion Soup was the best I have every had.  For the main course I had the Chicken Marsala - the chicken was sliced thin and very tender.  I could only eat about half of it - had to ask for a \"doggie bag\"!  \n\nHighly recommend this restaurant to anyone seeking a traditional Italian meal.\n\nThe best part is that the restaurant is only 1 1/2 blocks from my house!!", "name": "Fiorillo's", "rating": 5}, {"index": 56, "review": "We were so pleasantly surprised the night we brought our family and friends to celebrate a High School graduation.  The service was so good ( Thank you, Cristina) our bus  boy was Fernando, another happy employee.  The food was the best Italian I have had outside of Italy.  And the prices for the quantity AND quality was excellent.  We tipped 28% because they were that good.  Enjoy!", "name": "Fiorillo's", "rating": 4}, {"index": 57, "review": "Been going to Fiorillo's since it was located near San Tomas Expwy and the food has always been excellent to my liking. We're not talking super upscale Italian food, just rock solid, very tasty, consistent, great quality and plenty of food provided. Recent visit a week ago in a party of 4 and everyone ordered different items on the menu, plenty of appetizers (mushroom with marsala sauce is killer to dip your bread in), garlic bread, and even took the Fiorilla special pizza home for the next day. We'll be back!", "name": "Fiorillo's", "rating": 5}, {"index": 58, "review": "I have driven by here many times before but never noticed this place. Came here for a business review dinner and the restaurant is credibly spacious. They even have these private banquet rooms and one of them was packed with Santa Clara University sorority girls throwing a large party.\n\nSome members from our group were highly-entertained by the sorority girls getting drunk and doing all kinds of \"interesting\" movements.\n\nWe had a variety of appetizers including:\n5/5 Stuffed mushrooms -  Yum!\n2/5 bruschetta and the meat and cheese plate were a bit bland.\n\nFor the main entrees:\n3/5 Caesar salad  - as expected.\n2/5 Prawns Fra Diavlo - Sauteed prawns in marinara sauce over linguine - This dish sounds great but lacking flavor.\n5/5 Colossal cheesecake with raspberry sauce - So rich and delicious!\n\nIt was a bit of a mixed bag. Some of the food served was really good but most were just okay. The servers were a bit disorganized but friendly.", "name": "Fiorillo's", "rating": 3}, {"index": 59, "review": "We went here last night for my mom's Mother's Day dinner. The gentleman who sat us was very nice and seemed to be part of the family business. The inside was very 80s diner-like. The menu had a huge selection and I couldn't decide between the two crab pastas. I asked our waitress for a recommendation between the two and said she thought they were both good but was biased towards the one with pesto in it. So I decided to give this one a try even though I had never had a pesto pasta with crab in it and thought it sounded like an interesting combination. Even though I ordered mine with less cream in it, it still was very heavy and overpowered the crab completely where you couldn't taste the crab. The portions were huge and I only ate half of my dish as did my boyfriend. I didn't think I would have room for dessert but when I saw the semifreddo on the menu I had to have it. I LOVE semifreddo and am always on the lookout for it when I try new Italian restaurants. I don't know many Italian restaurants that do. I often have it at Sapore in Burlingame. Well when my semifreddo came I thought the waitress must have accidentally given me an affogato because my dessert was served in a cup and was completely liquidy as if in an affogato, when the ice cream is melted and mixed in with the coffee. I asked my bf to check with the gentleman who sat us earlier and when he came by, he was defensive and said that this was in fact the semifreddo, had come up with the recipe himself and was sorry it wasn't what we expected. We didn't want to make a bigger fuss because my mom enjoyed her dinner and having us all together and that's all that mattered. But I was very disappointed having been so excited to see semifreddo on the menu. When you google \"semifreddo\" all instances show and describe a frozen cream dessert and nothing in liquid form. I am completely bewildered - has this guy even been to Italy?!", "name": "Fiorillo's", "rating": 2}, {"index": 60, "review": "First, let me emphasize that this review is solely for the 60-person work banquet I attended.  Maybe the dining room has better individual dishes, I don't know.  But what they served us at this work dinner banquet is an absolute insult to Italian food, and in fact, any kind of good food in general.\n\nLet's start with the appetizers.  These actually weren't bad.  But what did they serve?  Yakitori (chicken on a stick for those who don't know), crab hush puppies in cream pesto, and crostini with salsa on it.  Salsa, I kid you not.  Tomatoes and onions diced so that it even looked like salsa, or may have been taken from one of those plastic containers.  No basil, oregano, or any other seasoning that would make you think it was Italian.  And there is no trace of Italian in any of the other two appetizers.  NONE of these appetizers served appear anywhere on their regular menu.\n\nWhen dinner was ready to be served, the rolls they brought out were COLD...as in, refrigerator cold.  I started to pick one up and I could FEEL that it had been taken out of the refrigerator recently...or worse, perhaps thawed from being frozen.  And they served those individually wrapped butter bits...also hard and cold, with them, instead of whipping it for easy spreading like all good restaurants do.  I elected not to eat it.\n\nNext, the salad.  They gave us Caesar, and it wasn't too bad aside from being slightly overdressed.  At least the lettuce crunched and wasn't wilted.  But there is about the last positive thing I can say about the meal.\n\nWe got a three-piece ravioli next, and they, tasted as if they had been frozen, thawed, and heated in a microwave.  Unpleasantly chewy edges, with some of the inner cheese melted and some not, and the sauce didn't have anything special to it.  Not spiced well.\n\nThe main course was, to say the least, awful.  I'd signed up for \"steak with mushroom sauce.\"  What they actually gave me was the kind of beef you find in Asian stir fry, very thin, almost like a skirt steak, except it seemed like they had cooked it too long in a crock pot and literally drowned it in a mushroom-wine sauce so sweet it almost tasted like syrup, in addition to not having all the wine cooked out of it.  Stir-fry beef in too much sweet mushroom sauce...NO hint of Italian.  In fact, I was in such disbelief that I again checked their regular menu for this dish...and there is NOTHING on the menu remotely resembling what they served to me.\n\nThe mixed veggies they served along with the main course tasted like they'd come out of a frozen bag; the green beans were dark, mushy, and not at all fresh, and the broccoli also had a rather unpleasant taste.  They didn't even put salt on them.  And the potatoes...cooked well, at least, but zero seasoning, and I could also detect a hint of dirt left behind on the skin, like they hadn't been washed well before cooking.\n\nAdd to all this that the service of all the courses took so long that the schedule that my workplace presented us with...dinner at 8, work presentations at 9, champagne toast at 9:30, Dancing at 9:45, didn't happen.  Yes, they started the dinner service at 8.  But by 9:45, people had barely finished their main course, dessert had not yet shown up, and presentations had not yet started.  Because I work early in the morning I needed to sleep, I left before dessert started.  But based on my whole experience for the evening, I doubt I missed anything spectacular, at least food-wise.  My stomach was just not happy on the way home, and I didn't want to deal with having to force down anything else.", "name": "Fiorillo's", "rating": 1}, {"index": 61, "review": "This used to be one of our favorite places but things have changed.  We ordered the calamari appetizer which was awful. Looked like it had freezer burn, was dried out and no color. It stayed on our table during our salads  and when our entrées arrived, the busboy asked if we were finished. We said it really wasn't  very good and he said he would just leave it on our table so we could use it as a discard plate for our shells, what???   The muscles in my pasta dish were so tiny, some of the missing, one was even closed  and it had more mushrooms than anything.   I gave it 2 stars  because the bread was so good and the service was acceptable  but we won't be back.", "name": "Fiorillo's", "rating": 2}, {"index": 62, "review": "Nice experience.  Very Good tasting Italian food.  Healthy portions  Excellent service.  Didn't have to wait forever to get a check.  Water glasses always filled.  Tastefully decorated dining room.  echoes a bit.  Will definitely come back.", "name": "Fiorillo's", "rating": 5}, {"index": 63, "review": "Ordered from here via DoorDash. Pizza and pasta. Both were basically inedible. $50 down the drain. Never again.", "name": "Fiorillo's", "rating": 1}, {"index": 64, "review": "I was extremely disappointed in my food. Came in a group of 20  on a Saturday night around 7:30pm and there were about 3 of us that got the Di Capri (seafood pasta with clams, crab, shrimp and few other items in white sauce). As they were bringing food out for everyone else our waitress came over to tell us they ran out of clams. Seriously?! You guys didn't realize until it was time to serve our food like 30 mins later? Our waitress asked if it was ok to substitute with mussels instead and of course we all said yes. We had to wait another 20-30 mins or more after everyone got their food. \n\nEventually they gave us some side bow tie pasta in tomato sauce to munch on after I was complaining among my friends.\n\nWhen food finally came out I saw one of my friends' dish with clams in it after our server told us they ran out of clams. Rule of thumb you are supposed to serve all plates the same way. \n\nFlavor was lacking and I noticed a strand of unknown object in my food so I basically stopped eating. Crab meat was non-existence. You might as well remove that ingredient off the menu. At that point I was so disappointed that I didn't bother complaining anymore. \n\nThe one point goes to our waitress for breaking down our bill individually.\n\nNever coming back.", "name": "Fiorillo's", "rating": 1}, {"index": 65, "review": "The beginning was great but it started trickling to the point where we felt non existent to the point where we waiting 23 minutes from being done with our food. Mind you the restaurant was not busy. I've smiled and just kept a good feel because I understand since I've served and managed one before. After waiting for those 23 minutes ( also our server said she'd send someone,but no one) I've also realized others server don't help each other. It's really a segregated section. After I stood up to grab to go boxes, they offered to do it , but I already heard that and just asked for it. After putting the food in the boxes, waited for our server to come out so I can signal for the check. Still no sign so I went to the back and said \"can we get our card swiped please, we've been waiting a very long time\" . The lady ( I believe manager ) said well \"that's rude\" . I'm like wtf seriously? I've patiently smiled while our food came out slow, our server forgetting our clam chowder, and others since I understand, but the end was just my last straw.", "name": "Fiorillo's", "rating": 1}, {"index": 66, "review": "Driven passed this place a hundred times and never thought to stop and try it out.  It's not in a shopping center or strip so it's not easy to spot.  Maybe that's why.\n\nDecided to have lunch here a few weeks ago.  I was pleasantly surprised at the layout of the place and size.  It was big, spacious and airy.  Just the way i like restaurants.  \n\nOur waiter was really nice and very attentive.  We went during the lunch rush but was seated right away.  Water was refilled often. \n\nOf course, I had spaghetti (my usual Italian dish whenever I do Italian).  I ordered the meat sauce with 1 meatball and 1 sausage. I know, people usually only do one or the other but me, Nah, I like a little bit of both! This dish was good! \n\nWe also got the stuffed mushrooms and they were also delicious. I had a glass of wine and it went well with my meal. \n\nPricing isn't bad and the menu isn't bad either.  To be honest, my friends and I was a bit skeptical when we saw Chicken Teriyaki on their menu (which we did not order) however everything worked out.  Give this place a try if you haven't yet.", "name": "Fiorillo's", "rating": 4}, {"index": 67, "review": "If I could give this restaurant 1.5 stars, I would. Let me break this down.\n\nSetting:\n\nReminiscent of a buffet hall. This place is a huge open aired space that would probably work best for banquets and receptions, not for a normal diner. The decor is antiquated and could use a makeover.\n\nService:\n\nDecent for the most part. In general, prompt, but there was a point where our waitress seemed to have forgotten the table's glasses of wine.\n\nFood:\n\nIf you're looking for real Italian food, I highly recommend you look for a different restaurant. This food is EXTREMELY Americanized. First of all, the menu. It attempts to be far reaching to the point of its own demise. Multiple seafood plates that seem similar in description, a lot of different red sauce pastas, etc. There's a lot of choices, but no meaningful variety. The salads seem questionable... Chinese chicken salad being one of the options. Ummm, okay then. I thought this was an Italian restaurant? In that same vein, there are multiple entree choices that have teriyaki sauce! What?? I ended up taking the steamed clam linguine served in a white clam sauce. More about that later...\n\n\"Bread\" service started with a salty, dense bread (?) with that cheap, powdered Parmesan sprinkled on top. Our waitress said it had a hint of cayenne. First of all, why would you put cayenne in the bread? And second of all, it didn't taste like cayenne anyway. Based on other reviews I'm guessing this is the garlic bread. However, it didn't taste like garlic. 5 minutes later we had a second bread service. What's that about? This was some generic bread you buy at a store. It had sesame seeds and poppy seeds on it... Not quite Italian (notice a trend?)\n\nWe didn't order any appetizers since nothing stood out as anything particularly tasty. Same with the salads, especially since I wasn't quite feeling the CHINESE chicken salad to go along with my ITALIAN clam linguine. Looking at other salads passing by, I'm glad I didn't order one. They seemed to have large slices of tomato and onion that would be suitable for a burger but not a salad.\n\nThe clam linguine was salty, and the \"white clam sauce\" that apparently (and should normally) be made with white wine didn't taste like wine. It also had cream in it, which is a big no no for such a sauce. Did I mention it was salty? Someone else at our table took the prawn diavolo (misspelled as \"diavlo\" on the menu)... The sauce was very watery and tasted as if it was made from powdered spices, not the real deal.\n\nWe skipped dessert for obvious reasons.\n\nSummary:\n\nOverall, this restaurant is overpriced for the lack of quality in the food. If you want something in the same price range (or even cheaper) but with better quality food, I'd suggest Macaroni Grill instead. \n\nIf you still feel the need to go here, expect a sub par American-Italian meal with a Chinese flair.", "name": "Fiorillo's", "rating": 2}, {"index": 68, "review": "I came here for a holiday party with my company and we had an average experience. Nothing great, but nothing completely awful.\n\nOur server was nice, but she seemed a little overwhelmed by the situation. I am not sure if she was actually busy, but she missed the mark on several occasions. She served our table wine, but skipped me and my 2 coworkers. She didn't even acknowledge or ask us if we wanted anything to drink. We had to flag her down and when she finally brought me a glass, the glass was dirty. On a good note, she was very apologetic which made the situation a little better.\n\nThe appetizers were great. They had this peppery focaccia bread sticks which were just spicy and buttery enough. Then we had these little sausages which were nice and flavorful. The best appetizer was the bruschetta. I could have eaten an entire plate of these. Then for dinner, I had the salmon, which was a little dry and over cooked. They had a side of veggies which was a little lack luster. We then finished our meal with a scoop of coffee ice cream, which was really yummy.\n\nThe place wasn't that bad, but I don't think I would have gone here if my party didn't organize it here.", "name": "Fiorillo's", "rating": 3}, {"index": 69, "review": "We had the best dinner.  The food and service were excellent. Pleasantly surprised as it is a well decorated, tasteful and very clean restaurant.   It was our first time so we tried a lot of things--two appetizers, pizza, soup, salad, main entrees and dessert.  Everything was delicious and the wait staff was probably the best we've had in years.  We've found a new gem and definitely will be back!", "name": "Fiorillo's", "rating": 5}, {"index": 70, "review": "This place is very good...both the food and the service...Best Chicken saltinbocca ever. I would definitely go there again...and, suggestion...they have a dessert that is cake with berries...the best.", "name": "Fiorillo's", "rating": 4}, {"index": 71, "review": "This was my first time here. I choose it because it was close to a venue i was attending at the Mission. The free focaccia appetizers were amazing! My Husband and I shared a caesar, nicely flavored, enough dressing (often not the case), and not dried out croutons. Sadly no anchovies on top. He had veal parmigiana, and I chicken piccata. His came baked in a huge ramekin with lots of sauce and cheese. He said it was very tasty, I only tried the sauce since I have a problem eating veal the way they are raised. Mine was yummy, a bit too much butter in sauce, farfalle pasta was lackluster as well as red sauce on top, veggies were really good, but again, lots of butter. Coffee and cannoli for dessert. Cannoli filling too sweet for our liking, but still enjoyable.\nThe only downside was slow service, but they had lots of large parties. Noisy due to that also.\nI think they were understaffed for size of restaurant.\nThis is \"old school Italian\"...... so it was a flashback to my childhood dining out.\nI would return to try other dishes.....", "name": "Fiorillo's", "rating": 4}, {"index": 72, "review": "Italian restaurant where all the meet is marinated in teriyaki.", "name": "Fiorillo's", "rating": 2}, {"index": 73, "review": "We and another couple took each other out for a Christmas dinner at Fiorillo's.  We have eaten here many times and had my husbands retirement party here as well.  My entire Italian family loves this place.  ;We've never had a bad meal, only great ones.  I always order the jumbo prawn and pasta dish and it's great.  I don't understand where the nasty comments come from; perhaps people take their epicurean skills too seriously.  Our service has always been great.", "name": "Fiorillo's", "rating": 5}, {"index": 74, "review": "It's been a while since I've been here but was the first place I took my wife on a date when I moved back to California and I must say minus my punctuation the restaurant was on point waitress was great was able to enjoy dinner while never having an empty glass in front of me says a lot in my opinion and the food is excellent at the end of my date I enjoyed a Irish coffee with a kick shared tarmasue amazing place for brunch lunch or dinner but don't actually know if they do brunch. Enjoy", "name": "Fiorillo's", "rating": 4}, {"index": 75, "review": "I'll make that review simple:\n\nPROS:\n- Food is rather good. It may not be 100% authentic Italian, but close enough. I was surprised to see so many bad reviews. \n- You won't get basically pasta bathing in sauce... It is rather delicate, finely shredded and seasoned. I tried Pasta Romano dish (that looked like carbonara... it was great) and husband had a Margherita pizza... It was very good too. Thin dough, fresh, thin mushroom and ham... Very delicate. So maybe the choices we made were rather good...  \n- Friendly service\n\nI've never been to Italy, so I can't tell how close they are... But they are similar to Italian Restaurants I've tried in France! Taste and style wise.\n\nCONS:\n- Service is rather slow (but it actually does not bother me) - I found it relaxing and not stressful.\n- Interior Decoration is rather \"old\". They have a huge dining room, with high ceilings, they have a huge potential to modernize it and give it a fresh look.\n- Crab cakes were not too good. Very salty and I am not sure they were \"housemade\".", "name": "Fiorillo's", "rating": 4}, {"index": 76, "review": "My go to Italian restaurant...love their red sauce. True Italian recipes, free warm bread.", "name": "Fiorillo's", "rating": 5}, {"index": 77, "review": "Really bad food + Really expensive= BAD\nMy friend and I left almost all of our entrees. It was just inedible. When the waitress came to clear our plates she didn't even say anything about the uneaten food. 1 app+ 3 glasses of wine + 2 entrees for $80 (not including tip). What a complete waste of money. This is one of the restaurants from Kitchen Nightmares.", "name": "Fiorillo's", "rating": 1}, {"index": 78, "review": "I love the food at this place.. It is our go to for fresh, high quality Italian food, I try something new almost every time although I do have a few go tos. Pasta Romano I ask for Rigatoni, and the Crab Bordelaise (also add Prawns if you want)  Also only for the Christmas season for 2 weeks before the holiday Michael (the owner) makes his Dads rice balls.. so wonderful we usually do one as an appetizer for 3 of us and the taste is perfection.. And always hear the specials,, I recently had the risotto stuffed Prawns very well prepared.. Cant say enough good things about Fiorillos...", "name": "Fiorillo's", "rating": 5}, {"index": 79, "review": "The location is convenient and the food is nice. It's a good place for groups, although the price should be lower...", "name": "Fiorillo's", "rating": 4}, {"index": 80, "review": "Great lunch as usual.  Even though their dining room is pretty large, it is pretty darn quiet allowing for conversation.  Great place for a business lunch or romantic dinner.", "name": "Fiorillo's", "rating": 5}, {"index": 81, "review": "Perfection.  Every time.  We're working our way through the menu, and everything is delicious.  We have a couple food allergies in our family and this place does a fantastic job serving our needs.  Only place I've eaten EVER that always has great food, outstanding service, and doesn't cost $100 per person.", "name": "Fiorillo's", "rating": 5}, {"index": 82, "review": "Good quality food. It looks fancy, but after a few minutes the Italian flavor start to show up and it's a treat! !  There is nice food within aň family atmosphere! !", "name": "Fiorillo's", "rating": 4}, {"index": 83, "review": "Best Italian Restaurant in the Bay Area! Great for date night, family dinner or just with a friend. Staff is always nice and food is always great! Best lasagne out there!", "name": "Fiorillo's", "rating": 5}, {"index": 84, "review": "I have been to this restaurant two times already; both times with a large group of people. \nThe location is convenient. There is a small parking space close to the restaurant; otherwise, there is free parking on street. \n\nThe restaurant is small, cute, clean.large variety of Italian food; many dishes with sea products. Small choice for vegetarians who don't  eat sea-food. \n\nPolite service. \n\n3 stars: Crab Loui Salad. About $18. Blunt dish. Should be delicious, but was blunt, like they forgot to add more ingredients like lemon juice.  I compared this dish to the same salad I tried in Sausalito restaurant - it was amazing there. \nWe ordered a cake. Nothing special. We received a big piece of cake with a large spoon of cream. I expected more from this place: more delicate cake, less sweetness, more variety of cakes, better taste, better presentation. \n\nFamily- friendly.", "name": "Fiorillo's", "rating": 3}, {"index": 85, "review": "The service here is great. They were attentive to our party but the food was sub par. \nThere was nothing that stood out with their menu items.", "name": "Fiorillo's", "rating": 2}, {"index": 86, "review": "I came here for beautiful grandmother's birthday dinner. The complimentary Roy Rogers brought a smile to my face, but the delicious, steamy fettuccini with meat sauce brought a smile to my soul.  The restaurant flaunts a refreshing, high class atmosphere with the comforting sensation of a home cooked meal. 5 stars all around.", "name": "Fiorillo's", "rating": 5}, {"index": 87, "review": "Very mediocre for Italian food. Salad tastes like it came out of a prepacked plastic bag from a big box store. The prawns bordelaise description sounded better than it tasted. Overcooked fried shrimp coated in an oily batter served over a pile of fettuccine slathered in sauce. Though the white wine sauce was tasty it was overpowering and there wasn't a single vegetable on the plate!!\n\nDull interior, so so service and lack of authenticity for an Italian restaurant guarantees we won't be back. Be forewarned and find another place for an Italian food fix or extra carb calories :)", "name": "Fiorillo's", "rating": 1}, {"index": 88, "review": "I was in the mood for some Italian food and turned to yelp for some guidance. The menu had a vary of different pasta dishes including pizza and sandwiches... It looked good enough to satisfied my craving. I took orders for my peers to be picked up as well.\n\nHere was our ordered:\n1. Meat Ravioli and Spaghetti with meat sauce (which I got): I really enjoyed the spaghetti with the meat sauce and I was okay with the meat ravioli. You know that it was freshly made though. \n2. Baked Lasagna \n3. Ravioli filled with portobello mushroom with meat suace \n4. Grilled Breast of Chicken\n\nEveryone enjoyed their ordered and was surpised that it was actually good compare to other past places around our work area. \n\nThe location was a little hidden but I would say that I'll be ordering here from now on if I'm craving Italian food when I'm at work!", "name": "Fiorillo's", "rating": 4}, {"index": 89, "review": "We eat here about 1-2x's a week and always leave happy!  It's family owned, very friendly and not unusual for the family to be at restaurant.  A few of our favorite's - Stuffed mushrooms, Lasagna, Seafood Delight, Rigatoni with Chicken and pesto.  The selling point for my husband is the beer on tap and the 3 large screen TV's in the bar area.   Enjoy!!", "name": "Fiorillo's", "rating": 4}, {"index": 90, "review": "Friendly staff.  Great food.  Bread was perfect.  Price was very reasonable.  Staff a bit rushed but it was a Friday and they did a good job.", "name": "Fiorillo's", "rating": 3}, {"index": 91, "review": "I was there for lunch with a business networking meeting.   We had pre-ordered our meals and the servers were very cooperative and efficient.   We had a variety of meals and I heard some wonderful compliments about the chicken picatta, eggplant parmesean, and the Oysters Rockefeller.       \n\nOur overall disappointment was that we had requested a private room (or a quiet area) and we were seated in the middle of the main dining room.     This made it challenging for us to conduct our meeting.   We will need a quieter area in order to come back as a group.", "name": "Fiorillo's", "rating": 4}, {"index": 92, "review": "After seeing a friend post a picture of classic Florida shrimp pasta, I was having a bad craving for the stuff. I had looked at a few of the closer Italian restaurants in my area, but none of them had what I wanted. Fiorillo's had the closest thing to it, so I ordered pickup.\n\nGranted this was a Friday night, but wow was this place packed. I think they were having a special event, but the main restaurant was also filled. I had to park in the gym parking lot.\n\nThe menu is impressive, and the reviews I've seen are decent. The menu is definitely more carved out than some of the other Italian places in the area, which I feel gives this place an advantage.\n\nI got my shrimp bordeliase - it wasn't a perfect representation, but was good: garlic and lemon cream sauce that went well with the shrimp. They give you plenty - I had two meals out of the thing, which is appreciated. I would like to return, as this place seems better for dates than just Italian cravings, and I would like to crack into the larger menu.\n\nTip: They give you a side of bread, so you better like carbs if you order the garlic bread as well.", "name": "Fiorillo's", "rating": 3}, {"index": 93, "review": "I went here for a dinner party. The place was decent, only negative is dated booths. \n\nServers were very nice but weren't as frequent as I would of liked. \n\nI ordered the chicken fettuccine alfredo. It was very good. Creamy and loaded with chicken. Good size and very filling. \n\nOverall a good experience. Would come back.", "name": "Fiorillo's", "rating": 4}, {"index": 94, "review": "I really enjoyed Fiorillo. The staff was nice and the food was good. I think it was reasonably priced for an Italian restaurant. I don't completely get how some Italian restaurants charge so much for pasta. \n\nAnyway, had the fettuccini with chicken which was delicious. I'd recommend this place for a good night out.", "name": "Fiorillo's", "rating": 4}, {"index": 95, "review": "Fiorillo's is a treasure and a delight!\n\n\"Family owned\" has largely become marketing fluff these days, but Fiorillo's is the real deal. My wife couldn't wait to return after she discovered this dining-gem during a recent stay in Santa Clara. Turns out her enthusiasm was fully warranted, and I'm glad she dragged me along. \n\nThe food is scrumptious and the service divine. But what makes Fiorillo's most special is that you're treated like family BY the lovely family here. You'll remember how special they make you feel, and I bet you'll want to come back again and again. We certainly do!\n\nDon't miss Fiorillo's. We can't wait to return to \"the family!\"", "name": "Fiorillo's", "rating": 5}, {"index": 96, "review": "I love this place. Everything I've ever tried here is amazing!  Pizza, potato skins, pasta dishes. \nMy favorite is pasta romano.  The best! Scrumptious! \n\nThey have an open bar here. \nThey are closed on Mondays.", "name": "Fiorillo's", "rating": 5}, {"index": 97, "review": "Went on a Tuesday evening for the first time, and had no complaints whatsoever; only have compliments!\n\nVast menu and amazing food goes without saying. Generous, friendly staff makes this place stand out. Was given the option of the crowded dining room or the completely empty bar to be served dinner. I believe our server was the catering manager; she was a riot and very knowledgeable and attentive.\n\nStayed till closing time and they didn't rush us. Don't wait to try this place.", "name": "Fiorillo's", "rating": 5}, {"index": 98, "review": "This place is amazing! It's not your traditional Italian place. The new bartender is a delight. Will be going back soon!", "name": "Fiorillo's", "rating": 5}, {"index": 99, "review": "I thought that for this price point there would be better decor and better food. At an average of $18 per entree I was disappointed with the lackluster flavor of my dish (but we'll get back to that) and I feel like the interior is very reminiscent of a Hometown Buffet.\n\nIt started out well with the appetizers. We had calamari, caprese, and bruschetta. They were pretty good; the calamari was crispy and the bruschetta and caprese were well seasoned. I liked the bruschetta the most.\n\nNow back to the entrees. I ordered the veal chop special which came with a teriyaki glaze and a potato stack. At first bite it was good and the meat was tender but as the meal wore on I felt like the teriyaki glaze was not right for this dish (or the restaurant). Plus the melted cheddar cheese on the potatoes really clashed with the flavor of the meat. It would have been way better with a dry rub for the meat and replacing the  cheese with Parmesan or garlic. \n\nI asked other people in my group what they thought and they had similar sentiment about their entrees. \n\nIn terms of service it was good and the food came fast. Overall though I thought the food was only okay.", "name": "Fiorillo's", "rating": 3}, {"index": 100, "review": "Just went there the other night, and had their seasonal Rice Balls. They are not what you think. They only have them during the first few weeks before Christmas, and they are amazing. Hard to explain, but rice on the outside, meat, peas, and spices on the inside, covered in a red sauce. So delicious!! I also enjoy the focaccia bread! I can't stop eating it!", "name": "Fiorillo's", "rating": 5}, {"index": 101, "review": "This place has really good food. But the service can be hit or miss.", "name": "Fiorillo's", "rating": 4}, {"index": 102, "review": "I might have given 2 and a 1/2 stars simply because the food was colorful and generously proportioned, yet my Cesare Salad was drowning in dressing and the steak on my salad was tasty yet very salty and over candied in some kind of savory marinade that made it a almost funny texture. When the waiter first approached our table of 7, he ask around for drink orders but did not ask me. It was lunch time and I had missed my morning coffee so I waited for his return with the waters and I ordered my coffee. After 15 minutes I was just about to get up and ask for our coffees but they just arrived...  To my disappointment my cup was barely over half full and the other person's coffee was nearly full. The coffee was barely warm and a little weak. they had the little plastic creams of which in a restaurant as nice looking as this one I would had rather had a little picture of cream. The meal was over half way eaten when I had to flag down a bus person to ask for more coffee. Since the cups were small I felt they were trying to save money on dragging out the coffee refills. Finally when our plates were removed others ordered coffee. Again it took a long time to get them as our bill had come and was paid before the coffees came. On our way out I easily over heard the host talking rarely loud on his phone as he sat all comfy in the entrance hall on a bench. He had mentioned something about finding a dead rat. I could not believe he would speak so loudly in front of customers who were walking by, let alone mention such a discussing thing in a restaurant, that he works in. I am sorry to say that but it is true and a first for me. I can say that everyone seemed to enjoy themselves and the atmosphere and decor was actually very nice and the restaurant appeared very clean... I just feel the service people may need to have some etiquette training. But maybe I could suggest they address all those seated as if they truly mattered, bring the drinks right away, refill the coffee like they know coffee drinkers want at least 2 or 3 cups, and please take their private phone conversations away from the customers... I felt like I did not matter and was invisible to them. I mean dining out usually cost a person $20 to $40, and when I think about that, I do want better service than a fast food drive up window so I can be happy I went there. Just because the room was only 1/4 full for lunch on a Wednesday dose not mean they should slack in any manner. I need not return.", "name": "Fiorillo's", "rating": 3}, {"index": 103, "review": "We wanted a special evening  to have my fathers 80th birthday dinner. After talking to Michael Fiorillo we decided on Fiorillo's .\n28 family members came from all over the country. Michael worked with us on 5 entree options and all the other details. \n\nThe evening was a huge success, everyone at Fiorillo's was so accommodating. All the appetizers were fresh, salads were crisp and fresh, entrees were hot, and prepared perfectly from the veal rotilli to the chicken picatta, lasagna and eggplant parm.\n\nWe couldn't have asked for a better evening the whole restaurant sang happy birthday to my Dad. Everyone commented on how good the food was. I Highly recommend Fiorillo's for the food and service above and beyond the average!", "name": "Fiorillo's", "rating": 4}, {"index": 104, "review": "Awesome food! The chicken parmigiana is SUPERB! Kudos to Mike, the chef, for making it such a wonderful experience over all. Service was impeccable. Really a great spot that both is large in appearance yet has that \"home in the wall\" feeling. Will be coming back again soon! Also had a great banquet room for large parties!", "name": "Fiorillo's", "rating": 5}, {"index": 105, "review": "Family restaurant with excellent Italian cuisine and a friendly staff who goes the extra mile to make their customers enjoy the dining experience.\n\nFrom pasta dishes to veal with fresh sauces,  unrivaled seafood selections and deserts that make you ask for seconds this is a family owned and run restaurant that will make you feel at home with every visit.", "name": "Fiorillo's", "rating": 5}, {"index": 106, "review": "I celebrated my birthday with a group of friends last night at Fiorillo's.\nChristina was our waitress. She was attentive, fun and very efficient. She took care of every detail. She made my day very special. The food was great...as usual. It is a wonderful family restaurant. High praise for the lemon drop! That bartender can mix a great drink!!", "name": "Fiorillo's", "rating": 4}, {"index": 107, "review": "Would give zero stars if possible.  An absolutely terrible owner", "name": "Fiorillo's", "rating": 1}, {"index": 108, "review": "The gluten free pizza is no better then frozen grocery store pizza at three times the price.  The antipasta platter is rolled up lunch meat and cheese, not good Italian meats and cheese.  Wine is overpriced.  The only good dish was the coiled sausage. I'm betting there is not an Italian cooking anything in this place.  No better then Olive Garden,  just way more expensive. Had to ask three times for a glass of water.  Bill was over $100!", "name": "Fiorillo's", "rating": 1}, {"index": 109, "review": "It doesn't get anymore Italian than this family owned and run spot in Santa Clara! I've been going to this place since 1982, never a bad meal, and outside of Italy, you would be hard pressed to find a better Italian place to eat! People that complain that there is a Chinese salad on the menu, wake up! They only try to appeal to some hard to please customer, and to that, I say Thank you Michael and family! This family has worked very hard to make this a wonderful and delicious place to eat, it has since they opened and will do so in time to come. The best Italian Restaurant in the Silicon Valley!", "name": "Fiorillo's", "rating": 5}, {"index": 110, "review": "POPULAR ITALIAN RESTAURANT IN THE SOUTH BAY\n---\nTHE DEETS:\n- Located right by Santa Clara University\n- Very spacious, big enough to have your wedding!\n- Frequented by seniors and your local Italians\n---\nON THE MENU:\n- Average Italian-American fare, can't go wrong with the pastas.\n---\n- OVERALL:\n- I recognized a few local Italian-Americans when I came here. I think everyone comes here. I feel that the mob boss' daughters love this place. I'm not big on Italian food, but the food here did not disappoint. I didn't throw my food back at the waiter is what I'm saying. But I'm also not saying that the food here was something to write home about. A-OK Italian food in my book.\n\n#446", "name": "Fiorillo's", "rating": 3}, {"index": 111, "review": "Nice place for a dinner date or small party dinner event.  The bread was soft and warm.  The mushroom appetizer was flavored well.  The main dish was so big that I needed a to go box.  The service was nice and professional.  The only problem was the parking.  It not easy to spot and limited spaces.", "name": "Fiorillo's", "rating": 4}, {"index": 112, "review": "Our experience here was great. The place seemed relaxed. It wasn't real busy. Just a few big families. Lots of booths available. Our server was dialed in. The hostess was not available @ our entering for 2-3 minutes then we were seated. She was nice. The crews we're working as a team in the dining room (water and or plate removal, boxing and courteous.\nThe kitchen put out some bomb tasty Crab Stuffed Mushrooms and Italian Pasta dishes. The Special Peppery Bread Sticks were xlnt to me. The fresh loaf bread was very good. Lasagna, some Rav's and pasta. Meat sauce was tasty, w low acidity, good, rich.\nThere were plenty of leftovers. Too much chow. Plates could be shared unless your really hungry. The White Zin and Crema Pino G were tasty. The Spumoni Gelato was great at the end. Tip was well deserved.", "name": "Fiorillo's", "rating": 4}, {"index": 113, "review": "Always love going to a mom and pop Italian place even when it is this fancy a building and layout.\n\nThey have a great professional staff and a menu with lots of red, white, seafood, meat and pasta choices. Everyone loved their food. I had the ravioli in marinara with sausage. It was terrific and just enough. The cioppino across the table disappeared in no time. If you are going to do real Italian, Chianti is a must. And don't forget to leave room for a cannoli! \n\nCall me immature but I just love the black sinks and toilets in the restrooms. It is so Godfather!", "name": "Fiorillo's", "rating": 4}, {"index": 114, "review": "I decided to take my girlfriend out here for her birthday. The food was ok; honestly, I wouldn't rave about the food.\n\nThe staff was cool, friendly and awesome to work with. Went in a day prior to drop off a custom cake, and the staff brought it out exactly at the right time after our meal. Restaurants need more of these people. :) They made it a perfect night for us. Thanks again.\n\nThe restaurant looks really nice on the interior; it also has a banquet hall for big events. The place has a bar and cool wine selection - have imported wines which I think is kinda neat being that California is a big wine state.", "name": "Fiorillo's", "rating": 4}, {"index": 115, "review": "3 stars because the service was good, other than that the food was a 2 star rating. We live in the Bay Area and Italian restaurants are a dime a dozen. Nothing about this food screamed homemade or fresh ingredients or wow this is new/different. I would say pass, not worth it. The outside makes the restaurant look nice but the inside is no better than a Denny's. I had the spaghetti and meatballs which was average. My table also got the bruschetta which was not fresh. My guess is they make it in advance because the tomatoes are all darker red and all seemed to be a similar color. Either way, not the best restaurant if your craving Italian food", "name": "Fiorillo's", "rating": 3}, {"index": 116, "review": "I love this place! Great Italian American food. Nice atmosphere. Excellent service. We always ask for Christina as our waitress, she's a gem! So personable, friendly, helpful and attentive. I feel like a family friend when I dine here. \nSo many good to excellent dishes to remember, but here are a few of my faves on the menu; The New Contandina (a unique dish with potatoes instead of pasta, a huge portion, I always have leftovers. So good!). Pasta Romano (savory cream sauce with mushrooms and peas, simple yet so good!), Eggplant Parmigiana (classic and awesome). Seafood Pasta Fiorillo (kinda Cioppino like over pasta, very good!). And another fave off menu special they always have is a Veal Chop in a teriyaki-mushroom glaze, it's awesome! Great pizza as well. My favorite marinara sauce anywhere is here! That says a lot. The warm bread served before dinner is great too! I have brought friends and family to dine here and everybody loves it. I do recommend going early (around 5pm or so) on weekends as they get busy. I have been going there for around 10 years at least 4 times a year or so and have never had any negative experiences. Though it can get a little pricy with drinks and appetizers, but it's not an everyday restaurant for all. I would consider it a nice place to celebrate a special occasion, or a nice date nite destination. Defiantly a good place for a family get together. They also have a banquet room for parties and special occasions.\nI highly recommend Fiorello's!", "name": "Fiorillo's", "rating": 5}, {"index": 117, "review": "Our family is here no less than once a month. It is that good. You will see: the Menu is vast- food is super- I default to pasta and fish entrees - never disappointed. The kids are big steak eaters - and want to know why I can't cook like Fiorillos. The owner is a great guy- there every night.", "name": "Fiorillo's", "rating": 5}, {"index": 118, "review": "Went for Valentine's Day 2015 for the first time and everything we had was amazing from the food to the service! It was a ore made valentines menu but we both found something that appealed to us, lobster ravioli for me and jumbo shrimp scampi for him! They both tasted as good as they sounded and we ordered the crab stuffed mushroom after reading it was highly recommended and they were bomb! Most of all the service was great which always makes the dining experience that much better from the host, to the server to just a couple different servers walking by! I would definitely go back! :)", "name": "Fiorillo's", "rating": 5}, {"index": 119, "review": "This place is amazing!! food is a piece of heaven. I had the pork chop special. Great appetizers and drinks. Charlie our waiter was the true definition of superior customer service. If you want a fantastic dinner with outstanding Service this is your place!!! Thank you Fiorillo's for a Wonderful Dinner and Great Drinks!!!! 10 Stars.....", "name": "Fiorillo's", "rating": 5}, {"index": 120, "review": "Went here during a company outing as we had 20 people come in for lunch.  The place is near Santa Clara University, but thank god the signs were big.  The place inside was very nice and elegant which I enjoyed.  The seating was quite awkward as we had tables spread out with a booth right there looked something like this ===)  Anyways the service was good, but wish they brought out the bread as soon as we came in as most restaurants do and I missed the olive oil as well.  Prices are not bad for the portions you like and I mean you do get a lot of food.  Some food looked really yummy and some looked really greasy.  I ordered the new contadina which had potatoes, onions, mushrooms, prawns, sausage, chicken and steak. They do give you a lot and not too cheap on that.  One thing I found interesting for an Italian place is that they serve Chinese Chicken Salad, hamburgers and other sandwiches.  I know they are near a campus, but I think they should just make it all Italian for god sakes :)", "name": "Fiorillo's", "rating": 4}, {"index": 121, "review": "My favorite Italian restaurant by far! Everything is to die for!!\n\nThe appetizers I love are:\n-mushroom caps bordelaise\n-bruschetta \n-mozzarella caprese\n-anti-pasto plate\n\nAnd I especially love the freshly baked bread and little garlic Parmesan squares. \nWhat's really yummy is when you dip your fresh baked bread into the mushroom caps bordelaise sauce. OMG..,, it is incredibly delicious!!\n\nFor entree's I like:\n-ravioli's \n-pretty much all of there pasta's\n-pasta romana\n-veal piccata\n-lasagna\n-and many many more. \n\nThe food is incredible, the service is outstanding and the atmosphere is always warm and inviting. They make you feel at home here.", "name": "Fiorillo's", "rating": 5}, {"index": 122, "review": "I love the family atmosphere! \n\nI used to come here when I was younger with my sister and brother-in law. I love their linguine and clams in white wine sauce. Its my go to meal when I come here. \n\nOver the past couple years, they changed their hours. One time I came and they were closed, which made me sad. \n\nBut I can say the food used to be better. But their linguine and clams has never let me down :)", "name": "Fiorillo's", "rating": 4}, {"index": 123, "review": "Ok so I'm a Sicilian from Boston now living out here for a little over a year now. And since I got here, I've had one mission...\nFind a great Italian restaurant!!! So I've tried many places and saw this place and it did show promise. But again, and again and again like every Italian restaurant in all of San Jose .... epic fail !!! So this is my first review of many and sorry to the trainee waitress, good kid,she tried.... Me and the mrs were wierded out when we first walked in to see the restaurant is one big room, like it's a cafeteria, \"PUT SOME DIVIDERS UP\" but we got a booth and we were happy about that.the food on the menu is described well and looks good.. The waitress came over and was very pleasant and profession and told us she was training and it was her 2nd day and she took our drink orders and returned with them and bread and had a great attitude.. So cudios to you trainee...Great job!! Then all of a sudden it went sooooo wrong!!! Our actual waitress came over and was way to over-bearing,loud, and creeped us right out she took our order and left... And then the food came out,for apps we got the mushrooms, crab cakes and fried raviolis to start mushrooms were blah,fried raviolis were frozen out of the box little pieces of over fried crap, and those poor burned crabcakes.. Just sad-face No words!!!! Now the entrees come out the mrs got the grilled salmon with ceasar salad and I got chicken parm with raviolis... The salad came out with this aweful smelling piece of salmon that the cook tried to mask by dumping a cup of garlic all over the salmon to try to mask that smell, but we both could see it and smell it!Shame on you guys!!! Now being from boston I got the very simple, chicken parm with raviolis.. The chicken parm was swimming in a huge casserole dish under a pound of marinara and a terrible gummy cheese. SO....I've excepted that most fake Italian restaurants will use frozen or boxed pastas and I'm cool with that. But what's up with this \" OUT OF THE CAN AND INTO THE PAN CRAP\" I came up with this term now for restaurants who use crappy pre-made sauces instead of having some integrity and honor and making ur own... And taking these sauces and pouring olive oil and garlic in them doesn't make them homemade either... GET SOME TOMATOES AND BEAUTIFUL FRESH HERBS AND MAKE UR OWN!!! And it's actually cheaper too.. And then in the middle of our meal we heard the loud ass mouth manager yell at this poor waitress across the room and was totally embarrassing her.. What a dueshe and that's when we just looked up and paid the bill and left... Sorry for this long review but I've had enough of these wanna be East coast Italian restaurants!!!", "name": "Fiorillo's", "rating": 1}, {"index": 124, "review": "Fiorillo's has been around the corner for us, but we had never tried it.  We decided to visit to celebrate our daughter finishing finals.  We were seated fairly quickly with a reservation.  Initially we were seated in the bar area because there were no tables available, but we requested to be moved because the language being used in the bar was inappropriate for a young teen to be hearing.\n\nService:  Our service started out OK, but quickly went downhill after our orders were taken, and a large party was seated next to us.  \nWe didn't receive water with our meal and had to find someone to other than our server to get it because he wasn't around.\nWhen our appetizer finally came out it was luke warm. \nOur sever seem irritated that we had someone else refill our bread (we were so hungry during the long wait for our meal my husband flagged someone else over).\nEach time our water/refreshments were empty we had to find someone to refill them.\nNever received our salad.\nServer had to find fresh ground black pepper instead of having it on hand when our meal was served.\n\nFood: \nHouse Chianti: $8.00 was overpriced  for a glass.  TJ's two buck chuck will make you happier!\nMushroom Caps Bordelaise:  Luke warm and a bit too salty.\nChicken Marsala: Generous portion, but lacking flavor.\nLinguine and Clams: Steamed clams were fishy, but the clams in the sauce were fine.  Watch out for the pieces of clam shells in the linguine and sauce. Sauce was not memorable.\nGnocchi: Nothing to write home about - marinara sauce tasted like it was jarred sauce.\nCaesar Salad:  Who knows we never saw our order and when my husband asked about it, it was so late in the game the server said, \"Well you don't want it anymore do you?\"\n\nSadly we were not impressed - disappointing since we had hopped to have found a local spot to come to on a regular basis.  A note for Fiorillo's - limit your reservations if you don't have enough staff to serve well.  Note for the server - if you blow it and clean out forget something, at least have the class to comp a glass of wine or an appetizer to make up for your mistake.  That type of small gesture make things more forgivable in a customer's mind, as well as says, please give us another try.", "name": "Fiorillo's", "rating": 2}, {"index": 125, "review": "Amazing food, great staff and great family who own the restaurant! I had the ravioli toscana the other night & I can't stop thinking about it. Everything on the menu here is high quality. This is not your average Italian joint, it's high class.", "name": "Fiorillo's", "rating": 5}, {"index": 126, "review": "This is a pretty typical Italian restaurant. The menu has lots of items but I was not blown away by anything in particular. The staff is very friendly and it is a good short distance from SCU. The banquet room is good, but it is a pain when they have drunk students barfing in the bathrooms when you are trying to eat in the main dining room. Last time I was there a gaggle of sorority girls were in togas (also not appealing at dinner) and spewing in the ladies room... not a great dining experience. I will go back but only for work related things. Also closed on Monday so that is not good for business dinners.", "name": "Fiorillo's", "rating": 3}, {"index": 127, "review": "I haven't been here in so long (moved out of town) so I couldn't wait to try some things on the menu. My friends and I tried the bruschetta, crab stuffed mushrooms, crab cakes, Caesar Salad and shared a pizza also. Everything was delicious and I will be back soon! I love how personal this place is and it seems to be pretty busy.", "name": "Fiorillo's", "rating": 5}, {"index": 128, "review": "This place is delicious! A friend told me about ordering the cioppino which is not on the menu. But if you can get it you will be wowed! Very high quality and an abundance of seafood. I've been there twice and will go back again. Excellent service as well! Yum!", "name": "Fiorillo's", "rating": 5}, {"index": 129, "review": "Best restaurant in Santa Clara.  The location feels safe.  Facility is clean and well maintained.  I love that it's a family business.  When we first started going there we'd see the current  Chef's father running it.  The son went to culinary school and is running the kitchen now.  The staff has many long term employees that are very attentive in addition to newer staff that are equally as interested in the guests experience.\n\nThey have a separate banquet hall that is lovely.\n\nThe food is so absolutely delicious that we do not go to any other Italian restaurants.  We dine-in and take out.  Hubby loves the lasagne.  I'm a big fan of angle hair w/meat sauce.  Though, the baked prawns are fantastic also.  \n\nThe bartender makes great mixed drinks, a lemondrop for me!\n\nIf you are trying to choose an Italian Restaurant, go to Fiorillo's.  Don't waste your time at the famous restaurants in places that are unsafe and inconvenient parking.  You'll be happy you did!", "name": "Fiorillo's", "rating": 5}, {"index": 130, "review": "I have no idea how I've missed this place. It's apparently been around for decades! I told my family I had eaten at this great Italian spot in Santa Clara and when I told them the name their reaction was \"Oh yeah, we used to eat there.\" What?! Who's we?! You never brought ME with you. \n\nOnto the good stuff: I ordered the chicken parm. Good god was it amazing. Fair warning... it's baked and served in a bath of marinara. This is a plus for me. Their sauce is great. Lots of mozz, lots of sauce, a nice Chianti. No really, I had a glass of Chianti. And it was nice.\n\nTry it. You won't be disappointed.", "name": "Fiorillo's", "rating": 5}, {"index": 131, "review": "I had lunch with a friend there today and I am very disappointed. horrible experience. I ordered their soup of the day, it was very salty and I found a hair in it (no body apologized for having a HAIR in the soup) for main dish, I ordered their \"today's special\" pasta, I have never had anything as poor quality and as bad tasting like that. I love Italian food and eat a lot of pasta but after this experience I dont think I want to eat Italian for a while now :( \nThe worst part is that Ive gone to the bathroom 4 times in a couple of hours, since I got back.", "name": "Fiorillo's", "rating": 1}, {"index": 132, "review": "Let's start with the food.  The food is incredible!  I know it does not sound Italian but the Chinese chicken salad is the best!  Just because it is traditionally an Italian restaurant the cooks are rockin' it in the kitchen with Chinese salad too! The chicken parm is super yummy - it's a Italian Classic done to perfection! The menu is large and there is something for everyone with large portions - you cannot leave hungry; it's just not possible!  It is always a sweet idea to finish your meal off with a creamy dreamy slice of cheesecake for the totally perfect food experience.  The service is excellent and Charlie is the best server ever.  Charlie never disappoints with his prompt service and friendly smile.  This is a must frequent for everyone who wants to feel the food love!", "name": "Fiorillo's", "rating": 5}, {"index": 133, "review": "If the majority of patrons (who looked over 50) had iPhones and Yelp, this would be a 4 and a half star establishment.  Solid service and food.  Old Italian - love it.  The owner lady checked up on us and the waitress we had was really sweet and patient.  The homemade pasta was on point and the \"special\" steak was pretty good.  The little garlic bread crisps were good too.  This is a good place to bring your parents or a date.", "name": "Fiorillo's", "rating": 4}, {"index": 134, "review": "The build your own calzone is excellent. The largest calzone I have ever been served.  Also try the tiramisu.", "name": "Fiorillo's", "rating": 3}, {"index": 135, "review": "We came here for my friends daughters 10th birthday. We sat down and right away a server greeted us. He ask for our beverages but we had just sat so we asked for more time. It was our first time so we asked for suggestions but we got a generic ' everything is good here' . The food came out and everything was overcooked. The calamari, shrimp, chicken, mussels all were over cooked. Towards the end of our meal a busser came by and asked if we were finished and wanted to box our food when we were clearly still eating. We all felt rushed out. Our server was no where to be seen after he dropped off our main course. One of the busser took care of us the whole time making sure that our drinks were full and plates where cleared and food boxes. Our plates were on a are age around $18. Overpriced and server was not friendly.", "name": "Fiorillo's", "rating": 2}, {"index": 136, "review": "I've driven past this place a few times and it's always peaked my curiosity. After reading some reviews and considering some of the negative reviews, I decided to take a chance and give it a shot.\n\nI recently went and was seated very quickly, the staff was very friendly and helpful. There are many choices of food to choose from. After ordering, our food came out within 10 minutes or so. The food was good and the portions were huge. All of us ended up taking leftovers home. I'm not a huge leftover fan but, after reheating it, it was still tasteful. \n\nI would recommend anyone to attend this place for dinner.", "name": "Fiorillo's", "rating": 5}, {"index": 137, "review": "Wish I could give 0 stars! All the food was horrible and the service was the icing on the cake! We ordered the veal parmigiana and it was disgusting! Haven't had veal for years and was really looking forward to it. It was very thin, overcooked and hard and tasted gamey. Also, their meat sauce tasted really weird too. We went on a weekday around 1pm and there were only 3 small parties in the entire restaurant, yet we waited a very long time for everything. Lots of food left over which we brought home and very quickly threw in the garbage. It smelled awful! All this to the tune of $118.00 and their tip register was 17-20%! Never again! We too are real Italians and this place was an insult!! Don't throw your money away like we unfortunately did.", "name": "Fiorillo's", "rating": 1}, {"index": 138, "review": "Fiorillo's is a nice restaurant that's spacious in side and has nice decor however the food is just ok.  Yes, I would come back again but not any time soon.  I guess its one of those places where you only go when there is a large get together with friends or for a celebration.  \n\nThe night we went there was a large wedding going on in the banquet room so the parking was quite horrendous.   Service was on the slow side but was still acceptable.  It just took a long time for our food to arrive.\n\nIn summary, ok food but if you cant find parking skip it as its an indication that there's a large event going on and service will be slow.", "name": "Fiorillo's", "rating": 3}, {"index": 139, "review": "I'm a calamari freak and asked about theirs and decided to order some. It was dry and overcooked with no flavor. We had a bite and decided not worth the calories and set it aside. The waitress asked if we liked it and we said it was overcooked and dry and she said \"oh, If people ask if it's good again I'll say it's not\" = bullshit. \n\nWhen it was time to get the check I told the bus boy that the calamari was not good and he took it. Much time passed and the waitress came out and said that they triedi t and it's not normally like that, it was overcooked and since I had even asked if it was good they will take it off the bill. WTF it's crap so it should be off the bill and I shouldn't have had to mention it twice. I was glad to have it credited but felt like I was in debate class that made me uncomfortable. The rest of the meal was good but nothing worth returning for.", "name": "Fiorillo's", "rating": 2}, {"index": 140, "review": "The restaurant is nicely decorated, booths and pictures, clean and crisp and friendly.\n\nAll three at our table ordered the eggplant parmesan.  We all agreed the the eggplant was overly breaded and the sauce much, much too heavy.  ...so heavy in fact that there was no eggplant flavor.   The excess bread crumbs created a mealy texture which was not right.  This is not how the dish should be prepared.", "name": "Fiorillo's", "rating": 2}, {"index": 141, "review": "East coast Italian food at its finest.  I've brought many transplants to this restaurant and we have all agreed that it is spot on.  Even their wings and pizza are solid options.  The service can be a little slow sometimes, but is usually very good.  I've never minded sitting in the dining room and having slower service than one would receive at a \"turn and burn\" restaurant because when I want to EAT, I go to Fiorillos.  I asked a professor from my school, Hey Dr. Desarbo, have you ever eaten at Fiorillos?  To which he replied, Fiorillos? That's the only place I eat!  \n\nIf you miss East coast Italian food, NYC/NJ grub, then check this place out.  If you're a California native, you may not appreciate it as much so fuggedaboutit and take a lap!", "name": "Fiorillo's", "rating": 5}, {"index": 142, "review": "I arranged for and we held our company's Holiday Luncheon at Fiorillo's Restaurant.\nThere were 18 of us.  The tables we not set up as discussed, the \"Gift Table\" was not set up.  The bartender was on her first day and had to look up how to make each cocktail. (Good thing I ordered white wine).  Pre-ordered appetizers were not ready The server tried her best with us, and I have no complaint with her.  She was overwhelmed and had little to no assistance,  the food was marginal (Chicken Parmesan-The chicken was so tough it was inedible).......  \nWe had fun, but will never recommend that restaurant for anything more than a casual dinner for two, or so.", "name": "Fiorillo's", "rating": 2}, {"index": 143, "review": "The place was deserted on a Friday night. The food was ok.", "name": "Fiorillo's", "rating": 3}, {"index": 144, "review": "Went to this place last night 01/12/15. Have driven by there a million times and finally thought of checking it out. Food was ok, nothing to write home about. The girl that served us did a good job and that's why I gave it 3 stars. The place is very bright inside. Totally gave it like a buffet feeling. There was about a 20min wait to be seated. I'll skip this place in the future.", "name": "Fiorillo's", "rating": 3}, {"index": 145, "review": "I wasn't sure what to order since it was my first time dining here so I decided to browse the restaurants yelp photos and came across a photo with the description, Daily Specials: Artichokes and shrimp tossed in red sauce with angel hair. Sprinkled with Parmesan cheese.  \n\nSince it was a daily special, it wasn't on the menu. I asked the waitress if I could still order that dish. She immediately went to ask the chef and returned with great news. I think this was one of the best pasta dishes I've ever had! The red sauce had a subtle kick of spice to it. I hope they consider putting it on their menu permanently.", "name": "Fiorillo's", "rating": 5}, {"index": 146, "review": "I've been here twice while visiting the area and we love it. Service is excellent, good variety of food, and fair prices considering the ample portions. Everything we've ordered has always been flavorful and served hot. Try the lasagna....it's one of the best I've had.", "name": "Fiorillo's", "rating": 5}, {"index": 147, "review": "We had a wonderful dinner here this evening. We started off with caesar salad,  my husband enjoyed the delicious perfectly grilled Veal Chop with mushrooms, and I had the yummy Shrimp Scampi with Linguine!  The service was excellent, our server, Danielle was a pro, very attentive and friendly.  We ended our meal with coffee and a cannoli.  Definitely will come back, great food, wine and service!", "name": "Fiorillo's", "rating": 5}, {"index": 148, "review": "Great place near Santa Clara Univ. greeting and service is good. This was my first visit and was just looking for some light stuff. I had their signature stuffed mushrooms and a salad. Although I only had those two items, it was really good. Definitely worth a try.", "name": "Fiorillo's", "rating": 4}, {"index": 149, "review": "My coworkers and I had a farewell lunch here on a weekday and it would be any restaurant's nightmare.  17 people ordering all at once.  Now, I've watched enough reality cooking shows to know how big a pain in the ass a table like that is.  In this situation, I decided to give our server and the kitchen a wide berth to execute our orders.  They had seven different specials that weren't on the menu.  That is more than enough for a server to recite over and over again in a day.\n\nOur server did a fairly decent job with us.  She asked us for drinks when we sat down and after a while, got us our bread.  It did take a while to get our food but it did indeed come.  Out of our entire table, about seven of us had food that was too salty.  Mine was included amongst them.  At first, I didn't think it was excessively bad.  It was slightly salty but tolerable.  Later on, as the food sat in my stomach and the food got colder, I realized it was actually very salty.  \n\nWe conveyed our concerns with the front of house manager and he did assure us that he will inform the kitchen and offered to re-fire the salty dishes to make them more palatable.  Unfortunately, we were near our end of lunch hour and couldn't afford to wait any longer.\n\nAs I've been here only one time before without issue, I can only guess that this may had been a fluke due to our large party.  In essence, Fiorillo's may be worth another shot for a smaller more manageable group but now I don't think that I can consider them for a large party.", "name": "Fiorillo's", "rating": 2}, {"index": 150, "review": "Came here with my husband awhile back and i have to say i really enjoyed it!\n\nlove when i hear people speaking in Italian! it reminds so much of my dad who is gone now but missed!\n i go here and i can feel like I'm hearing him! i love the language !\n\nI understand only a little not enough to even get by, but my father and Nana spoke it all the time and coming here brings back there memories and yes there food was also good! will definitely be back!", "name": "Fiorillo's", "rating": 4}, {"index": 151, "review": "Great place. Good service. Had the lasagna and it was tasty. I recommend coming here for very good Italian food.", "name": "Fiorillo's", "rating": 4}, {"index": 152, "review": "Fiorillo's put a Google Offer out for $30 worth of food for only $15. I thought it'd be the perfect opportunity for my friend & I to give 'em a shot since we've never been. They're tucked away in a weird 1/2 residential, 1/2 commercial area so I'd always forget they're there unless I'm driving right by them (which isn't very often).\n\nOK, moving on to the food:\n\n1. Complimentary Seeded Bread - This was the best bread ever! I could have eaten just this alone & would've been happy! Warm & crisp on the outside, tender on the inside...DELICIOUS!\n\n2. Deep Fried Ravioli appetizer - 4 huge raviolis filled with cheese & served with their marinara sauce. This tasted pretty good (however, please read the end of my review)! I have only had something similar at the Olive Garden lol.\n\n3. Whole Wheat Pasta with Meat Sauce & one Meatball - I know it's hard for restaurants to get the timing of the cooking right for whole wheat pasta. For some, it's really challenging...not cooked long enough so it's tough OR overcooked so it's a bit mushy. Well...theirs was a tad bit on the mushy side, not terrible though. The sauce was really good. Their meatball was tasty but TOUGH. I like to think it was because they used very lean meat, I'm hoping at least. \n\n4. Sausage Sandwich with Steak Fries - My friend made a comment that their sausage was a lot \"softer\" than other sausage sandwiches she's tried & that she likes a good, firm sausage for her sandwiches LOL. Yes, she actually said that & meant it! She said it was alright but probably wouldn't order it again.\n\nNOW...the reason why only 3 stars...we BOTH had upset stomachs only a couple hours after having lunch here. I thought maybe it was something we ate for breakfast that could have caused this so I asked what she ate in the morning. She had a banana & cup of coffee, her usual routine. I had a small bowl of fruit & a cup of hot tea. SO, it had to be the food here that made us feel a bit ill. Since we both had the ravioli & marinara, we're assuming this was the culprit. It couldn't have been the hot bread & cold butter.\n\nWould we try it again? Well, I can't speak for my friend but I might give them another shot. There's plenty more on their menu than just pasta. I saw huge salads coming out that looked delicious & with their bread...I'm sure I'll be fine. Yeah, I might return...", "name": "Fiorillo's", "rating": 3}, {"index": 153, "review": "Place is excellent food is great also portion wise never a bad experience when I come here it's always great opened space unlike some italian joints In SF. Fiorillos has a loyal\nCustomer in me I use to go to cop out italian joints like olive gardens etc.but once this place was so respectful and courtesy I honestly don't eat italian cuisine anywhere else. An older gentlemen was sitting next to us and table across from us with his people and not knowing who he was but when the waiter came gave us out check out of the blue he snapped his finger like paulie gaultieri(the sopranos) and told him to go get ice cream for the kids and there was about 7 kids in our party and it was on the house with no humbug. so that's when i figured he was the owner....great man god bless you", "name": "Fiorillo's", "rating": 5}, {"index": 154, "review": "My wife and I went to Fiorillo's for the first time tonight.  \n\nThe positives: First and foremost, the service is absolutely top notch.  Christina was our server and she was attentive, very personable and seemed to take a genuine interest in making sure we got a fine dining experience for our money.  She made some suggestions to us which we found very helpful.  At first I thought maybe we just lucked out by getting one of the better servers, but after observing what was going on at the other tables I discovered that all of the servers are like that.  Great service can make or break a restaurant, and this place is obviously smart enough to see that.  \n\nAlso, we were seated immediately and didn't have to wait long for any part of our meal, but we never felt like we were being rushed.  But a word of caution: we arrived at about 5:30 on Saturday evening and the hostess informed us that things pick up a lot around 6:00.  And she was absolutely right: by the time we were done with our meal the place was filling up fast.\n\nThe place was very clean and well kept up with a good ambiance.  They have enough staff walking around checking on you, so you never have to flag someone down if you need something.  The menu was quite extensive and there were some great desserts to choose from as well.\n\nThe not-as-positives: This place is on the pricey side.  The food was very good, although I can't say it's any better than some of the less expensive Italian restaurants that I've tried in Santa Clara.  I will say that the foccacia and the loaf of bread that came before our meal were better than what you usually get at restaurants.  I specifically asked for no Hollandaise sauce on my veggies and this request was forgotten, but to be fair I never mentioned it and if I had I'm sure it would have been remedied immediately, considering how wonderful the service was.\n\nAll in all, this is a great place and we thoroughly enjoyed our evening out.", "name": "Fiorillo's", "rating": 4}, {"index": 155, "review": "This is our 2nd time coming here for dinner in the past 6 months.  We live in the SF area and had to come to Santa Clara for an appt. I have to say, I really enjoyed my dinner both times.  We definitely will come back again and again.  Our server tonight was Jen.  She so sweet, and made our dinner very enjoyable with her kindness and sweet smile. I recommend this place and look forward to coming back with my family.", "name": "Fiorillo's", "rating": 5}, {"index": 156, "review": "Ive been coming here for so long they know me and my family. This place has always been a family favorite for special occassion dinners and what not, they make their own pasta which is amazing! My favorite thing to get is the collossal prawns, on the menu it is made with a red sauce, but they used to serve it with a white sauce and that tastes SO much better in my opinion, youll definitely need to ask the server about it. Usually the chef has no problem making the white sauce as long as it isnt too busy, which is understandable. if they arent able to make the white sauce i settle for the baked jumbo prawns! it comes with pasta and its pretty delicious, a little oily but I still think it tastes good.", "name": "Fiorillo's", "rating": 5}, {"index": 157, "review": "Fiorello's was once a wonderful little restaurant on El Camino Real near Scott Blvd in Santa Clara. It was friendly, family run, and priced right. It was so successful, the owner did what many restaurateurs do: moved to a larger, grander location.\n\nFiorello's is still friendly and family run. The interior is very grand, but the food is too pricey for mediocre.", "name": "Fiorillo's", "rating": 2}, {"index": 158, "review": "First let me say that a friend introduced us to Fiorillo's over 30 years ago and it is only getting better every year.  You will not find better Chicken Marsala or Saltimbocca anywhere .  The Marsala is not made with that sickening sweet Marsala, its made with the dry Marsala and is too die for.The Lobster and corn chowder should not be missed.My husband had a rib eye that was so delicious and seasoned, as well as cooked perfectly. It is hard to order new things because the Marsala and Satimbocca are an obsession and have been since the first time we tried them over thirty years ago, but after having the rib eye and chowder, I have decided to branch out more.   The bread is amazing and the service is always impeccable.\nIf you are on a low carb eating plan, try the Marsala over veggies. I get that for lunch all the time.\n\nThis is a family owned restaurant and they are just about the nicest people you will meet. They also do a fabulous job catering.\n\nWe have a ladies group that will be having lunch there on Thursday and I am very excited to try a new dish the owner Michael recommended.\n\nNancy S.", "name": "Fiorillo's", "rating": 5}, {"index": 159, "review": "Fra Diablo not hot enough but tasty. Lingunie with white clam sauce very creamy and tasty clams.", "name": "Fiorillo's", "rating": 4}, {"index": 160, "review": "Recently moved into the area and drove past here multiple times and we finally gave it a try.\n\nFirst time around, we came in on Valentine's day with a rather early reservation.  We got seated within minutes of checking in.  We waited a good 15 to 20 minutes at our table before we even got acknowledged by anyone.  Finally, the hostess finally realized our waitress never greeted us.  It took an extra 5 minutes before our waitress decided to say hello.  She finally went over the specials etc and took our drink orders.  It took them another 10 to 15 minutes for her to bring out our drinks.  When she finally brought our drinks out and took our order.  Our food came out fast but when waiting for our tab and for her to run our card took forever.  It was busy at the moment and I'm not sure what the hold up was.\nWe were here again the other night for my mother in laws birthday dinner.  Again we had reservations and for some reason there was some confusion upon checking in for our reservations.  After a waiting a few minutes, we finally got seated.  And of course they weren't busy this night.  This time around we waited a go 20 to 25 minutes for our waiter to greet us.  Not sure what the hold up was, they weren't busy at all.  He finally acknowledged us, took our drink orders, left and took another 15 to 20 minutes for him bring out our drinks.  He then took our orders and it took him awhile to bring out the bread, salads and soup out.  I don't how much I have to stress that the service here is really SLOW! It took them awhile to bring our dinner out.  The food wasn't bad, but I'm not sure if I want to return because of their slow service.  I'm hoping that they will be able to speed up their service and I'll hopefully return with a better review.", "name": "Fiorillo's", "rating": 3}, {"index": 161, "review": "Wish I could give a zero star.   Trust me don't even consider coming here.  Owner Is a terrible person that I hope I never have to see again", "name": "Fiorillo's", "rating": 1}, {"index": 162, "review": "I'm trying to think what would horrify my Italian Grandmother more: watching the cast of Jersey Shore run half naked and fully drunk through the streets of Florence, or eating at Fiorillo's ... I think I have to go with a meal at Fiorillo's. \n\nMenu:\n\nI seriously thought I was on drugs reading their menu. Fiorillo's is (or pretending to be) an Italian restaurant right? What's more Italian than a Chinese Chicken Salad? I practically choked on my water. Well surely the \"Zuppa\" must be more authentic than the salad selection ... nope ... among their selection: Baked French Onion Soup, New England Clam Chowder (I can't make this stuff up), and Lobster Corn Chowder. To finish it off, how about a hamburger with steak fries .... just like they serve in the old country. \n\nFood:\n\nIf I wasn't with a friend and his family I would have bolted for the exit upon reading the menu, but I had no other choice but to order. I picked what I believed would be the easiest thing on the menu to get right, cappellini in a tomato and basil sauce. The pasta was overcooked, bland, and borderline inedible. \n\nHide your grandma's, this just isn't cutting it", "name": "Fiorillo's", "rating": 1}, {"index": 163, "review": "Fiorellos has a very east Coast New Jersey vibe.. you know badda bing badda boom, \" joey butta fuko, how you'z doin? Welcome to the coza nueztra\" ( I don't know what I am saying)   \n\nIt's very clean, large, but the ambiance is cold and generic.  My family absolutely loves this place and I will say this is a great place to come with a large group. The owners and the waitstaff are nice and very accommodating. I have a loud Puerto Rican family so I very much appreciate their kindness and tolerance with us :) ( I am not the guilty one) They also have very nice comfortable seating so, I know many people who won't go anywhere if the seats are uncomfortable.\n\nI find the food to be A-ok not terrible but not great either. It has been around forever and I liked it when it was a tinier pizzeria it felt more intimate.  If I recall the pizza is good but it's been awhile. I will go back and try that.", "name": "Fiorillo's", "rating": 3}, {"index": 164, "review": "(3.5 stars) Has all the basic Italian dishes you'd expect & everything was good. The stuffed crab mushroom caps were tasty & I enjoyed my sun dried tomato and basil with chicken. The staff was all friendly however I'd suggest not placing hot plates within children's reach. I wasn't \"wow-ed\" by anything in particular but if you want to eat some good Italian food with fair prices, then this place is for you.", "name": "Fiorillo's", "rating": 3}, {"index": 165, "review": "Took the advice of a co-worker and took one of my employees to dinner here Nice atmosphere and the place was not crowded. There was a table with about 6-8 people and looked to be the family of the owner. \nI decided to have the chicken piccata and the pasta of the day which was bow tie with marinara sauce. The waitress was very nice and attentive and I asked if I could get my pasta with a splash of olive oil and garlic instead of the marinara sauce. She said she would have to talk to the chef. This is where the experience went down hill fast.\nShe came back and told me that the chef would have to charge me $1.50 to substitute the marinara with olive oil  At first I thought she was joking, but it was no joke. I was stunned. I asked to speak to the manager but was then informed there was no manager on duty. I told her to forget the olive oil, just bring it with the sauce. \nLater after our dinner was served, the owner came by to see how the food was. I asked about the substitution and the $1.50 charge wondering why in a nice place like this, he would nickel and dime his customers. He replied that the olive oil was very expensive (he told me it was $35/gal). I told him I didn't want a gallon, I just wanted a splash on some pasta. He went on to explain the cost of doing business, etc. I told him he had just lost two customers, not to mention the rest of my team, over $1.50 and asked if it was worth it. Apparently it was since he stuck to his guns and decided that his precious olive oil was more important than having repeat customers. \nI will never go back or recommend to a place that won't place customer service first. \nUnbelievable!", "name": "Fiorillo's", "rating": 1}, {"index": 166, "review": "My hubby and I found this place in the yellow pages, actually! We couldn't decide on something for dinner (a usual occurrance in our house). We hadn't found a place for good, Italian food here, so we thought we'd give Fiorillo's a shot.\n\nWe were totally not disappointed! We came here at about 7pm and it wasn't crowded at all. We were greeted and seated right away. The ambiance is cozy and friendly. The location is good. Our server was Christine and she was awesome! So fun and friendly!\n\nWe ordered the Ravioli Toscani to share and there was plenty for two people. It was delicious! Of course, my husband likes anything with a little bacon in it, but this was really good :). We also ordered a bottle of wine, and salads before our dinner.\n\nI agree with one of the other reviewers in that there were some pretty non-Italian dishes on the menu. And the specials they told us didn't sound terribly Italian either. But as a business, I'm sure they want to appeal to as many people as possible and still be an Italian restaurant. Mission accomplished!\n\nYes, the prices are a little on the high side. But we had a great experience here and we'll definitely be back.\n\nCheers!", "name": "Fiorillo's", "rating": 5}, {"index": 167, "review": "They passed the first test, the clam chowder is thick and rich, not a lot of potatoes, tastes like it has been cooking for days, perfect and it's a big bowl.\nMy wife loved the Veal Saltimboca. I took a chance and ordered a Pork Chop, great choice, tender & juicy.  \n\nInteresting place, great for families.  One big room and it appeared everyone knew each other.  A little noisy, no more than when my family comes to visit.\n\nWe will defanatly go back.", "name": "Fiorillo's", "rating": 4}, {"index": 168, "review": "I came here for a Dementia Presentation in a privately reserved room. The choices were prawns, steak, or vegetarian. I picked the steak and it came with small potatoes and vegetables. The steak itself was pretty big and super tasty. It was cooked to perfection and tender. I would definitely come again if I'm in the area.", "name": "Fiorillo's", "rating": 4}, {"index": 169, "review": "Best pastas in the bay area. Great Bar. great service. Great food. great atmosphere. i don't know if it gets any better in the bay area. They treat you like family. the food is as consistent and as good as any i have ever had. Renee and Michael are just awesome. Thanks Guys see you soon!! \n\nChicken rollotini is the shizz!", "name": "Fiorillo's", "rating": 5}, {"index": 170, "review": "We;ve had one of the most enjoyable meals in a long time. This Family Run restaurant has the finest customer service and the most delicious food. We are greeted by the sweetest young women and our waitress Elaine, the granddaughter  of the owner was a delight. The food is spectacular I had the baked rigatoni and oysters rockafella and I was in heaven.  I was delighted to get to speak with the owner and found out she was from Brooklyn as I was. I can't wait to bring my husband next time, as I know he will love this place as much as I did. Please try it. You won't be sorry", "name": "Fiorillo's", "rating": 5}, {"index": 171, "review": "Best veal I have ever had!\n\nGreat variety, excellent food and service.  Not much more I can say other than I will be returning soon.", "name": "Fiorillo's", "rating": 5}, {"index": 172, "review": "I'm here in Santa Clara attending Pacific International Quilt Festival.  The customer service was without parallel, from the time I called for directions until the time our dinner was over.  We were given easy to follow instructions to get there from the Convention Center.  \n\nI had the seafood linguine, with a dinner salad and chianti.  It was SO delicious, I'll have this taste in my mouth for a long, long time.   For dessert, I had a cannelloni, which was made with homemade cannelloni cream.  \n\nOur waitress, Elayne, and a trainee Oceana, were delightful.  Elayna is the owner's granddaughter. We were introduced to Grandma, and felt for a minute part of this wonderful family.\n\nThis place is friendly, family owned, and delicious. A \"not to be missed\" experience!  Especially for this tired, out of town visitor!  Thank you!", "name": "Fiorillo's", "rating": 5}, {"index": 173, "review": "Before catching our flight to Southern California, my brother, my aunt, a friend, and I ate here a very nice lunch.\n\nMy brother had the lunch special which was a grilled fish, rice, and veggies, the ladies had soup and salad, and I had a pasta with meat sause, and 1 meatball.\n\nWe all liked Fiorillo's, and thought the guy who told us to eat here, was correct in his recommendation.", "name": "Fiorillo's", "rating": 4}, {"index": 174, "review": "If you like Eggplant, this is the best place to have at.\nThey have my  favorite dishes, the Sandwish and the Pasta dish. I get the Sandwish with best fries in town and a side order of there Italian sausage, That's when I know I have died and gone to heaven.", "name": "Fiorillo's", "rating": 5}, {"index": 175, "review": "Wonderful, warm family atmosphere.  My favorite things about Fiorillo's are the people!  Great, solid Italian cuisine, but my experience here was highlighted today by meeting both the owners, Micheal & Renee, a brother and sister duo that has continued the family tradition.  I used to go to Santa Clara University and some of my peers and some of the professors I used to work went here a lot and treated me.  Now that I am back in the sphere of my alma mater, I will for sure be coming back more often after alumni type events!  \n\nThank you Micheal for your hospitality today!", "name": "Fiorillo's", "rating": 5}, {"index": 176, "review": "I usually have the chicken parm but I wanted something a little smaller and lighter I decided on the cheese ravioli and it was amazing, melt in your mouth ,perfect texture just awesome. Everyone is really friendly our waiter was John he was great and totally on top of every little thing.", "name": "Fiorillo's", "rating": 5}, {"index": 177, "review": "The pizza was good although not great. The crab in my daughter's pasta dish was disgusting - it tasted bad.  We sent it back and they did credit our salads off the bill. My daughter is feeling ill now.", "name": "Fiorillo's", "rating": 1}, {"index": 178, "review": "My first and last time there ever.  My boyfriend and I went there for a late night romantic dinner for Valentines day, our reservation was at 9:30 pm, but we arrived early at 9:20 pm and we were sat immediately.  The first person to greet us was a buss boy who asked us if we wanted waters,  we asked for water with lemon and about 4 minutes later received 2 waters no lemon.  We were finally greeted by our server about 7 minutes after being seated.  I have a special diet and asked for Angel hair pasta with marinara sauce and vegetables on it (pasta Primavera w/red sauce).  Someone came out to clarify what I could or could not eat and then we ordered.  My boyfriend had the ice tea and I ordered a wine, we got salads that looked like they had been sitting there ready to serve for a while, no offer for ground pepper even though we saw someone walking around with a pepper grinder.  The place was not by any means packed. The bar was empty, and people were slowly leaving as we sat there.  By 9:50 pm we had not received our drinks, and I had noticed that everyone around us had baskets of bread and we had none offered to us yet.  I asked the busser for bread,  he brought lemons and butter out and said that the bread was in the oven.  I then got up and asked for the manager, I let him know we had no bread served to us but the busser was getting it and that in 30 mins of sitting there we still had not received our drinks and we were already finished with our salads. He quickly brought out bread that was not by any means out of the oven, and said our entrees would be out in two minutes.  My boyfriend's ravioli with pesto came out fine.  My angel hair with marinara had no vegetables on it so they sent it back to the kitchen and came out later with a bunch of mixed vegetables on top of it that looked liked they came out of the microwave and tasted as such also.  I bit into one that was hot on the side but cold in the middle. So I moved them to another plate.  The dish was lackluster to say the least. I had a few bites and then pushed it aside.  \nWhen the bill came they charged over 20 dollars for angel hair and sauce with a crumby salad and in addition charged over 5 dollars for the crap vegetables they put on it. Instead of charging for angel hair they charged us for baked rigatoni. I asked the manager to take the vegetables off of the bill and he questioned if I had eaten them.  I explained how awful they were and that I had put them on my bread plate and if he had to ask he could ask his buss boy, which as he walked away with our bill I saw him do.  He did take the vegetables off,  but for sitting for 30 minutes without our drinks, and never being offered bread..  Which is an Italian restaurant standard..  There were no discounts or \"we took off the drink to apologize for your wait\", I've had better service at an Olive Garden.  My family has owned an Italian restaurant for over 50 years, as an Italian, hospitality is key.  My boyfriend said he wouldn't bring his worst enemy to that place.  Though the hostess and waitress and busser seemed to be very nice..  They all need better training and that place needs tighten up its, what we call in the service industry, \"2 minutes, 2 bites\".  Being greeted by the server within 2 minutes of being sat,  and checking in on the customer within 2 minutes of receiving their meal.  I do not suggest you go here.  It is overpriced and the food does not meet up to even the standard of Italian chain restaurants.", "name": "Fiorillo's", "rating": 1}, {"index": 179, "review": "Love this place!  I visit Fiorillo's about twice a month and almost always sit in the bar area.  The atmosphere is fun without being too noisy or overzealous.  You can definitely enjoy your meal here and the bartender is extremely personable and friendly.  I try to order something new every now and then.  The Jumbo Baked Prawns are delicious, though I've never had a bad meal at this restaurant... Would definitely recommend!", "name": "Fiorillo's", "rating": 5}, {"index": 180, "review": "Reviews on yelp made me want to try to this place. the decor and ambiance was very warm and cozy, perfect for fine dining except the food sucked. my waiter was friend and nice. the food took forever to come out.\n\ni got the crab-stuffed mushroom caps for appetizers which was alright.\n\nfor entrees, my friend got the veal marsala with veggies and side of pasta. the marsala sauce as flavorful, the veal was soft and tender but they too much mushrooms. the side of pasta was served on a small plate and there was barely any pasta/sauce.\n\ni got the seafood delight. it had tiny mussels and the sauce was not flavorful at all. they put too much mushrooms in my entree too. also the pasta was really dried.\n\ni would definitely not be coming back. i can make better pasta at home..that wont be dried! and i think im done eating mushrooms for the rest of my life. =(", "name": "Fiorillo's", "rating": 2}, {"index": 181, "review": "Just French Onion Soup review: \n\nVery bland broth, and watery. The crouton is good as its based on their table bread which is excellent. The portion of the crouton however was too small, about 1/2 of the size I'd expect/prefer. The biggest issue however was the amount of cheese. Probably 1/3 the amount of cheese I'd ever serve. The cheese that was there was good though.\n\nGetting ready for my main course now!", "name": "Fiorillo's", "rating": 2}, {"index": 182, "review": "Me and my co-workers went here for lunch.  I wasn't sure what to expect, since I don't usually eat at Italian restaurants and most everything on the menu was pasta dishes. \n\nBoy, was I in for a surprise.  They had some special menu items that weren't on the menu and I highly recommend them.  I ordered the risotto filled, jumbo prawns and it was delicious.  My colleague ordered the cioppino and it was the bomb.  You better come with a healthy appetite because they give you huge portions and you will have enough for leftovers. \n\nFor appetizers, we had the crab stuffed mushrooms and all I can say is Yummy!  When I ordered clam chowder with my meal, I expected a cup but instead got a bowl.  I'm stuffed and will definitely go back.", "name": "Fiorillo's", "rating": 4}, {"index": 183, "review": "The Case of the Vanishing Waitresses continues.\n\nI'd rather order takeout but service there is hit or miss, too.", "name": "Fiorillo's", "rating": 2}, {"index": 184, "review": "I recently helped coordinate a retirement party for about 50 people at Fiorillo's and the owner, Michael was amazing to work with.  We booked the venue about 2 months in advance and rented out the banquet area.  We worked with the restaurant to coordinate buffet dinner, rented the dance floor, up-lighting, and brought in a DJ.  The prices were very reasonable compared to other venues, there was ample parking, and Michael was extremely helpful with guiding us on which appetizers to select and what would be the best value for this type of event.  The staff during the event, were also a pleasure to work with.  They were quick with cleaning off tables and were great with bringing coffee and refreshments around.  We ended up doing a cash bar for this event and the layout of Fiorillo's worked out nicely for us.  The bar area is directly next to the banquet area so it was easy for guests to walk to the bar and grab drinks and then to come back to the event.  5 stars for Fiorillo's because they were such a pleasure to work with.  I would definitely book another event at this restaurant.", "name": "Fiorillo's", "rating": 5}, {"index": 185, "review": "My boyfriend and I just got back from this place and it was \" ok \". The reason for the two stars is as follows.\n\nWait time: 5 minutes or so on a busy night with 4 groups ahead of us.\n\nService: Very polite and considerate. The waitress was always on top of things even with such a busy time. She didn't forget a thing.\n\nFood: Bread service- wonderful, Entrees- now here is where things went wrong. We had ordered the chicken masala and the veel parmigiana. The chicken marsala is definitely a dish made for people who LOVE mushrooms. The only problem I can really tell with this dish is that the wine could be tasted in the sauce. It had a bit of a sweet bitter taste that is common when using wine that has been open and set for a long period of time or wine that is just cheap and bad. The veel parmi had one very bad thing with it and that was way TOO much sauce, it was swimming. Coming recently from Adelaide Australia and from having family from Italy I am well versed in parmigiana's. The breading was dead on, the cheese had an ok taste, the sauce was well done but far too much of it. Desert- unfortunately the lemon galati was terrible. It was obviously old and had a terrible after taste.\n\nThis was a very unfortunate dinning experience. I hope others have a better time of it but I don't think we will be coming back again.\n\nOur bill for 1 pepsi, 2 sherly temple, 1 Chicken Masala, 1 Veel Parmisiana, and they comped the lemon Gelati came to roughly $50.", "name": "Fiorillo's", "rating": 2}, {"index": 186, "review": "I went here for lunch after a work meeting. I liked the dessert and the food was fine (nothing amazing/nothing terrible) but I didn't think the menu was that expansive. The menu lacked some traditional Italian dishes, too. Since it was a work lunch, I can't speak to whether or not this place has good bang for the buck. I would probably rather try new places than go back.", "name": "Fiorillo's", "rating": 2}, {"index": 187, "review": "Easily the best Italian food in the South Bay. \n\nGive it a try, if you have not been. \n\nThe sauces are excellent! You simply cannot go wrong at this place family owned restaurant.", "name": "Fiorillo's", "rating": 5}, {"index": 188, "review": "So, I am the Athletic Booster Club President at a local High School. We had our Hall of Fame dinner at Fiorillo's. Just want to say what an OUTSTANDING job everyone did for our event. Had MANY compliments from our attendees about how nice the evening was. We had over 100 people attend and had plenty of food for all and seconds for those that wanted some. Unfortunately, because of medical reasons, I could not eat the dinner they provided but they went above and beyond and made, just for me, a bowl of DELICIOUS chicken noodle soup. I can't thank them enough for their understanding, and when I am up to it I will definitely be going back for dinner. Also was surprised at how reasonable the price was for our event. And last, but certainly not least, they did  a great with the tables and even had colored napkins in our school colors. A BIG thank you to Renee and Mike and all of their staff. GREAT JOB!!!", "name": "Fiorillo's", "rating": 5}, {"index": 189, "review": "I gotta downgrade the stars here from my last experience. Went here for my birthday and made reservations for 7. Granted, we made reservations that day, but the lady on the phone said it would be no problem. Got there and waited about 45 mins to be seated. It was a Saturday, so I guess a wait is to be expected, but it was just poorly organized and horrible service. The lady at the front desk was freaking out, seemed to be seating people in random order, and there were clearly a ton of open tables. I understand if they were short-staffed, but if they would've just apologized and explained it, it would have been so much better than the confusion happening. \n\nThen after sitting down, our waiter took our order right away. After waiting a half hour, we were literally about to leave and get McDonald's because we had been waiting over an hour and had no signs of getting any food. Finally our drinks, bread and salads come out, then 5 mins later all our food comes out too before we finished our salad. It wasn't really our waiter's fault because he seemed to be helping with the banquet AND waiting tables. That's just not possible to do a good job in both. Also, even though we said it was a birthday dinner, no free cake or anything :( I'm not the type of person who wants people to sing happy birthday and cause a scene, so I was a little relieved, but honestly I think most people expect this and might be annoyed if it didn't happen? \n\nThe food was still really delicious and our waiter was nice, I just feel like the management is really disorganized and does not know what they're doing. They really needed more staff and better service. It was pretty disappointing.", "name": "Fiorillo's", "rating": 3}, {"index": 190, "review": "Just had lunch with 6 of my friends and the food was amazing! To start we had crab stuffed mushrooms and the antipasto platter and finished with fried ravioli that was full of flavor. I had the crab bordelaise that had plenty of crab in a lemon wine cream sauce that would go great on anything! My buddy had a veal chop that was cooked perfectly and smothered with mushrooms. The rest of the table were happy we came here because it was their first time. We will definitely be back.", "name": "Fiorillo's", "rating": 5}, {"index": 191, "review": "Bomb!\n\nThis place is one of my all time favorites.  Before going into the review, I want to state my favorite dish here(maybe anywhere):  Chicken Marsala.\n\nBasically, this is an east coast (read: NY) joint.  It is an Italian restaurant owned by someone my friends and I call:  \"The Don\".  Many evenings, \"The Don\" sits at a table, with his back to the wall (presumably to see everyone coming into his establishment, and to stay safe).  If there were a mobster movie centered in Santa Clara, this restaurant would be the home base.  I hope he doesn't read Yelp.  \n\nA family establishment, with a very NY feel in most respects.  Perfect for an east coast transplant.  This is not just a place to eat a meal, but a place to sit down and hang out with your friends/family.  \n\nI was introduced to this place by an old friend, Doug.  I was complaining about the pizza in the south bay.  He mentioned that this place has good thin crust pizza - took me there, and he was right!  \n\nI can't remember a meal I didn't enjoy here (but then again, I mostly get the Chicken Marsala)....  The Eggplant Parmesan  is pretty killer too - with the slight exception of it completely being unhealthy.  Then again, you don't eat Italian food for the health benefits.\n\nIf you like East Coast Italian food - this is where you get it in California.  The location is quite bizarre, which does have the side benefit of always being able to get a table.  I just wish I lived closer.", "name": "Fiorillo's", "rating": 5}, {"index": 192, "review": "Nice standard italian food from a well established Santa Clara business.  I've never had a bad meal here - miss that they don't do the calzones.  I've had pasta, salads and soups here and all have been fine - not quite excellent, but fine.", "name": "Fiorillo's", "rating": 3}, {"index": 193, "review": "Came to Fiorillo's for lunch with family before a special occasion, so it was a weekday at around 2pm. The service was friendly, patient, and attentive - the waitress gave us time to talk and didn't rush us at all. She was a little hard to hear when she told us the specials (why not write them down for customers?!) especially for the older diners who literally had no chance, they couldn't hear OR understand her which was quite awkward. The restaurant was very quiet when we were dining which was SO great, it gave us a chance to hear each other. Frankly, I like Fiorillo's better than Magianno's for a family meal because Fiorillo's is intimate and quiet, feels like a family business, and you don't get that \"conveyor belt\" feeling that I always get at bigger restaurants. At Fiorillo's we felt like we're not going to be told our table was given away or stuck in an awkward corner by the kitchen here... all the tables are well positioned. The food was rich but not overly heavy; the portions were great for the price and there was an option for every diner, even those of us who had finicky requirements like no meat or low salt. We had a Sangiovese with our lunch which was smooth and paired well with the meals. The caprese was AWESOME (and it's hard to say such a simple appetizer is amazing but it was, the sauce they used was fantastic). Also, the mushroom appetizer (Bordelaise?) was so good we ordered another plate!!  The favorite entrees were Chicken Saltimbocca, Veal Rollatini, and Ravioli Toscana (YUM). Definitely a spot I would return to for a family meal, it's a good balance between fancy and casual, expensive and reasonable. Exactly what we were looking for. PS - You can request a tablecloth (it made the whole thing feel a little classier).", "name": "Fiorillo's", "rating": 4}, {"index": 194, "review": "Love Love Love Fiorillo's. Lovely Family Restaurant!\n\nFamily owned Italian restaurant. Started coming here years ago with my best friend Shannen. And would love seeing Mr. Fiorillo sitting at his table watching his restaurant. And haven't stopped coming since. My family and I go almost every week.\n\nGood for really any occasion... Just Dinner, Family Dinners, Birthdays, Anniversaries, Mothers Day. Great Family place. Can't wait for my little one to start eating here. Atmosphere is lovely. They also have a great bar area that always has the sports games on and banquet area for weddings, Quinceañeras, etc.\n\nThe service is great. All of the servers and bus boys are very nice. And the food is AMAZING. Large portions and the prices are really fair. They have a wide variety of food to choose from and the bread is SO good. I always save just enough room for one last slice before I call it quits. I love it. My favorite dish is the Chicken Picatta. And also Chicken Marsala, Sun Dried Tomato & Basil, and can't forget the pizza. Its all very yummy. I love it.", "name": "Fiorillo's", "rating": 5}, {"index": 195, "review": "Good portions. Good service. Good lunch with mama decko", "name": "Fiorillo's", "rating": 4}, {"index": 196, "review": "After going to a party, and eating delicious eggplant parmigiana, I had to go get some. My hubby found this place. \n\nVery nice decor. You can have a wedding here! When we got in, it appears that some sorority club was having an event. Lot of hot girls for single men. Single young men please.\n\nAnyway, our waitress was very sweet. We end up ordering eggplant parmigiana and chicken marsala. My dish came with noodles of the day. While waiting, we were given fresh bread. Different kinds. They were all very very tasty. \n\nThe food however wasn't as tasty. My eggplant came out very salty. I didn't eat my husband's dish, but he wasn't a fan of. The food were standard price for Italian. Protion were good.\n\nWe would probably come back to try others and for the bread! Plus, it's always nice to face friendly people!\n\n3.5 stars overall.", "name": "Fiorillo's", "rating": 4}, {"index": 197, "review": "I been going to Fiorillo's since it was ran by the original owner (Vinny) and always enjoyed the food. On my last visit (June) I brought a date and was surprised by what she said. She pointed out that the restaurant layout is ok and is a notch above Dennys. Next was when we got our food and she noticed the vegetables appeared to be from the freezer and rubbery, luckily the Chicken Alfredo was decent and I had the NY Steak which was good but overcooked from medium (which I said I wanted). This experience opened my eyes and the quality dipped compared to years past. \n\nIf I were to give a rating years ago it would be an easy 4-5 but now in order for me to come back things need to improve. Hope so!!!", "name": "Fiorillo's", "rating": 3}, {"index": 198, "review": "Came here before going to a Santa Clara University Basketball with the family. Good place for families and large groups, they have big tables that seem like they would make a fun dinner. It's a little loud in there, not the place to go for a quiet dinner. \n\nThe food here is good. I wouldn't say its wonderful, just pretty standard Italian food. We got bruschetta as an appetizer but it didn't come out until moments before our dinner arrived. It was actually really good though, so I forgave them.  I got the Chicken Rollatini, which was chicken stuffed with basil, tomatoes and prosciutto topped with a brown mushroom wine sauce. This has such a great flavor but the chicken itself was a tiny bit dry. All their meals come with a side of pasta with a tomato sauce on it, which I think is a little excessive. My sister had eggplant parmigiana, which she said was pretty good. The service was a little slow, but I guess I can be a little understanding because it was 7 o'clock on a Saturday night. \n\nGood food, okay prices but a pretty fun atmosphere. Average.", "name": "Fiorillo's", "rating": 3}, {"index": 199, "review": "I initially decided to dine here with my family after my graduation since it was so close to home and we were very tired. I've driven by it many times on my way to work and school but have never eaten here. \n\nIt wasn't busy and we were seated immediately. When entering the dining area I was a little taken back by how many seniors dined here.  I suppose they know best since the food was a quite good! \n\nI had the mahi mahi in the pink cream sauce with capers and scallops. It was delicious!! My father had something with roasted thin potatoes, prawns, sausages tomatoes and tons more..and that was the most delicious!!! The portions were absolutely huge and the prices were quite reasonable. The service was on point and the man who seemed the manager was sweet and come often to our table for some small talk and to check up on us. \nOverall, it's a  great hearty italian spot with a neighborhood feel! YUMMY for sure :)", "name": "Fiorillo's", "rating": 4}, {"index": 200, "review": "Fiorillo's Restaurant\n638 El Camino Real\nSanta Clara, CA  95050-4352\n(408) 984 0414\nwww.fiorillos.com\n\nJuly 19, 2010\n\nFiorillo's Restaurant has excellent food, especially veal dish, at a reasonable price.  There's a full-bar and lounge, a spacious dining room, and a banquet room.  I guess my wife and I have been there about five times over the years.  We went to party at their past location on El Camino Real near Scott Boulevard about twenty years ago.  Twice we have taken guests there and have celebrated several birthdays there.\n\nIn the past five years that we have been dining there more regularly, I have seen many of the wait staff.  \n\n   \n\n\nSincerely,\n\n\nGary Jonas, Santa Clara, CA", "name": "Fiorillo's", "rating": 5}, {"index": 201, "review": "Great service, the gentleman owner was a very nice man who personally greeted customers.  He passed on the year before last and is dearly missed. Every time I have been here the food and service have been consistently good. The prices seem to be a bit on the high side, but with such good service the experience is well worth it.", "name": "Fiorillo's", "rating": 4}, {"index": 202, "review": "Fiorillo's had changed a lot since they moved from their old location on El Camino (by Scott) to the new location.  The prices have gone up and the food has become more \"generic Italian\".   The only thing I can compliment after my recent visits is the staff who are always friendly and make me feel welcomed.", "name": "Fiorillo's", "rating": 2}, {"index": 203, "review": "I'm sorry for my first time being in California I was recommended this place.. I came for dinner and it was absolutely horrible... Bread didn't taste good and the drink was all juice.. 2 drinks for $19 pour juice.. Now I don't mind paying $20 on 2 drinks but I got what I asked for ... I said splash and received a full cup I don't get people.. I wasn't expecting oh my god but  something nice .... It looks like a diner...", "name": "Fiorillo's", "rating": 1}, {"index": 204, "review": "If Fiorillo's wasn't so expensive, I think I would have rated it higher. The food was good - the service, great.\n\nI must admit that we ordered the food to go, which might have taken away from the pros of the restaurant's atmosphere and wait service. We ordered:\n\nChicken Marsala (actually pretty good, but not much pasta to go for the amount of chicken)\nPesto and Prawns (only a few shrimp for a lot of pasta)\nSeafood Milano\nPastrami sandwich\n\nI would order the chicken marsala again, though probably neither of the seafood dishes. My brother-in-law thought the sandwich was alright, but a little dry so he probably wouldn't get it again.\n\nLike I said before, the food was good, but not worth the price.", "name": "Fiorillo's", "rating": 3}, {"index": 205, "review": "Was similar to DiCicco's in feel & menu size (decently large). Ambiance is more modern/upscale than DiCicco's old school. Seemed to be a lot of large parties (including one bday party) and work group types. I've eaten at Neto's for years and thought this was a real estate office from the outside. Who knew an Italian restaurant was in there?\n\nI tried the marinated tri tip sandwhich with fries (wasn't feeling like pasta today) while my co-workers had the gnocchi alfredo and veal parmigiana. One thing to understand about my co-workers are they are  status quo type eaters. So if gnocchi and veal parmigiana are on the menu at an Italian place they are going to order exactly that. So they reported that their dishes were up to par amongst what they've had. The sandwhich was pretty good. I like tri tip rare/medium rare but since  it was sliced thinly that was going to be hard to get. It was still good nonetheless.\n\nThe wait staff were pretty friendly and fairly attenttive considering all the big parties there were. The atmosphere itself seems more suited for dinners and I think I saw some banquet facilities so they do gear towards large groups in particular. Ill have to go back and try some other dishes and edit this review.", "name": "Fiorillo's", "rating": 4}, {"index": 206, "review": "I have to admit....I haven't been here in MANY years.  I remember that the food was not Italian like I remembered from my years in NY where the Italians really cooked!  This was more Americanized Italian rather than true Italian.  Hence the reason I haven't returned.  I might have to go back to give them a shot at changing my mind....but only if I happen to be really hungry and in the neighborhood.", "name": "Fiorillo's", "rating": 2}, {"index": 207, "review": "Aww Fiorillo's in Santa Clara. How you bring back memories! It had been YEARS since I have returned. Interestingly enough, a Chinese co worker who HATED Chinese food loved coming here for lunch. So back in the day most of our business lunches ended up here. Funny how I still remember that! \n\nNow- about 10 years later, I find myself wondering why I never came back! I think it was too pricey for me back then. lol\n\nI really love the lasagna and the sun dried tomato pasta. The stuffed mushroom appetizers are yummy too! Don't forget the bread! As usual I didn't go with my gut feeling and I ordered something else which I didn't like too much. BUT thats OK! I was able to taste other dishes and I liked all of them!\n\nWhen you're in the mood for Italian dining with out the fuss of Maggiano's or limited menu at Pasta Pomodoro, give this place a try! You can't go wrong with their many selections!", "name": "Fiorillo's", "rating": 4}, {"index": 208, "review": "This place serves authentic Italian food that is delicious. Clams and Calamari were awesome. Our server Charlie C. was great too.", "name": "Fiorillo's", "rating": 5}, {"index": 209, "review": "How come I had to ask for bread plates?  How come they were vacuuming while we were eating?  Under the chairs of customers while they sat, no less.  Four glasses of water for five people.  We had to ask for bread.  The menu? I think if you like clam chowder with your overcooked, cold, watery pasta, then I've found the place for you.  How come a meal for four adults that was not even close to edible cost $120?   The \"meat\" sauce tasted of thyme, parsley, and overcooked garlic.  Where was \"the beef\" in the meat sauce?  It took, are you sitting down...35 minutes to make 4 minute angel hair.  My kingdom for decent pasta in the South Bay.  I feel like I I'm the only one who hasn't woken in my bed next to an empty pod.  Everyone else seems to be enjoying these horrible meals I've had as if they are on some psych medicine.", "name": "Fiorillo's", "rating": 1}, {"index": 210, "review": "Super quick review: \n \nA 4 for service, our server was nice and top, busboys seemed to forget to help, but they appeared out of nowhere towards the end. She was wonderful though. \n\nGot sat right away, even with no reservation. A big plus.\n\nDecor and ambiance was good, but I don't know about the noise level. Just seemed way too loud! \n\nNow for the food: It was OK. Nothing spectacular. Just seemed bland. Maybe a lil more spice and less cheese, just a suggestion. \n\nI think this place better suited for more families than young adults. Give it a try.", "name": "Fiorillo's", "rating": 3}, {"index": 211, "review": "I tried Fiorillo's for two reasons: the trusted Yelp reviews and the very close proximity to my house. \n\nI dined here with my family and my brother and his wife last weekend to celebrate two very special birthdays. \n\nLet's not beat around the bush... 5 stars for the impeccable service (our waitress was awesome and the rest of the staff were very nice) but the food gets 1 star. I was not impressed and disappointed to find out that the food was not as good as Yelpers raved them to be. \n\nHere's what we ordered: \n\nAppetizers\n- Calamari with Marinara Sauce (OK)\n- Stuffed Crab Mushroom Caps (good)\n\nEntrees\n- Veal with Veggies and Side of Pasta (OK) brother\n- Ravioli (good) his wife\n- Eggplant Parmigian and Side of Pasta (not good) me \n- Pizza with everything (not good) hubby \n\nDessert \n- Vanilla Gelato (good) \n\nThe eggplant parmigian tasted old. The side of pasta was really small (someone told me that it was big). It was the size of a bread & butter plate. I also tried the pizza. It looked and smelled good but the taste was just not there. The cheese tasted strange. I think it was imitation cheese. The way it melted on the pizza had a peculiar look to it. The portion size here was on the medium side... not large at all. \n\nI don't think I will be coming back here. I am so disappointed.", "name": "Fiorillo's", "rating": 2}, {"index": 212, "review": "Very nice restaurant. Very upscale and clean on the inside.  We tried their pizzas.  Nice thin crust and yummy toppings.  Got to admit they are really good. \n\nHas a bar and full menu of fish, chicken, veal and pasta.  Attentive service.  \n\nWorth a stop by for sure for a nice meal.", "name": "Fiorillo's", "rating": 4}, {"index": 213, "review": "Yum yum.  I love this place.  I also love that it is a family run business which I would much rather support than some random chain restaurant.  I have been coming here with my family for many years now and am always made to feel special.  I have also had an occasion which my family used the banquet room.  Everything turned out wonderful.  Now can you open a smaller version in Willow Glen? Thanks!", "name": "Fiorillo's", "rating": 5}, {"index": 214, "review": "We just had our wedding reception here and it AMAZING. \nThe first time we walked in, Mike (co-owner) dropped what he was doing and came out to show us around the hall and explain the menus. He was very helpful and willing to work with us when we wanted to tweak things. \nRenee (his sister, and co-owner) is the catering manager and she was lovely, listened and gave suggestions that were helpful. \nRenee and her crew did a wonderful job decorating, we told her to be creative and she was :) \nEveryone raved about the food, Chicken Marsala and Baked Ziti was delicious! The servers were very nice, and even helped fix our cake when the topper which was top heavy fell down. \nI don't know what else to say, this place is great.", "name": "Fiorillo's", "rating": 5}, {"index": 215, "review": "Fiorillo's has been my family's favorite Italian Restaurant for many years. We had dinner at Fiorillo's last night. Our wonderful server Christina gets Five Stars.  Christina is personable, sweet and great at what she does, she truly made our dining experience wonderful.\n\nI love two house specialties the New Contadina and Seafood Pasta Fiorillo. Last night I ordered the Seafood Pasta Fiorillo and surprisingly the calamari and shrimp in the dish were slightly overcooked.  My husband had the Veal Parmigiana and it was very good. We do love the restaurant and this was the first time my selection was not cooked to perfection so we will go back and ask for Christina.   Anita", "name": "Fiorillo's", "rating": 4}, {"index": 216, "review": "I've eaten at Fiorillo's several times in the long-ago past and recently visited them again.  Their menu selection is good and flavors are as I remembered them - tasty.\n\nI have several favorite items here, including the Chicken Marsala, Baked Rigatoni, and their pizza.  The Chicken Marsala has a delicious dark-colored marsala-based wine sauce with mushrooms.  It's very good and comes with pasta.  The Rigatoni is flavorful also.  The pizza is based on a slightly thin crust (but not wafer thin).  The sauce tastes great - just as I remember it.  You should know that Fiorillo's bakes their pizza with a slightly darker, sometimes more \"burnt\", crust than you may like (see pictures in the review).  Some people like this; others don't.  If you one of the latter, then you should know this ahead of time so that you can ask for a little less baking time on your pizza.\n\nAtmosphere is very nice.  Wide and open with lots of light from large window.  Plenty of room for large groups or families.  Not too noisy during busy times.  The restaurant is nicely furnished much as it was in its original location further up El Camino by Scott Ave. years ago.  Plenty of parking in the lot and on side streets.\n\nService was good.  The waiters and waitresses don't take long to welcome you and take your order.  Bus people come by very frequenlty to refill drinks and whisk away dirty dishes.  Overall, the wait staff was very attentive.  Some though, more friendly than others.  \n\nPrices are mid-level - generally where they should be for this type of dining establishment.\n\nI'd go back again.  Try it out!", "name": "Fiorillo's", "rating": 4}, {"index": 217, "review": "LOVE this place!! Always good food and great service! Sad that they are closed on Sunday and Mondays though...", "name": "Fiorillo's", "rating": 5}, {"index": 218, "review": "We've passed this place like thousand times and never tried it. Finally, we tried this restaurant yesterday!! I was a bit confused tho, when I walked in.  Outside the building appears to be very fancy but once inside, it was very casual. When I walked in, the first thing I saw was the bar and photo frames on the ledge counter.....??!?@@???. Hummm...I didn't realize that this was a family owned restaurant. Anyways, the hostess was super nice and sat us down right away. Friday night and it was not packed at all. The whole ambiance was a little off. The lights were dim, had nice lighting, but the tables and booths were......how do I say this.....like Denny's diner style. I think I expected tables to be covered in white table cloths and white napkins with wine glasses on the table already. \n\nAnyways, besides the whole ambiance, the food was great! I ordered the Prawn Fra Diavlo and David ordered the Seafood Milano. My mistake was ordering it HOT!  But that was my fault because there was an option to have it made either mild or hot. I barely finished my plate since it was so hot! But I did like it. The portion of the plates are huge!!!  David ate his plate up within 10 minutes! We brought our own bottle of wine and they charged us $15 corkage fee. Expensive! The corkage cost more than the wine!!!! \n\nOur server was okay, no complaints. Though, he didn't smile much. \n\nWe will definitely come back!!!!!!", "name": "Fiorillo's", "rating": 4}, {"index": 219, "review": "I can't really complain. My food was free, it tasted good and I absolutely inhaled the left-overs. The lamb chops were thin and chewy, but the sauce was mushroomy-goodness. Rice? Not a big fan of the rice.\nService was pretty good considering our large group of sassy ladies.\nThe pasta looked better than my particular dish. I dunno, I guess I expected this place to be more Italian. I'll have to come back for a retry.", "name": "Fiorillo's", "rating": 3}, {"index": 220, "review": "The food was very good (4 stars actually), but the service was definitely sub-par.  They took our drink orders and got us started on a bottle of champagne, but between the time we were seated and the time they took our dinner order was about 30 minutes.  Further, my water glass was never refilled during the entire 1.5 hours we were there, even though I specifically asked for a second glass of water.  \n\nAll of that might have only been enough to ding the restaurant down to 3 stars, but as we paid the bill, one of the service staff accused a member in my group of stealing the pen that came with the check.  She even went so far as to bend over to look in her purse, ask her to hand over the pen she saw on top, and when my friend insisted it was hers, the service staff took it anyway.  Finally, my friend checked on the floor and saw that the restaurant's pen had fallen under the table.  Regardless that we found the missing pen on the floor, how desperate are they that they can't accidentally let a pen walk out the door every now and then?", "name": "Fiorillo's", "rating": 2}, {"index": 221, "review": "I'm an Italian from the east coast and this the only Italian restaurant I will go to. Sometimes I have pizza, sometimes I have a dinner entree. \n\nThe prices are reasonable as nice restaurants go. To pick a favorite meal would be really hard for me since I have never had anything there I haven't loved. But if I had to pick a few dinners that really stood out for me, I'd have to choose the Just Steamed East Coast Clams, Baked Rigatoni and they make my absolute favorite steak covered with an aborro rice mixture that is to die for.  \n\nAnd the pizza is incredible and runs rings around any other in this area!", "name": "Fiorillo's", "rating": 5}, {"index": 222, "review": "Attended my high school reunion here in June and the family was extremely accomodating to our reunion committee.  The food and service was excellent.  A great place to hold events.", "name": "Fiorillo's", "rating": 5}, {"index": 223, "review": "Great family owned restaurant. I've been going to Fiorillo's for just about 8 years now... and have always had excellent experiences.  Their chicken rollatini is phenomenal... my favorite dish there. They oysters are also really good...", "name": "Fiorillo's", "rating": 4}, {"index": 224, "review": "well it looks real nice from the outside.... \n\nbut when you walk in and head to the bar....you can get a nice watered down drink for a good $8.00 I guess I was clubbing in SF and didn't know it! \n\nI went here for a wedding reception so we didn't eat in the main restaurant..I am hoping for the regular patrons of this place its a different experience.... \n\n\nI first asked the waitress when the food was coming out if soda was included....she told me NO, and I would have to go to the bar and buy a soda..so I did....$3 soda, pepsi no less! \n\nSo here comes the main course, after the toast and salad. \n\nThe food was garbage....tasted like a tv dinner or airplane food. \n\nThen they bring out bottles of soda for every table...I was pist! \nI bought a 3$ soda that was free....what a crapy staff...and the lady that said I had to buy it was the one that brought the soda to the table....she didn't say a word! \n\nFiorillo's you had a chance to get about 150 new customers and failed! \n\nI will for sure never go back here!", "name": "Fiorillo's", "rating": 1}, {"index": 225, "review": "One of our very favorite neighborhood spots. They happily serve large family groups and they love children!  I guess that's what comes from being an Italian family owned restaurant. The owners and staff know the regulars and happily accommodate special requests and off-menu orders.  \n\nSometimes the food can be a bit salty, but just mention that and the chef will adjust for you.", "name": "Fiorillo's", "rating": 5}, {"index": 226, "review": "Get the cheeseburger!  Ok I know that sounds totally odd, cheeseburger at an italian joint?...TRUST ME...CHEESEBURGER!\n\nOne of the owners was braggin to me that they make one of the best cheeseburgers around, so I took the bait and checked it out and they totally delivered.  It was so moist and juicy and meaty.  And the fries..oh the fries were just awesome!", "name": "Fiorillo's", "rating": 4}, {"index": 227, "review": "Tasty food, comfortable atmosphere.  Especially fond of their pizza. We had an amazingly friendly server last time we went who truly made our night feel special.", "name": "Fiorillo's", "rating": 5}, {"index": 228, "review": "First off - I'm from the east coast (CT, NJ)   OK, I've read a lot of negative reviews and they baffle me.  This place is great.  I'd say it's the best \"close to home\" restaurant I've been to in my 5 years in California.  I'm glad I found it.  I didn't have a problem with the service, it was good both times.  Also, the sauce tastes fantastic.  \n\nThe owner is always around and a delight.  Everything I like to see in an Italian restaurant.", "name": "Fiorillo's", "rating": 4}, {"index": 229, "review": "Been here a few times wth colleagues from work. \n\nWe always made reservations in advance as we came in large groups. Service was good. We were seated promptly and the waiters took care to fill waters and bring menus for everyone.\n\nGeneral consensus on the table that we have enjoyed the following and would recommend to try:\n\nAppetizers: Stuffed potato skins & fried mozzerella cheese sticks\n\nSalads:  Cobb & grilled chicken and spinach\n\nEntrees: baked lasagna, chicken alfredo, chicken parmigiana and the prawns in pesto sauce served over linguine.\n\nThe interior is warm and cozy, good for lunches, date night, family dinners and birthday parties.", "name": "Fiorillo's", "rating": 3}, {"index": 230, "review": "Just ate here last night 1/18/2011. The food was good. Our waitress wasn't attentive enough until I explained that if my drink is empty. a good job has NOT been done, in fact, a crime has been committed. Of course, Chris probably would have preferred I kept my mouth shut, but what the heck, if you don't teach, people will not learn. :)  Love the atmostphere here. Could use a little less herbs and spices on the food, but all in all, it's a good place to go!", "name": "Fiorillo's", "rating": 3}, {"index": 231, "review": "I was looking for a place to host our annual PTA banquet for the volunteers of San Jose Unified School District and was having a hard time finding someplace that could meet our needs: good parking, good food, and - most-of-all - meeting our budget.  Then someone recommended Fiorillo's.  I had never heard of it, but was willing to try.  The first person I talked to was Renee Fiorillo, and right away I knew we had found our place!  It is family-owned, they really care about their customers, and they made everything so easy.  This was the first time I had arranged an event like this, so I had a million questions.  They seemed to realize that even though they do these events every day, other people might not.  They were very patient with me. The room looked beautiful, and was perfectly arranged for our group. Sometimes the food at banquets is not very good or cold or seems \"mass-produced.\"  The food here was very good.  The one odd thing was that the Caesar salad had an Asian-type of dressing, which was unexpected at an Italian restaurant but delicious.  I would especially like to mention our banquet staff, including Maria, Christopher, and Juan, who were all fabulous!   I have heard that they do lots of wedding receptions, and I think it would be good for any occasion.  I highly recommend Fiorillo's!", "name": "Fiorillo's", "rating": 4}, {"index": 232, "review": "This place is awesome! i walk in to meet my family here for dinner and i was greeted immediately by some italian lady who was very nice. I ordered the chicken marsala. ummmmm yummerssss!!!! It was sooo delicious! The wait for the food took long but it was worth the wait. I hear it always takes long, but the way i see it, it must be prepared real fresh, which is why it tasted soo good. I will be back soon!", "name": "Fiorillo's", "rating": 5}, {"index": 233, "review": "I believe that this is a family run business that has good food.  It seems to have become a regular place for our family to meet for dinners. We always start with a few appetizers that I could have as my dinner.   I usually go with one of the specials of the night and haven't been disappointed.  It has good food, with good prices and a fun atmosphere.", "name": "Fiorillo's", "rating": 4}, {"index": 234, "review": "My only regret is not finding out about this place earlier!!!  \n\nGREAT food.  Reasonable prices and very good service.  If I could make ANY critique it would be that the servers could be slightly more attentive, but that's it.  I wouldn't deduct any stars for that because overall Fiorillo's is excellent!  Every meal I've tried has been delicious.  The bread they serve you before hand is awesome! Oh and by the way if you love pizza they make one of the best I've ever had!\n\nGreat job Fiorillo's!!!  I can't wait to come back!!", "name": "Fiorillo's", "rating": 5}, {"index": 235, "review": "I've eaten here quite a few times, and really, the best thing to get is the french onion soup.  It's incredible.  Probably the best French onion soup I have ever had in a restaurant, and I've been in a lot.  Most of the typical Italian dishes are typical and not especially stand out, but I really really loved the Di Capri I had, which was full of delicious seafood.  Mushrooms are a great app...the SO and I fought over them.  This is definitely a leisurely paced restaurant, so don't go if you're in a hurry, but I've never had rude service.  \n\nOverall, a few standout dishes, usually lots of seating if you don't go at peak times, and a family owned place.  Prices are fair for what you get, but again, I would avoid Italian \"standards\" and stick to the seafood dishes as they seem to be their specialty.  \n\nAnd don't forget the soup, seriously, it's that good.", "name": "Fiorillo's", "rating": 4}, {"index": 236, "review": "I've been here many times and would classify it was a great family restaurant that is a step above others in atmosphere.  Not really a place I would recommend for a date to impress.  Rather a place to catch up with friends.  \nThis restaurant has its own unique character and is a great place to people watch.  At times it is filled with more of a senior crowd.  Sometimes there are celebrations with balloons tied to the chairs, and sometimes it seems every other table has a child under the age of four.  It's best to go there with an open mind and appreciate the company that you are dining with.  \nI don't remember our groups ever ordering seafood.  It mainly has been various pastas, marsalas and chicken piccata.  All have been good.  At times I CRAVE their red tomato sauce.  We usually share a salad and enjoy their little bread sticks and butter appetizer.  \nTheir location is a little quirky to find and get into the first time.  But I like this place and look forward to discovering what adventure I will have each time we dine there.", "name": "Fiorillo's", "rating": 4}, {"index": 237, "review": "I drive by this place at least once a week when i'm around SCU or Cluck U. I finally convinced a few coworkers to try it out for lunch. My first impression of the outside was kinda blah. It just didn't look like a restaurant, more like a card room like bay 101. \n\nfirst off, i loved the bread! It reminds me of the cheese cake factory bread. I love those multi grain breads and it came out super hot and soft. I loved it! That's like 2 stars already. \n\nThis place is family owned italian and everything came in large portions and the prices were fair.  I ordered the Seafood Pasta and it was really good. For appetizers I ordered the oyster Rockefeller and that was good. Except it was really rich in creme that i felt my arteries clogging up. LOL. \n\nI walked by a few tables and saw the lasagna looked good as well as the pizza.  I gotta come back here to try out more stuff. There aren't that many good italian places around. \n\noh yeah, one gripe was that the service wasn't that good. The server kept on rushing us on the bill and wasn't too friendly. Either way, if he does that again, he gets no tips!!!!", "name": "Fiorillo's", "rating": 4}, {"index": 238, "review": "For Prime Rib go to Cattleman's restaurant in Livermore. It's the best I've ever had. The night I was at Fiorillos they had Prme Rib on special. Since I love a good Prime Rib, I ordered it. It was overdone and appeared to be a cheap cut and too fatty. I was disappointed. Also the side was new potatoes and onions. The only onions were the skins which are inedible. Terrible! My wife had spaghetti-ravioli with a couple meat balls. She said it was delicious.Brought home enough for 2 lunches. The cannollis were not good either. The  shell was too hard, probably store bought.", "name": "Fiorillo's", "rating": 3}, {"index": 239, "review": "Someone told me about this restaurant a few years back, he said he's been going there for years.  He was right, the food is absolutely delicious.  A little pricey but large servings.  Bar area is a cozy area to have dinner if you're dining alone.  Hostess can be a little abrupt.   Service is a little slow but the waiters/waitresses are friendly and do their best to make sure your dining experience is a good one.", "name": "Fiorillo's", "rating": 4}, {"index": 240, "review": "I love this place! Love the food, love the atmosphere, love the family.  Whenever I'm there they always make me feel like I'm part of their family.  The baked rigatoni is my favorite!  If I could eat out everyday, this is where I'd eat.  I HIGHLY recommend Fiorillo's if you're in the mood for an authentic Italian meal :)", "name": "Fiorillo's", "rating": 5}, {"index": 241, "review": "sad, sad, sad. The food at this place is really good. However, the service was horrible. I took my parents here for their anniversary even though we had read some sketchy reviews.\nWe all ordered pasta, except one of us orderd an entree salad. So of course, while we are waiting for the food, we never see the waiter, never get refills and when we all get our entrees, the easiest one to make, the salad is not served. It took another...almost 10 minutes, to get a salad. Ridiculous. When my brother asked to talk to the manager, he refused to come out and talk to us. Wow, even more ridiculous. I will never go back here again just because of the service, which is a shame, because this place could be great.", "name": "Fiorillo's", "rating": 1}, {"index": 242, "review": "Decent Italian place.\n\nPluses:  large variety of foods to choose from off their menu and large portions for the price you are paying. Service is pretty good too. Food is good as well.\n\nNegatives: ambiance feels like a cheesy Denny's. The outside looks like a gentlemen's club! Somewhat pricey. Not open on Mondays!? Kinda weird in my opinion.", "name": "Fiorillo's", "rating": 3}, {"index": 243, "review": "i love this place! i love that its right by school so my friends and i go all the time.  Its a little family ran Italian restaurant and everyone there is beyond nice.  The service is great and the food is just as good! LOVE IT!", "name": "Fiorillo's", "rating": 5}, {"index": 244, "review": "We've had our annual retirement dinners here for the past 3 years.  Last week, we had a buffet for 65 people.  The variety of food was pleasing as there was something for everyone.  In particular the chicken marsala and baked rigatoni were real crowd pleasers.  The room was set up perfectly and the evening went off without a hitch from the appetizers served in the bar to the slices of cakes served for dessert.  \n\nKudos to Michael Fiorello who was easy to work with and extremely accommodating during both the planning and during the event that evening.  Many attendees raved about the food and when more food was brought out, they were able to take home leftovers.  \n\nWe will definitely consider Fiorello's again for future events.  Thank you Michael and Renee.", "name": "Fiorillo's", "rating": 5}, {"index": 245, "review": "This place is pretty decent. My hubby and I came for an early dinner on Friday and we were the only one's in the restaurant, along with the owner and his family having dinner before the dinner rush.\n\nService was ok, given we were the only one's in the restaurant...the bread was warm and toasty, just like I like it...\n\nI went with the Veal Rollatini and it was yummy, but just a tad over seasoned. The veggies that came along with it were soggy and the mock hollandaise sauce on top was barely passable. The side of the pasta of the day that came with it, was eck...Ragu out of the bottle tasted better than that.\n\nMy hubby had the De Capri which he totally loved...it had all the right seafood elements and the sauce was white wine, butter, garlicky, goodness.\n\nWould I come back here again? Probably not...My hubby, probably so since he works down the street.", "name": "Fiorillo's", "rating": 3}, {"index": 246, "review": "First time at Fiorillo's in Santa Clara. We normally go to buy the Bucket but thought we'd give this long established Italian place a try.\nPizza.......? Sent it back.....it was cold.\nGot it back.....it was warm but the crust was almost burnt.\nChicken Spinach Salad.....\nWaitress forgot the dressing, Chicken was dry.\nGood buy Fiorillo's. Going back to By-th-Bucket. Hands down Fiorillo's has lived past its prime and needs a mission Restaurant Impossible", "name": "Fiorillo's", "rating": 1}, {"index": 247, "review": "Excellent food spoiled by lousy service, what a shame.\nHere's how it went:  \nA party of 8 arrives for their 7:00 pm reservation & is seated at 7:40.  The place is packed & noisy, conversation w/ anyone other than the person right next to you is challenging.  \n  \n7:50 -  water is poured & menus are given out.  \n\n8:05 -  we see our waitress & decide we'd better order while we have her there.  \n\n8:15 - could we have some bread please???  please???\n\n8:35 - soups & salads arrive, what about those crab cakes??\n (soups & salads were pretty good by the way although those of us w/ soup were wishing it was hotter)\n\n9:25 - OMG!!  It's our dinners!!  \nWhy is it that the best chicken fettuccine Alfredo I've ever had was at this place?  God it was good.  Everyone else at my table seemed happy w/ their food too, I'll give them that.  The friend right next to me ordered Seafood Delight & the pasta bowl was LOADED with mussels, clams & prawns.\n\n9:50 - Dessert menu please?  We shared 3 things, none were all that memorable except for the cannelloni but at $4.50 for only one on the plate?  Come on folks!\n  \nOur waitress claimed to have \"been in the business\" for 12 years but as the night wore on, any semblance of attentiveness was gone.  \n\nWill I go back?  Not sure, maybe on a week night, a Monday or Tuesday because like I said, that chicken Alfredo was to die for!", "name": "Fiorillo's", "rating": 1}, {"index": 248, "review": "I come here every so often with my family and really enjoy the food. I order the lasagna almost every single time, but this past weekend I decided to try something new and ordered the chicken vegetable soup. It wasn't very hearty, but I decided to break up some of those delicious bread sticks (that you get for the whole table) and put them in the soup. We also had the calamari as an appetizer which is always a good choice! Although I wasn't thrilled with the soup, I will still come back for the lasagna and the excellent service!", "name": "Fiorillo's", "rating": 4}, {"index": 249, "review": "This review is for a wedding I can't really review the restaurant as far as casual dining since I am sure the food is much different when not cooked on a mass scale. I went here when it was near Mervyn's way back in the day for lunch and as far as I can remember it was good food.\n\nI just want to say that the employees at Fiorillo's were very patient and kind when one of the wedding guests puked all over the bathroom and cussed out every employee in sight. They handled it with a good sense of humor and a smile...I expected them to have a fit. The wedding food was pretty good as far as mass productions goes. I was pretty toasted so my taste buds weren't functioning at their highest level so my opinion might not say much. I would have never guessed that restaurant had that huge banquet room just by looking at it from the outside. We had a blast on Saturday and the restaurant staff made sure nothing got in the way of our fun!!!", "name": "Fiorillo's", "rating": 4}, {"index": 250, "review": "Went with a large party (17ppl) last night.  Service was outstanding by the waitress and the food came out hot and tasty to every ones satisfaction.", "name": "Fiorillo's", "rating": 4}, {"index": 251, "review": "good place for a large (loud) group. the food is overpriced for what it is...although reasonably tasty, i was not overwhelmed. \n\nthe bruschetta was good, and surprisingly, the buffalo wings were delicious. \n\ni had cheese ravioli with pesto...it was meh. the ravioli was stuffed with only ricotta, and the pesto was really creamy, boarding more on an alfredo than an oil based pesto. my best friend had the gnocchi which were not cooked at ALL. \n\nthey had a pretty decent wine list and the service was pretty good (well it should have been...we were the only ones there!)", "name": "Fiorillo's", "rating": 3}, {"index": 252, "review": "I went to dinner there for the first time in two or three years.  The portions are fairly large, and really tasty; I had some angel hair pasta with chicken and sundried tomatoes and it was really tasty.   Portions were large enough for me to eat less than a third of the meal, and take the rest home.  They have really good, warm bread that has sesame and nuts on the outside.  They skimp on how many they give you per person, but you can ask for more. \n\nService was kind of slow, but they came quite a few times to fill up our drinks. \n\nThere is a banquet room that is actually pretty nice.  I've had a birthday party in there for 20+ with tons of room ... you can honestly fit 80+ in the room.  There's also a nice little bar, too.", "name": "Fiorillo's", "rating": 4}, {"index": 253, "review": "Best Pizza\nI love the sauce, crust and cheese. \nPerfect\nI started coming here when they were in the small place in front of the Mervyns plaza, but then they moved up in the world to the fancy place their in now. Its sorta weird now to go there and eat just a pizza because its more of a sit down romantic dinner. Not pizza night. But their pizza is amazing. Never really had any other entree dishes, always wanted the pizza. \nThe service is so so. Sometimes great other times sucks. just depends on who you get.", "name": "Fiorillo's", "rating": 5}, {"index": 254, "review": "The food was okay. Edible, I suppose? I didn't leave here hungry, but I didn't feel like it was worth a second visit at all, unless the people I was with wanted some passable Italian food with decent ambience.\n\nYeah, the place looks nice inside. In fact, it kinda reminds me of those places where you go in Jersey where lots of old people eat. Anyway, the food is decent, and the servers are really helpful and friendly. The desserts are tasty and the ambience is pretty nice. Yeah... bring your parents here or something.", "name": "Fiorillo's", "rating": 3}, {"index": 255, "review": "Very good food accross the board.  The mushroom bordelaise is an excellent first course.  We have been going there for the past 4 or 5 years and have enjoyed every entree that we have tried on the menu, and there are usually quite a few nightly specials in addition to that.  \nI would definitely recommend the cappuccino tartufo for dessert:  a scoop of coffee ice cream with an intense coffee center, coated in crispy coffee flavored meringue peices...very nice.  Service has been hit and miss which is the only reason for 4 stars.", "name": "Fiorillo's", "rating": 4}, {"index": 256, "review": "the husband's family and this place go waaaay back. we've had several significant family occasions here and regardless of the family connection, the staff is always super genuine.  sadly, the calamari picatta that was on the old los gatos location's menu, didn't make it to this one. \n\ntried the baked clams for the first time - if they had an entree size, i'd be all over it. the bordelaise was really delish and the husband can't get enough of their saltimbocca. \n\nthe people watching is always good, and when mr. f is sitting at his table jovially holding court (which is pretty much always), it's a good time.", "name": "Fiorillo's", "rating": 4}, {"index": 257, "review": "Easily my favorite Italian food restaurant. I recommend it to friends and so far 100% favorable responses.\n\nI have tried several different dishes and always walk away completely satisfied.\n\nAs far as the ambience I like it.  Not fancy or romantic but very comfortable and well lit. I always feel relaxed, don't have to get dressed up at all and the service has been good.\n\nIf you want great  \"East Coast\" Italian food, at least that is what my friends from New York tell me, this is the best place in the Southbay.\n\nI have not tried the Pizza but I might just order one today.", "name": "Fiorillo's", "rating": 5}, {"index": 258, "review": "Went there with Arlene the other day.\nFood was decent, but better than average.  The rib-eye was very tender and not dry which was the good idea.\nArlene's seafood pasta looked good and there was a kick to it...so it was good.\n\nService was quick, but we think it was cuz it wasn't fairly busy.  Service was decent.  They do have a banquet hall in the back, so i don't know how that would work.", "name": "Fiorillo's", "rating": 4}, {"index": 259, "review": "My wife, who has ordered a Cosmopolitan from San Francisco to Paris, France says that Lacie, bartender at Fiorillo's, makes the best cocktail she's ever tasted!", "name": "Fiorillo's", "rating": 5}, {"index": 260, "review": "Perfect Service. Good Food.\n\nCeasar Salad - Great Dressing\nFrench Onion Soup - Unremarkable. \nBread - Fresh\nButter - Yummy\nBaked Jumbo Prawns - Excellent, 5 stars.\nPrawn and Artichoke Pasta Special - Average. Prawns were a little dry and the sauce was watery. \nTiramusu - light and excellent\nChocolate Cake - Excellent.\nWine - Delicious\n\nThe waitress was perfectly friendly and helpful and was there whenever we needed her and didnt intrude. The bus staff filled our water glasses and took our plates immediately. Perfect Service. We felt very welcome. A little pricey. Will come back.", "name": "Fiorillo's", "rating": 4}, {"index": 261, "review": "Decent pasta, but inattentive service for our group of 16 spread over two tables.  Slow service from the kitchen as well, but that didn't matter as much to us, fortunately.  Nice decor.  Located in a fresh modern building near the Santa Clara Caltrain Depot.   \n\nFor dinner,  I ordered the Seafood Fiorillo in a marinara sauce- one of the many seafood/Frutti deMare plates.  It arrived with tons of calamari - kind of thin and didn't feel super-fresh, but the shrimp was fresh and good.  somehow though, they seemed to had forgotten the baby clams - either that, or the baby clams were microscopic.  Pasta was al Dente - no problems there, sauce was decent, not as chunky as the marinara that accompanied the Fritti.. see below.\n\nThe Calamari Fritti appetizer was lightly fried in a crunchy peppery batter served with an excellent chunky version of their marinara sauce. 4 stars for the Fritti, 2.6 stars for the pasta, two stars for the service.  \n\nI'll visit again, because it looked promising (maybe I just ordered the wrong thing on the menu), and if I'm not in a rush.\n\nWhere's my water??", "name": "Fiorillo's", "rating": 3}, {"index": 262, "review": "Yummmmmmy! Huge portions for a reasonable price. This is a family-owned place and every time I've eaten there, the owner has been dining there, too. (Weird, but he's always eating no matter what day or time I've been there!) He's kind of loud, but really outgoing- kinda like the Godfather, but jolly like Santa.\n\nThe wait staff sucks and service is slow, but the food makes up for it. The restaurant itself is really nice and clean. \n\nTry the Chicken Rollatini or Saltimbocca.", "name": "Fiorillo's", "rating": 4}, {"index": 263, "review": "I used to live next to this restaurant when I lived in Santa Clara.  Fiorillo's is a family owned establishment. I went there on a whim with a few of my friends.  The venue is very nice with a \"home\" feel to it.  The food is great, but I generally stuck to the pasta.  Also, if there is an entree with an option for spiciness, I would stick with mild.  Don't get me wrong, I'm Korean and Japanese!  I can handle the heat!  But when I ordered \"spicy\" for one of my pastas, I couldn't enjoy the meal since I was too busy putting out the fire on my tongue.  \n\nI'm a huge bathroom examiner as I feel that if the bathroom is clean, the kitchen would be as well.  Fiorillo's had a very clean bathroom with cool black toilets and urinals.  I know this may be irrelevant to many, but I know there are people out there like me who look at minute details.  \n\nFour star restaurant and not a five star because the service was sub-par.  I will be there again, but not for the service.", "name": "Fiorillo's", "rating": 4}, {"index": 264, "review": "I work pretty much across the street from this restaurant. We used to get food catered from this place all the time, and I've dined in the restaurant about 4 times. I always really enjoy my food. I rarely eat italian food so I'm probably not the best judge of quality, but all I know is that I always really enjoy my food. I had the tri-tip steak salad here one time and that was my favorite! The steak tasted delicious and was not overcooked. I've also had the chicken caesar which was really tasty. All of their pasta dishes are really good, I love the lasagna. The only reason it gets 4 stars instead of 5 is because the inside kind of looks like an old folks home.", "name": "Fiorillo's", "rating": 4}, {"index": 265, "review": "Probably the worst experience at a restaurant I've ever had!\n\nI went here for Prom dinner with a party of 12. I had yelped it before and was looking forward to it because of the high ratings on here. But was I disappointed...\nIt wasn't that busy so I assumed that we would get our order in pretty easily. Our waitress was like retarded or something, because it took her about 20 minutes to get us our drinks. I had a sprite without syrup so i had to get another one, which took hella long. She didn't give me and my friend straws so we asked her about 4 times(like 20 minutes) so we asked another waiter to get us straws which too 2 seconds. We didn't get our bread or order in until an hour after sitting down. Food was alright. Wasn't the greatest. Since we had a large party, tip was included and some woman, I thought she was a manager or something. We told her how horrible the service was, and we thought she was going to do something, but she didn't so we ended up paying it. $250 for 12 people. Don't come here if you want good service. It might have just been the server, so if you go there and get the woman with orange hair, get another server ASAP. I'm never coming here ever again.", "name": "Fiorillo's", "rating": 1}, {"index": 266, "review": "I picked this place after seeing their menu online.  They had so much to choose from and something for everyone.  It was myself, my husband, his grandfather and our two kids ages 15 months and 4 years.  The owner greeted us at the door and made us feel very welcome.  He gave us a nice big booth in a corner so the kids could have room to move around.  The wait staff was very friendly.\n\nI had the blackened salmon with veggies and pasta.  I devoured my salmon.  It was great.  Everyone else really enjoyed their meal.  They even had a side order of fries on the menu for my 4 year old to eat.\n\nOne thing that really stood out was the waiter came over and saw a jar of food that I had for my 15 month old.  He offered to heat it for me which I thought was great.  My kids make a big mess when they eat but they didn't even seem to notice.\n\nWe did have to wait a bit long for our entrees.  But that didn't stop my 4 year old from asking the waiter for his food.\n\nWe enjoyed our meal then the owner brought out mini ice cream cones for each of the kids.  No charge.\n\nI will definitely go back to Fiorillo's.  Very kid friendly.", "name": "Fiorillo's", "rating": 4}, {"index": 267, "review": "The food tasted great. We had a large group of about 25 for a company luncheon. Had the bruschetta, crab stuffed mushrooms and the De Capri. Come here with a huge appetite and a lot of time.\n\nService was extremely slow.  We even joked, as we looked around at all the tables our server waited on, that so far the most people got were their salads. Well I guess the joke's on us since it was a 2 hour wait to get our food out.\n\nUsually, for large parties, all the servers help to bring the food out at about the same time. Well, that didn't happen here. Our server carried out a tray of about 3-4 plates at a time. Then, she spent time looking at her paper to see who ordered what. It was ridiculously slow. All I can say is if it wasn't on company time, I would be pretty irritated.", "name": "Fiorillo's", "rating": 3}, {"index": 268, "review": "Food =4 stars, drama from Server =1 star, Overall rating due to service woes = 2 stars.\n\nJust had dinner there on a Friday night with my wife and 12 friends. We reserved a large table so no big surprise and most of us arrived promptly at 6PM. We started early because we had a play at 8PM (at the Triton). Reminded server of 8PM play.\n\nSo we ordered drinks at 6:15PM and ordered Dinner at 6:35PM. Numerous requests for our meal went unanswered by server (\"you had a lot of specials!\"). Appeal to manager went no where. Dinner arrived at 7:35PM - yes - after a 1hour wait!\n\nThe wait literally ruined my evening...\n\nMy wife had the veal marsala - excellent but couldn't enjoy it and put most of it in a to go box. I had the Seafood Fiorillo (baby clams, calamari, shrimp and prawns over fettucini, $15.95).  Ditto on the rating and on the to go box.\n\nI paid my 1/7 share to our friend and bolted for the play.\n\nI won't go back anytime soon... SJK", "name": "Fiorillo's", "rating": 2}, {"index": 269, "review": "Wow! This place is great! We decided to go here on a whim and well thanks to yelp, we had a great dinner. \n\nThe prices were reasonable and there was a wide variety of things to choose from, whether you wanted seafood pasta, veggie pasta, meat dishes, they had it all. \n\nThe only reason that they aren't getting 5 stars is because of the service. The waitress didn't know about the pesto (which for me is important, have the info on stuff on your menu...she'd never had pesto, she also couldn't answer a question on an item w/out looking at the menu). And she was super SLOW with getting refills and getting our check. \n\nBut the food was DIVINE!! I loved it. And so did the other 4 people. Everyone agreed its worth another visit :)", "name": "Fiorillo's", "rating": 4}, {"index": 270, "review": "Our trip to Fiorillos was good.  Not stellar, but good.  On a Friday evening, the place was packed, but we had reservations for 6 and were seated right away.  I wasn't too thrilled that we were seated at a booth comfortable for 4, and they put two extra chairs at the end of the booth for my boyfriend and I; I felt like we were sticking out in the aisle the entire time.\n\nOur server was pleasant.  A little absent-minded, but pleasant.  She brought out the wrong wine at first (white instead of the red that we ordered).  So she took back the wine and glasses, and came out with the correct bottle, but we had no glasses.  So she had to go back and get them.  We were served two different types of bread; the rolls were warm and tastey, but the other ones resembled croutons, and too hard for my taste.  \n\nWe ordered the calamari appetizer; it was a bit chewy.  The \"Mushroom Caps Bordelaise\" were a hit, however.    \n\nMy main entree, \"Seafood Pasta Fiorillo\" was pretty good.  Seafood was plentiful, but the marinara sauce was a bit bland.  My cousin had the \"Seafood Delight\", and she was ecstatic to see that they were quite generous with the clams.  Another friend ordered the special sea-bass dish, which they raved about.  My boyfriend had a veal dish, and he said it was mediocre.  \n\nIt must be a popular spot; we saw 3-4 different (big) groups celebrating birthdays.  Fiorillo's isn't your most authentic Italian cuisine, but it makes for a better place to eat with your friends than Bucca Di Beppo or Maggianno's, in my opinion.", "name": "Fiorillo's", "rating": 3}, {"index": 271, "review": "I came here and had the chicken rollatini.  I guess its an Italian take off on chicken cordon bleu.  It was very, very tasty.  I would definitely recommend it.  The side order of pasta was decent.  The pasta could have been a little more al dente but the sauce was good and a lil tart.\n\nThe place seems very family-like as far as decor plus its right across from the Santa Clara police station so I bet they get a lot of 5-0 coming in.\n\nNext time I plan on trying my Italian standby of chicken marasala.", "name": "Fiorillo's", "rating": 4}, {"index": 272, "review": "While it wasn't horrible, there are much better Italian places in the area, including Aldo's and A Bellagio's in Campbell. The sauce just wasn't fresh like you get in Italy, but more like the sauce you would get out of a jar of Prego.  Service was lacking. No wine menu was provided and after we asked for and received it, nobody came back to get our order. In addition, my husband order soup and I order salad to come out before the meal. They brought my husband's soup before the entree, but brought my salad at the same time as my entree. \n\nThis may be unrelated, but I woke up vomiting at 1:30am after the meal. I think it was food poisoning since I was fine within a couple hours, but I can't be sure.\n\nEveryone else in our party seemed to be ok and nobody complained, so maybe it was just me. \n\nThe bread was good as was the Calamari.", "name": "Fiorillo's", "rating": 2}, {"index": 273, "review": "Fiorillo's is our absolute favorite italian restaurant. We come here at least once a week and always get seated quickly, even on a busy Friday or Saturday night. Portions are generous, the food is excellent, and service is warm & friendly.\n\nMy favorites are the ravioli toscana, crab bordelaise and colossal shrimp. The cannoli dessert is REALLY good.\n\nMy husband loves the chicken piccata, shrimp scampi, pizza, and the lemon tartufo dessert.", "name": "Fiorillo's", "rating": 5}, {"index": 274, "review": "Fiorillo's bring an East Coast Italian flavor to Santa Clara.  A lot of their business comes from Banquets and this is one of the most popular places for weddings, and company events in Santa Clara.  The family owned Italian restaurant is one of my favorites and the huge portions will definitely not leave you hungry when you leave.", "name": "Fiorillo's", "rating": 5}, {"index": 275, "review": "I have lived in Santa Clara for over ten years, and I have been driving by this place numerous times....  Last night, my bf and and decided to check it out...  It looks like they were too busy and we were HUNGRY!\n\nWe walked in, the place was big...  No one at the front desk...  I said, okay if they don't greet us in next 30 sec, we are walking out.  One of the waitress finally saw us and sat us...  Then some more time has passed... I told my bf, \"okay, if they had better service, I'm sure they'll get more customers!\"...   Finally the waitress came and took our order.\n\nWe got a bottle of wine, Fried Calamari, Spanish Salad to start.  Then he ordered the Eggplant Parmesan, and I got the Rib-eye...  OKAY! We were starving\n\nThe portions are huge, food is good, but not AMAZING.. . My Rib-eye was really fatty...  So our dinner for two was about $115.00 including tip.  So it was reasonable, but their service isn't very good...   \n\nI highly doubt we would go back here...", "name": "Fiorillo's", "rating": 3}, {"index": 276, "review": "I had lasagna which is hard to screw up, but it was flavorless  --  mediocre italian food, at best -- service is very slow, so if you go, make sure you're not in a hurry.", "name": "Fiorillo's", "rating": 2}, {"index": 277, "review": "I'm giving 4 stars for the food. The food is always good here, but the service sucks! It's a good thing the waiters don't cook the food. \n\nAfter being seated we waited 20 minutes before being acknowledge by a waiter. His excuse was he didn't know we were sitting there and thought another waiter was helping us.  Lame, but anyway the service didn't get any better and they charged us for taking home bread. After the rude service and long wait you would think they would just give us the bread. When we mentioned the slow service to the waiter his reply was- \"Well you would have waited longer if I didn't serve you.\" \n\nWe laughed because we knew we weren't leaving him a tip. He probably new it too. The food is good so we will come back, but we won't leave a tip if the service is bad again.", "name": "Fiorillo's", "rating": 4}, {"index": 278, "review": "My friend and I went there a couple of days ago. When I walked into the restaurant, I didn't like the decor or ambiance. It didn't really feel like an Italian restaurant more like a Italian diner like Denny's or something. In any case,  we ended up ordering two pasta plates from the Fruit De Mar section. Seafood Milano and Seafood Pasta Fiorillo. The food arrived in a timely manner. The portion is pretty good size, had some left overs. In the end it was delicious and I would come back.", "name": "Fiorillo's", "rating": 3}, {"index": 279, "review": "A touch overpriced but I always have a good time here.\n\nRecommend the baked rigatoni to anyone.  Prawns fra diavlo is good too if you want something with a bit of a kick.", "name": "Fiorillo's", "rating": 4}, {"index": 280, "review": "I come here with my wife once every couple of weeks for lunch, and we love it! It's very casual, with comfortable seating. The bread is here great - it's always served warm. I typically get the caprese salad as an appetizer and eggplant parm as my entree, usually with italian sausage on the side. I highly recommend all of these dishes.\n\nOverall, this is my favorite italian restaurant.", "name": "Fiorillo's", "rating": 5}, {"index": 281, "review": "Wow! We attended a friend's event.  The food was very good, especially the salmon.  But the service was unusually outstanding for a large event.  ALL the servers were very kind and genuinely WANTED to serve with a smile. Five stars to Fiorillo's!", "name": "Fiorillo's", "rating": 5}, {"index": 282, "review": "Ate here once with my parents when I was still at SCU.  Seems like a hole in the wall sorta near Mondo Burrito, since I never even really notice this place, since you'd only drive by it if you were trying to go here.  It looks nice on the inside and I remember having one of their meat filled pasta plates.  Probably ravioli or something of that sort.  Seemed good, but nothing that great.  If I was to compare Fiorillo's to another restaurant, I'd probably say it's probably just a better looking, more intimate, and slightly more pricey Pasta Pomodoro's or Tomatina's", "name": "Fiorillo's", "rating": 3}, {"index": 283, "review": "I just tried a new (for me) pizza. It was tomato and cooked onion. It was great wit a crisp crust and great flavor. A lot lower calorie compared to pepperoni.  Also, it warmed up fine in the toaster oven and the crust crisped nicely.", "name": "Fiorillo's", "rating": 5}, {"index": 284, "review": "A friend took me to Fiorillo's for lunch the other day.  The place doesn't look like much from the outside and it has a very casual interior atmosphere.  I had the chicken picatta and it was fantastic.  I intend to go back and try some other dishes, but it was nice to go to a non-chain restaurant and have good food.", "name": "Fiorillo's", "rating": 4}, {"index": 285, "review": "WOW!!!! What a great place. I am born and raised Italian and Fiorillo's is the Real Deal. Fantastic food and atmosphere. I would highly recommend this restaraunt to everyone.", "name": "Fiorillo's", "rating": 5}, {"index": 286, "review": "Food was surprisingly very very good(based on reviews on this site).  Cooked very well, very flavorful without being salty.  The pasta was al dente.  Very generous portions for the price.  The owner Michael and other servers bent over backwards to accomodate a very large party with specific requests.  Highly recommended.", "name": "Fiorillo's", "rating": 5}, {"index": 287, "review": "My soon-to-be in-laws have been bringing me to Fiorillo's since 2004. We always eat in the bar and our service is always good. Since we eat at Fiorillo's so often, I've had the opportunity to try a great deal of their menu. Of the appetizers, favorites include: the bruschetta, the Oysters Rockefeller, crab cakes with pesto, crab stuffed mushrooms, I could go on and on. The bruschetta is the best I've ever had, it's probably my absolute favorite out of the long list of delicious appetizers. The tomatoes always taste fresh and juicy and it's just the right amount of seasoning and toasted baguette! Mmm :D\n\nI would recommend their cheeseburger, which is kinda weird at an Italian restaurant, but it really is awesome! I usually cut it in half and reheat it later, it's just as good! The salmon is really good grilled or baked, I prefer the grilled though.\n\nWe just recently started ordering desert to go. Their gelato is the perfect texture and flavor, and their raspberry cheesecake slice is huge and seriously the best cheesecake I've ever had! I love to eat it while watching Project Runway or something equally decadent :D\n\nI am going to be having my wedding rehearsal dinner at Fiorillo's soon, I'm really looking forward to it! We are scheduled to have lasagna. I've had their lasagna before, and it is delicious and the portion is huge. I hope all our guests love Fiorillo's as much as I do.", "name": "Fiorillo's", "rating": 5}, {"index": 288, "review": "Sorry, Fiorillo's.  I did not like this place very much.  I came here for lunch, and the service was very poor.  On top of that, we were given dirty dishes, and the waitress was looking right at them when she passed them over to us.  The food was mediocre, nothing memorable.  If you're craving good italian food, Fiorillo's will fall short of your expectations.", "name": "Fiorillo's", "rating": 2}, {"index": 289, "review": "Fiorillo's is like a knock-off Prada handbag:  from a distance it looks the part, but up close everything sort of falls apart.  Unlike a cheap knock off, however, this entrees, drinks and appetizers here are every bit as pricey as they are at real restaurants.", "name": "Fiorillo's", "rating": 1}, {"index": 290, "review": "We went there yesterday for lunch and ordered two vegetarian dishes. They served it with chicken and had to be returned. They removed the chicken from the top and served it to us again but chicken pieces were still evident under the pasta! The waitress went back and finally got a new batch prepared for us.  I would expect better service from a family run place especially during lunch time when they are not that busy.", "name": "Fiorillo's", "rating": 2}, {"index": 291, "review": "I had several hours to spend in Santa Clara while my daughter took a class, so I looked up SC restaurants on yelp and came to Fiorillo's for dinner.  The gentleman who seated me was very pleasant, I  think he's probably family/manager.  So, the little crispy bread sticks that came out were nice; I ordered a glass of wine.  The bread they served was very good.  My waiter was pleasant.  I ordered eggplant parmigiana.  The dish came out baked, very hot, with a side of pasta with the same red sauce as the eggplant was cooked with.  After letting it cool a few minutes, I tasted it and it was so overpowered by the sauce.  Not wanted to be hasty, I kept trying a few bites, twice the waiter checked with me and I said all was okay.  But the third time he asked I told him the sauce was terrible, it tasted like maybe it had cooked forever, and perhaps burned on the bottom of the pot or something.  I cook myself; I know what a good marinara sauce should be.  This was so dark and bitter.  I saw the waiter pass this information on to the man who had seated me.  I never got an offer for another item on the menu, a complimentary glass of wine, dessert, or a credit, nothing.  I had also ordered a chicken dish to take for my daughter, so my bill was close to $60 after I added the tip.", "name": "Fiorillo's", "rating": 1}, {"index": 292, "review": "Wow I lived in Santa Clara all my life, yet I never knew of this place earlier. First time I went here with my boyfriend for dinner and it was pretty empty. Not many guests. We were waiting for 15 minutes for someone to seat us, but no one came. So we left and I was very disappointed. Then I decide to give this place another try and this time I went with my friend for lunch. I had the ravioli toscana and it was great. I would definitely come back here again. But service was slow so -1. This restaurant is a family owned business. You can tell this because there are family pictures right when you walk in. As I was waiting for the hostess, I would look at their family pictures and I must say they have a beautiful family.", "name": "Fiorillo's", "rating": 4}, {"index": 293, "review": "Tried thier Sun-Dried Tomato & Basil and fried zucchini and seeded bread. I actualy had this while with a business take out. So cant comment on thier in house service. But the food yummy. This can be one good italian I tried.", "name": "Fiorillo's", "rating": 4}, {"index": 294, "review": "My absolute favorite Italian place!  This is a family restaurant that's super nice, clean and offers delicious food.  I highly suggest their Crab Cakes and Veal Parmigiana!  There will be NO room for desert at this place!", "name": "Fiorillo's", "rating": 5}, {"index": 295, "review": "Food is okay - generic Italian.  I've been there for private dining and also for parties.  My husband I ate there twice in two weeks and there was no waiter assigned to our table both times.  When we asked to tell the manager (since this was obviously a pattern), Mr. Fiorillo yelled at us to never come back to his restaurant.", "name": "Fiorillo's", "rating": 2}, {"index": 296, "review": "I have been a loyal happy fan of this restaurant since 1987.  Many delicious meals and family celebrations have been enjoyed over the years at this restaurant.  Sadly to say, tonight was a complete disaster.  One of our favorite dishes, chicken parm, was served with a drop of melted cheese. Normally, this dish is covered with melted cheese. I asked the waiter to take it back, and put cheese on it, and his reply was that this dish comes this way. I told him I have had this dish for many years, and it is served with lots of melted cheese. The waiter returned to our table and said that the cook can fix the dish, but there would be an additional charge for cheese.  What poor customer service. The dish should be called chicken in marinara sauce. I told the waiter that I did not want the dish and he can take it away.  A few minutes later, he returned to the table with my meal wrapped in a box. He said that the cook said to give this to me.  I told the waiter to return it to the cook, it wasn't coming home with me. We paid our bill, and the waiter apologized, then we went to speak to the manager. The manager told us we should have rejected the dish immediately, and this was our problem.  We will not patronize this restaurant ever again.  We can forgive a mistake, but not the harsh unprofessional reaction to our request.  This was uncalled for and mean spirited.", "name": "Fiorillo's", "rating": 1}, {"index": 297, "review": "The best thing about this place is the food, it's good. other than that eh....not so much. onwed and run by italian family- a bit loud and obnoxious.", "name": "Fiorillo's", "rating": 3}, {"index": 298, "review": "I won't be back. The worst steak sandwich I've ever had. So full of gristle and mayonnaise the whole thing kept pulling out of the roll. What a mess. And served only luke warm. Stay away!", "name": "Fiorillo's", "rating": 1}, {"index": 299, "review": "We currently had the Miss California 2013 Home Coming Luncheon at Fiorillo's. It was one event in life I would not forget.  The deco of the restaurant and the event hall were classy and exquisite.  For less than 200 guests, Fiorillo's offered four totally different style of cuisine, based on our advanced choice and they were all delicious.  Not to mention the marinated broiled chicken breast, and their signature meatball pasta, the Chinese chicken salad was a pleasant surprise as well.  All meals were paired with the soup or salad.  The most significant part I'd mention, was beyond the food though.   Fiorillo's went out of its way to accommodate the tailor made program, and made me feel they are really part of our Miss California and Miss Santa Clara/Miss Silicon Valley family.  We did not leave until 5:30pm and it didn't feel we had spent that long time there.  And Sunday is their off day. A generous sponsorship willing to go extra miles made California 2013 Home Coming Luncheon a big success.  A big Thank-You and two thumbs up to Fiorillo's Restaurant!", "name": "Fiorillo's", "rating": 5}, {"index": 300, "review": "Food was DELICIOUS! The marinara sauce and cheese - yummy!\nIt is family-owned and the cooking showed - did not have the \"restaurant chain\" flavor to it!    Great portions, comfortable setting, decently priced.\nWaitress was courteous but not very attentive and made to feel as if we were an afterthought.  If the place would have been full I could have understood.\n\nStill will definitely be back. The last time I had food this tastly was back in New York!", "name": "Fiorillo's", "rating": 4}, {"index": 301, "review": "I use to work in the area, so would go about once every two - three months.  I bit pricey for lunch but very good food.  Not a good place for a meeting - very loud and almost always crowded.  There is a comfortable small bar area for a cocktail, where you can hear yourself think.  So enjoy, but get it to go!", "name": "Fiorillo's", "rating": 3}, {"index": 302, "review": "Fiorillo's was recommended to me by a couple of friends, who raved about this restaurant so I had to try it.\r\nThe first time I came here, it was a Sunday.  They are closed on Sunday and Monday. So, it was a no go.  \r\nThe second time I came here it was a  9:15 pm on a Wednesday. (not the same week.)\r\nThe sign on the door says \"Restaurant closes at 10 pm.\"  So, to me that means they are still open.  The guy who was supposed to seat us gave a rather *obvious* look at his watch as if to tell us they were about to close.  My husband says to they guy, \"you guys are still open right?\"  The guy says, \" we close in 15 minutes.\"  I say, \"but your sign says you close at 10pm\"  He says, \"the restaurant closes at 930, but the bar is open until 10pm.\"  Normally that would make perfect sense to me, but since there was no indication of that on the door I was a little peeved since  I was a little happy that  they were open so late. To make a long story a little shorter, I decided to just leave and rate them really poorly on yelp.  Instead, I kept thinking about how good my friends said this place was and it was really close to our future home.\r\nAnyway, even I am a little surprised that I actually came back a third time after all of that B.S.  \r\nThe third time, I came at 730ish and the place was practically dead.  The service was extremely slow, and the place gave me this boredom feeling like I was 5 years old again sitting in a very adult place having to behave.  It's kind of hard to explain, the place is clean and all but it's just a really boring atmosphere. *YAWN*\r\nOh, so back to what this review should really be about, the food!  It was really good.  I stuck with an Italian classic, the chicken parmigiana.  It came out in a super hot dish with the cheese all bubbling hot and yummy.  My husband got the chicken rollatini? which was basically a chicken breast stuffed with basil, mozzarella, and prosciutto then breaded and sauteed and covered in a mushroom wine sauce.  Pretty tasty!  \r\nThe prices are a little high, in my opinion, for the value. For that reason and the atmosphere of the place, I'm not dying to come back here anytime soon.\r\n\r\n\r\n**YES, I know this is long and wordy.... but sometimes you just hafta vent**", "name": "Fiorillo's", "rating": 3}, {"index": 303, "review": "I have been here a couple times in the many many years I have lived in Santa Clara, once in the old location by Mervyns Plaza and a second time in the new location by the new police station--and both times I was disappointed. The food is mediocre. I don't know what the fuss is all about. I'd rather go to Tony and Albas to be honest, or Pizza My Heart, or Pizza Antica...or Pasta Pomodoro...the list goes on and on.", "name": "Fiorillo's", "rating": 2}, {"index": 304, "review": "The food: one person received hard, undercooked pasta.  Another asked if he could get a steamed piece of fish (healthy) instead of fried and buttered.  The server said it would be fresh sea bass, but it was right on the edge of spoiling.  She charged us $24.95 for that.  \n\nThe server: attitude.   We couldn't make a scene as we were seeing friends we hadn't seen in many years.  The waitress seemed to sense that and made a few snotty comments throughout the evening.  Then after signing the credit card slip, I forgot to put the folder on the outside of the table for her.  I stll had it on the table in front of me.  Impatient and unwilling to wait for us to actually leave before getting her money, she lunged across the table and snatched it away.   Not recommended - overall poor experience.", "name": "Fiorillo's", "rating": 1}, {"index": 305, "review": "I am so glad and have no regrets for having my wedding reception at Fiorillo's restaurant! I could go on and on with how my whole evening went but let me just throw out some of the reasons why I am grateful to have had my dinner and dancing there. Renee and Mike Fiorillo were the most pleasant and helpful people to do business with.  They made me and my husband very well informed of everything from the set up of the venue to the food selections available for our wedding dinner, etc.  The place looked magnificent and the food was way beyond what I expected for a reception! Not to mention, the price per head was relatively inexpensive compared to other venues we've visited! A+++ and we'll be surely coming back to visit during one of our italian craving evenings =)", "name": "Fiorillo's", "rating": 5}, {"index": 306, "review": "My favorite Italian restaurant in the Bay Area.  Family owned, friendly, clean, great food.  A landmark in Santa Clara, the Best!", "name": "Fiorillo's", "rating": 5}, {"index": 307, "review": "This is a good, family-style Italian restaurant that's also family owned.  They used to be located in an anassuming strip mall on the El Camino.  They moved to this new location about 10 years ago, and is a popular dining destination for SCU families and locals.  The food here is consistently good, and they offer pasta, steak, and seafood dishes.  They have a great selection, so you'll be sure to find something you like.  They also have a wine selection that does not disappoint.  It's great for large parties and banquets.", "name": "Fiorillo's", "rating": 4}, {"index": 308, "review": "First of all, I haven't reviewed anything in a long time because I am disgusted with Yelp.  They have blocked my computers' IP address for no reason and I can't access it from my home comouter.   Nonetheless my experience here at Fiorello's, I sit at the bar as I write this,  has been really, really mediocre.   The food is okay but my experience at the bar is what I am writing about.  To start with, the bartender has too many responsibilities  and apparently can't handle a bar with 14 people in it and make drinks at the same time.  It's apparent that she is not familiar with the bar, and the workload is too much. Her attitude leaves a lot to be desired and  she doesn't seem to know where things are. She also interrogated me on whether or  not I wanted another drink and seemed disgusted that i didn't jump on the offer for another light drink. On top of that the pours are very light for what they charge.  I can't tell what is worse, Zen Lounge in Mt. View with their extremely light pours and high $ of drinks or Fiorello's with their  light pours heavy $ price, and mediocre service.  In the end, I will definitely not recommend Fiorello's to you the reader or anyone that I know.   One final thought, we all write reviews and read them and can often times impact a restaurants business, so instead of writing a review bashing this place and then leaving it at that; I challenge Fiorello's to make my experience better and show me and all of you that they are worthy of great reviews.", "name": "Fiorillo's", "rating": 2}, {"index": 309, "review": "WOW, I had a last min party of 26 here and not only did they accomodate us....just about everyone loved their food too.  Their crab stuff mushroom was most excellent (don't forget to dip your sesame crusted bread in the sauce afterwards!).  I had the sundried tomato cream sauce pasta with prawns and it was definitely how I imagined it but better.  They split our table in two and had 2 servers for our tables.  The wait staff was very nice and attentive. Our waters was always filled and drinks kept on coming.  Will definitely be back.  The only trouble we had was figuring out what to have for dinner!", "name": "Fiorillo's", "rating": 5}, {"index": 310, "review": "4 stars for the food only.\nThe food rocks! service sucks though, so a star off.\n\nfood took foreverm (over 30 minutes) with no explanation from the waitress. we had to ask too many times just to get bread.  (their bread is really good & is served warm, &has sesame seeds) when the food came, she never checked up on us to see if we needed anything, and later she just put the check on the table Um..I wanted dessert so I had a busboy flag her down.  When she came back I asked for a dessert menu and she says \"OH\"", "name": "Fiorillo's", "rating": 4}, {"index": 311, "review": "Family owned Italian restaurant with all the perks that come along with it. The owner Vince is worth a bundle of laughs. You'll certainly hear him in the restaurant if he's out on the floor. While my tastes are limited, I haven't had a bad dish yet. Can carb up on sphagetti, have a good steak,etc as the menu has a lot to offer. Their specials are usually rated well too. Pizza is great for eat in or take out, and they always serve bread and focaccia with meals. Salads are nice and fresh too. They also have a banquet hall, which seems to be pretty busy. I've attended one function there. Service can be the bigger complaint. One of the longstanding servers passed away in the last year and it varies by who you get. Certainly, ask to speak to Vince if you have an issue. He'll do what's right.", "name": "Fiorillo's", "rating": 4}, {"index": 312, "review": "Celebrated my mom's birthday on a Friday night.  Made reservations in advance.  They have a bar there where guests can grab a drink before hand.  They don't make you wait for your whole party to get there before seating you.  Crab Bordelais was to die for!!!  Crab stuffed mushroom caps were delicious.  Server was friendly.", "name": "Fiorillo's", "rating": 4}, {"index": 313, "review": "I love this restaurant. The food is great and the staff are all super nice. I bring my daughter and they always give her a special ice cream cone after she is done eating to keep her occupied so I can eat. I love the filet but they just took it off the menu!! The crab stuffed mushrooms are great and I really like the seafood pastas they have.", "name": "Fiorillo's", "rating": 5}, {"index": 314, "review": "For a work lunch place I think it's not bad.  Lots of seafood options that are pretty tasty, steaks were cooked nicely, the bacon/peas rice was really good.  Mushroom apps was good.  Bread is not bad.  Service isn't the best here but it's not outrageously terrible.", "name": "Fiorillo's", "rating": 4}, {"index": 315, "review": "Great food! Generous portions! I think the thing I like best is \"Vinnie\", and his presence. Well worth the price.", "name": "Fiorillo's", "rating": 5}, {"index": 316, "review": "What a great find! Fiorillos is a local Italian gem of a restaurant that I'd recommend to anyone. Their food was unique and deliscious. The prices were also not overwelming. I had a stuffed chicken something or another and the dessert was an espresso ball ice cream thingy. Service was also great. I loved it and want to go again soon! A-.", "name": "Fiorillo's", "rating": 5}, {"index": 317, "review": "Don't go there with a large party after having made a reservation. You'll arrive with 27 people and they won't have your reservation. Then the banquet coordinator/manager wench-bag will be very rude to you and argue that you never made a reservation and that everything you were told on the phone when you did make the reservation would never have been said. OH.. and that they don't make mistakes like losing a reservation. So you tell them that obviously a mistake has been made... but the insolent hag insists that the mistake wasn't on their part. Meanwhile you're standing there with your 27 guests but she's too busy humiliating you and trying to make you look as if you're an idiot in front of your guests and everyone else who had crowded in for their parties, instead of bending over backwards to accomodate you after having lost your 27 people reservation. Not an apology, not a kind word, not even a free appetizer. The food is expensive and not worth the wait. They don't even serve a salad with the food. Just a slab of over-salted pasta on a plate. Thanks for NOTHING, Fiorillo's.  Oh wait...there is something to thank you for: THANKS FOR RUINING MY COMPANY HOLIDAY PARTY!", "name": "Fiorillo's", "rating": 1}, {"index": 318, "review": "I had a leisurely dinner here with a friend on a Wednesday night.   My Veal Marsala was excellent.   Her meal (can't remember what it was) was also very good.  She's a former Santa Clara resident and this was one of her favorite restaurants.   The only disappointment was that the service was a bit spotty.   I am not impressed with restaurants (typically Italian) that mistake quantity for quality.  Fiorillo's is generous with the quantity (I had more than enough to eat and still took half my meal home in a doggy bag), but the quality is still excellent.   Way better than any of the chain restaurants.", "name": "Fiorillo's", "rating": 4}, {"index": 319, "review": "I have been driving by this place forever and always wondered about it. Well with the help of Yelp I saw that yelpers think it's a decent restaurant. We had to try it. Now they are not on the cutting edge of gourmet epicurean cuisine but they are one better to me. The menu reminds me of Italian restaurants back east with menu items that you would find in all classic Italian restaurants. O.J.'s and DeCicco's come to mind as the same type of place. I love it. The dining room is spacious and immaculately clean. Trying to get the most of our experience Tin and I ordered a salad each and four appetizers that we shared. We also added an order of meatballs later. Cause you gotta try the balls!! Everything was seasoned well and tasted like a place that has had a few decades to get it right. Of the appy's I really like the caprese that had razor thin prosciutto shaved on top and balsamic vinegar drizzled on it and just the right amount of salt and pepper. The meatballs were delicious too. We will be back to try some of their mains. While walking out I saw some very delicious looking dishes on other patrons tables. The gentlemen I believe to be the owner walked from party to party greeting them sometimes staying to tell a story. Nice place that doesn't intimidate me anymore. Highly recommend and they might earn that fifth star once I get to try some entrees!!!", "name": "Fiorillo's", "rating": 4}, {"index": 320, "review": "this place is a hidden little gem. i love it! the service was excellent. the staff was friendly and helpful. my dinner was scrumptious! the price was more than reasonable. i even got dessert which was fantabulous. i love this place and can't wait to go back. a great bang for your buck!", "name": "Fiorillo's", "rating": 4}, {"index": 321, "review": "Ever have a hankering for some good red-sauce Italian? That's what brought me to Yelp in search of some good red sauce in the San Jose area. After a few deliberations, I decided on Fiorillo's.\n\nFirst, the service. My experience was quite at odds with some of the more negative reviews I've read here. I came on a Wednesday night around 6:45 and the parking lot was virtually full, yet the restaurant didn't seem to be very full. I was seated immediately by the hostess and my order was taken within a couple of minutes. My waitress was friendly and made sure that my water glass and bread basket were kept filled. She did the obligatory checkup a few minutes into my meal. The hostess was very friendly when I left. I have no complaints about the service, though maybe I was just lucky not to be there on a busy night.\n\nOn to the food. Usually in this type of restaurant, I skip the bread because it's nothing special - just empty calories. The bread here is really delicious -- crispy on the outside, piping hot inside, and covered with crunchy sesame seeds. The mixed salad is pretty standard -- iceberg lettuce, a couple of tomato slices, some sliced onion and mushrooms. Nothing to write home about, but the lettuce is nice and crunchy -- nothing wilted on the plate. Let's move on to the Veal Parmigiana. A behemoth casserole dish arrives piping hot -- better let it cool off for a couple of minutes. A nice layer of melted mozzarella covers some nicely breaded veal slices, bathed in a potent red sauce that I was strangely craving this evening. The sauce isn't what I would consider a top-notch marinara full of contrasting simmered vegetable flavors, yet it is somehow very satisfying with its concentrated and elemental tart tomato flavor balanced with a hint of sweetness. The dish is very tasty. The portion was so huge, I took half of it home. Onto the side dish -- overcooked penne pasta with more of the red sauce. For some reason, the sauce doesn't taste nearly as good over the pasta as it does over the veal -- go figure! I can do better at home with some boxed Barrilla pasta cooked al dente and a decent jar of marinara sauce.\n\nThe atmosphere isn't to die for, yet is acceptable. I did see (and hear) a few people who would have fit right in on \"The Sopranos\" or maybe \"My Cousin Vinnie\". There was one elderly woman diner who uttered \"s**t\" every other word. I guess that just comes with the territory.\n\nOverall a pretty decent experience. I'll come back again the next time I need a red sauce fix.", "name": "Fiorillo's", "rating": 4}, {"index": 322, "review": "Hands down this is my favorite italian resturant to attend with my husband. We have been eating at Fiorillo's for three years now. We were first introduced to this place when we were searching for a banquet hall to host our wedding reception. Renee the banquet organizer is extremely nice, and made the wedding awesome, We had 100 guests and everyone enjoyed the food and service. Renee took care of everything. All I had to do was give her the stuff for the tables and tell her what I wanted and enjoy the wedding. We ordered the London Broil and Chicken Parm and everyone was very impressed. As far as the resturant goes. I do wish they were open on Sundays and Mondays, but they deserve a day off to spend with their family. I love the fact that it is family owned. Im not  a big fan of tomatoes but I have to say they have the best marinara sauce anywhere. Im always torn on the chicken parm or the jumbo shrimps stuffed with cheese and comes with angel hair pasta tossed in olive oil. Their bread is very yummy. It has sesame seeds and sunflower seeds in it. YUM!!! My husband loves their gnocci and for appetizers you must try their stuffed mushrooms. OMG ...they are so out of this world. I do agree service their is not the best for the prices you pay but the food is always great. Never any complaints there. I must warn you , you will feel out of place if you go in jeans...or maybe that is just me.", "name": "Fiorillo's", "rating": 5}, {"index": 323, "review": "I have to say I was prepared not to like this place.  It really seems like a family-owned version of a chain restaurant when you walk in.  But then there's the food.  It's not Italian gourmet but if you're looking for well-prepared American-Italian comfort classics, you won't be disappointed.  The chicken parm was excellent and I had the veal picatta, which was extremely well prepared.  And the entree prices, around $15/plate, are very reasonable.  I will likely return.", "name": "Fiorillo's", "rating": 4}]